{"src_dataset": "MSRVTT", "video_name": "video9572.mp4", "caption": "a woman runs all over town before making music", "counterfactual": "a woman makes music before running all over town"}
{"src_dataset": "MSRVTT", "video_name": "video7169.mp4", "caption": "a women in blue is washing her hands after finishing her work", "counterfactual": "a women in blue is washing her hands before starting her work"}
{"src_dataset": "MSRVTT", "video_name": "video9291.mp4", "caption": "a cartoon character is stabbed and thrown into a burning chamber", "counterfactual": "a cartoon character is thrown into a burning chamber and then stabbed"}
{"src_dataset": "MSRVTT", "video_name": "video8493.mp4", "caption": "a bear cub is diving in to the water in order to catch a fish", "counterfactual": "a bear cub is diving in to the water after it catches a fish"}
{"src_dataset": "MSRVTT", "video_name": "video9577.mp4", "caption": "a small girl is sitting on a horse and then gets to the ground", "counterfactual": "a small girl is sitting on the ground and then gets to the horse"}
{"src_dataset": "MSRVTT", "video_name": "video9546.mp4", "caption": "a man is walking through the jungle before he cuts down some vines", "counterfactual": "a man is walking through the jungle after he cuts down some vines"}
{"src_dataset": "MSRVTT", "video_name": "video8725.mp4", "caption": "a group signs autographs before singing", "counterfactual": "a group sings autographs before signing"}
{"src_dataset": "MSRVTT", "video_name": "video7200.mp4", "caption": "a woman is shaking many people s hands after receiving a trophy", "counterfactual": "a woman is shaking many people s hands before receiving a trophy"}
{"src_dataset": "MSRVTT", "video_name": "video7776.mp4", "caption": "three people on a soccer field stand together before one of them kicks a soccer ball", "counterfactual": "three people on a soccer field stand together after one of them kicks a soccer ball"}
{"src_dataset": "MSRVTT", "video_name": "video7068.mp4", "caption": "a guy talks about the show he is watching", "counterfactual": "a guy talks about the show he's about to watch"}
{"src_dataset": "MSRVTT", "video_name": "video7627.mp4", "caption": "a person uses putty to put on a person s face then dry with a dryer", "counterfactual": "a person uses a dryer to put on a person s face then dry with putty"}
{"src_dataset": "MSRVTT", "video_name": "video8089.mp4", "caption": "a police officer drives his white car onto a grassy field and then back on to the street", "counterfactual": "a police officer drives his white car onto a street and then back on to the grassy field"}
{"src_dataset": "MSRVTT", "video_name": "video8809.mp4", "caption": "a man standing in the kitchen is taking a jar of juice and takes another packet of ingredients", "counterfactual": "a man standing in the kitchen is taking a packet of juice and takes another jar of ingredients"}
{"src_dataset": "MSRVTT", "video_name": "video9922.mp4", "caption": "adding eggs into a mixture and then rolling into balls", "counterfactual": "adding balls into a mixture and then rolling into eggs"}
{"src_dataset": "MSRVTT", "video_name": "video8296.mp4", "caption": "a girl watches a classmate get yelled at by a teacher", "counterfactual": "a girl yells at a classmate and then gets yelled at by a teacher"}
{"src_dataset": "MSRVTT", "video_name": "video8792.mp4", "caption": "the judges speak to a young girl who has just sung a song", "counterfactual": "the judges speak to a young girl who is about to sing a song"}
{"src_dataset": "MSRVTT", "video_name": "video8643.mp4", "caption": "a man in a kitchen heats oil and drops a prawn into batter and then the pan", "counterfactual": "a man in a kitchen heats oil and drops a batter into prawn and then the pan"}
{"src_dataset": "MSRVTT", "video_name": "video9004.mp4", "caption": "a woman is cooking potatoes on a pan and after that she is adding onions to the pan to fry", "counterfactual": "a woman is cooking onions on a pan and after that she is adding potatoes to the pan to fry"}
{"src_dataset": "MSRVTT", "video_name": "video9606.mp4", "caption": "a man discusses skiing calling it a jam session then some skiing is displayed", "counterfactual": "a man discusses skiing calling it a jam session then some jam session is displayed"}
{"src_dataset": "MSRVTT", "video_name": "video7161.mp4", "caption": "the paper was folded several times", "counterfactual": "the paper was folded once"}
{"src_dataset": "MSRVTT", "video_name": "video7936.mp4", "caption": "a soccer team celebrating after scoring a goal", "counterfactual": "a soccer team celebrating before scoring a goal"}
{"src_dataset": "MSRVTT", "video_name": "video9772.mp4", "caption": "a yellow animated bird flies through a valley then white birds fly over a cityscape", "counterfactual": "a yellow animated bird flies over a cityscape then white birds fly through a valley"}
{"src_dataset": "MSRVTT", "video_name": "video7965.mp4", "caption": "discussing about some when going in a car", "counterfactual": "discussing about some after going in a car"}
{"src_dataset": "MSRVTT", "video_name": "video8049.mp4", "caption": "men spin over a baseball bat before trying to kick a ball", "counterfactual": "men kick a baseball bat before trying to spin over a ball"}
{"src_dataset": "MSRVTT", "video_name": "video9604.mp4", "caption": "the woman lay in the bed and then sit near the window and look out as she thinks", "counterfactual": "the woman sits in the bed and then lay near the window and think as she looks out"}
{"src_dataset": "MSRVTT", "video_name": "video9155.mp4", "caption": "man places magnet on negative side of aa battery and then places copper wire bent into a square on the positive side", "counterfactual": "man places copper wire bent into a square on the negative side of aa battery and then places magnet on the positive side"}
{"src_dataset": "MSRVTT", "video_name": "video7722.mp4", "caption": "a woman wishing every man had to be pregnant once", "counterfactual": "a woman wishing every man had to be pregnant for nine months"}
{"src_dataset": "MSRVTT", "video_name": "video7285.mp4", "caption": "the narrator tells of carrots and beans dancing in the pan as the water boils and then reaches over the pan to add semolina to the ingredients in the pan", "counterfactual": "the narrator tells of carrots and beans dancing in the pan as the water boils and then reaches over the pan to add salt to the ingredients in the pan"}
{"src_dataset": "MSRVTT", "video_name": "video9532.mp4", "caption": "the man first holds an award then is arrested and is in court", "counterfactual": "the man first is arrested then is in court and is given an award"}
{"src_dataset": "MSRVTT", "video_name": "video9593.mp4", "caption": "a man talks to the camera before a series of images rapidly play", "counterfactual": "a man talks to the camera after a series of images rapidly play"}
{"src_dataset": "MSRVTT", "video_name": "video7553.mp4", "caption": "a kid walking over to a tree then running back", "counterfactual": "a kid runs over to a tree then walks back"}
{"src_dataset": "MSRVTT", "video_name": "video8228.mp4", "caption": "a person is showing ingredients before cooking", "counterfactual": "a person is showing ingredients after cooking"}
{"src_dataset": "MSRVTT", "video_name": "video7131.mp4", "caption": "the athletes gets off the starting point once the referee shots the final shot", "counterfactual": "the athletes gets off the starting point before the referee shots the final shot"}
{"src_dataset": "MSRVTT", "video_name": "video7060.mp4", "caption": "two men talking after one puts out a fire", "counterfactual": "two men talking before one puts out a fire"}
{"src_dataset": "MSRVTT", "video_name": "video8598.mp4", "caption": "a woman explains about the potato that is going to owen before it is converted into chips", "counterfactual": "a woman explains about the potato that is going to owen while it is being converted into chips"}
{"src_dataset": "MSRVTT", "video_name": "video7646.mp4", "caption": "a man wearing white shirt black jacket and neck tie is going out of a room after closing a suitcase", "counterfactual": "a man wearing white shirt black jacket and neck tie is going out of a room after closing a duffel bag"}
{"src_dataset": "MSRVTT", "video_name": "video7654.mp4", "caption": "a guy slices potatoes and then adds them to a bowl of heavy cream", "counterfactual": "a guy slices potatoes and then adds them to a bowl of milk"}
{"src_dataset": "MSRVTT", "video_name": "video9033.mp4", "caption": "a man is standing on a ledge and then jumping", "counterfactual": "a man is jumping on a ledge and then standing"}
{"src_dataset": "MSRVTT", "video_name": "video7406.mp4", "caption": "a pancake is being turned over to cook in a pan before being served onto a plate", "counterfactual": "a pancake is being served onto a plate to cook in a pan before being turned over to serve"}
{"src_dataset": "MSRVTT", "video_name": "video8514.mp4", "caption": "green food is added to boiling water in a silver pot then moves to a bowl of ice water", "counterfactual": "green food is added to a bowl of ice water in a silver pot then moves to a boiling water in a bowl"}
{"src_dataset": "MSRVTT", "video_name": "video7925.mp4", "caption": "a guy places a pan into tin foil and then places the pan into a water bath", "counterfactual": "a guy places a tin foil into a water bath and then places the pan into it"}
{"src_dataset": "MSRVTT", "video_name": "video9655.mp4", "caption": "a black and yellow schoolbus picks up children and drops them off before the driver exits in a red and yellow vest", "counterfactual": "a red and yellow schoolbus picks up children and drops them off before the driver exits in a black and yellow vest"}
{"src_dataset": "MSRVTT", "video_name": "video7498.mp4", "caption": "a cartoon character gets shot and then stabbed by two other cartoon characters", "counterfactual": "a cartoon character gets stabbed and then shot by two other cartoon characters"}
{"src_dataset": "MSRVTT", "video_name": "video7129.mp4", "caption": "a girl knocks on the wall then continues texting", "counterfactual": "the girl texts on the wall then continues knocking"}
{"src_dataset": "MSRVTT", "video_name": "video8643.mp4", "caption": "man in a black shirt mixing up batter and getting ready to fry it", "counterfactual": "man in a black shirt frying up batter and getting ready to mix it up"}
{"src_dataset": "MSRVTT", "video_name": "video7208.mp4", "caption": "a woman describes that she adds water to a bowl of ingredients and then mixes it", "counterfactual": "a woman describes that she adds ingredients to a bowl of water and then mixes it"}
{"src_dataset": "MSRVTT", "video_name": "video9904.mp4", "caption": "a person was scared and then fell down so the other person tried to call for help", "counterfactual": "a person was scared and then called for help so the other person tried to fall down"}
{"src_dataset": "MSRVTT", "video_name": "video8583.mp4", "caption": "a chef is putting things into a mixer and turning it on", "counterfactual": "a chef is putting a mixer into a thing and turning it on"}
{"src_dataset": "MSRVTT", "video_name": "video8853.mp4", "caption": "a woman puts and ginger into a pan to cook", "counterfactual": "a woman puts ginger into a pan after cooking"}
{"src_dataset": "MSRVTT", "video_name": "video8074.mp4", "caption": "a woman gets excited about something before a man looks at her", "counterfactual": "a woman gets excited about something as a man looks at her"}
{"src_dataset": "MSRVTT", "video_name": "video8767.mp4", "caption": "person adding oil to their food then mixing the oil in", "counterfactual": "person mixing their oil in first then adding their food"}
{"src_dataset": "MSRVTT", "video_name": "video8681.mp4", "caption": "a man and a young boy are shown playing together on a couch after which an on screen advertisement is shown", "counterfactual": "a man and a young boy are shown playing together on a couch before an on screen advertisement is shown"}
{"src_dataset": "MSRVTT", "video_name": "video7252.mp4", "caption": "a person speaks on a meeting while the other explains about the meeting to audience", "counterfactual": "a person explains about the meeting to audience, then the other speaks on a meeting"}
{"src_dataset": "MSRVTT", "video_name": "video8820.mp4", "caption": "a guy driving his mountain bike ad then falling off it", "counterfactual": "a guy falls off his mountain bike and then drives it"}
{"src_dataset": "MSRVTT", "video_name": "video8056.mp4", "caption": "a potato pancake is cooked and eaten", "counterfactual": "a potato pancake is eaten and then cooked"}
{"src_dataset": "MSRVTT", "video_name": "video7757.mp4", "caption": "gamers chase people down to shoot them then brag in online gameplay", "counterfactual": "gamers shoot people down to brag in online gameplay then chase them down to shoot them"}
{"src_dataset": "MSRVTT", "video_name": "video8018.mp4", "caption": "a little girl is taking food off the aisle and placing it into the cart", "counterfactual": "a little girl is taking food off the cart and placing it into the aisle"}
{"src_dataset": "MSRVTT", "video_name": "video8098.mp4", "caption": "a man pours oil into a preheated stir fry pan and then carefully add some raw chicken from a small bowel", "counterfactual": "a man pours chicken into a preheated stir fry pan, then carefully adds some oil from a small bowel"}
{"src_dataset": "MSRVTT", "video_name": "video8273.mp4", "caption": "two men are driving a car on the road", "counterfactual": "a man drives a car on the road and then gets out"}
{"src_dataset": "MSRVTT", "video_name": "video7858.mp4", "caption": "a car is described and advertised", "counterfactual": "a car is advertised and then described"}
{"src_dataset": "MSRVTT", "video_name": "video7809.mp4", "caption": "a woman stabs a man through the head then slit his throat", "counterfactual": "a woman slits a man's throat then stabs him through the head"}
{"src_dataset": "MSRVTT", "video_name": "video8151.mp4", "caption": "a video animation shows a bird running through a field then exploding", "counterfactual": "a video animation shows a bird exploding through a field then running"}
{"src_dataset": "MSRVTT", "video_name": "video9543.mp4", "caption": "football players practice on the field in a stadium before a game", "counterfactual": "football players practice on the field in a stadium after a game"}
{"src_dataset": "MSRVTT", "video_name": "video7384.mp4", "caption": "a man and a dog fell down into a hole", "counterfactual": "a dog fell down into a hole, then a man followed him"}
{"src_dataset": "MSRVTT", "video_name": "video7858.mp4", "caption": "a car is described and advertised", "counterfactual": "a car is advertised and then described"}
{"src_dataset": "VATEX", "video_name": "_7CUAi0Z_j4_000018_000028.mp4", "caption": "Two women take a drink after a man counts down.", "counterfactual": "Two women take a drink as a man counts down."}
{"src_dataset": "VATEX", "video_name": "a_rGCA-vxNU_000018_000028.mp4", "caption": "A man is squatting before a dog and pours water on the dog and then begins to pour shampoo on the dog.", "counterfactual": "A man squats before a dog, pours shampoo on the dog, then pours water on the dog."}
{"src_dataset": "VATEX", "video_name": "v4N3Foa6zlY_000000_000010.mp4", "caption": "A girl stands in the middle of the road, runs to the sidewalk, and does a cartwheel.", "counterfactual": "A girl runs in the middle of the road, stands on the sidewalk, and does a cartwheel."}
{"src_dataset": "VATEX", "video_name": "z8l7Gy9JtAg_000012_000022.mp4", "caption": "A young boy swings in a swing set outside until he falls out of it.", "counterfactual": "A young boy falls out of a swing set outside until he swings in it."}
{"src_dataset": "VATEX", "video_name": "-LUaKBvpWGQ_000000_000010.mp4", "caption": "A softball game is being played while a pitch was caught and then thrown to third base.", "counterfactual": "A softball game is being played while a pitch is being thrown to third base and then caught."}
{"src_dataset": "VATEX", "video_name": "20Wlga1naNg_000067_000077.mp4", "caption": "A kid throws a ball in his hands, then picks up another and juggles.", "counterfactual": "A kid juggles a ball in his hands, then throws another in his hands."}
{"src_dataset": "VATEX", "video_name": "R4p5Iva2vwM_000000_000010.mp4", "caption": "A young boy does a flexible position on the ground before repeating it on a chair.", "counterfactual": "A young boy repeats a flexible position on the chair before repeating it on the ground."}
{"src_dataset": "VATEX", "video_name": "3LV9AjlJ-5A_000417_000427.mp4", "caption": "A woman is showing how to try the color on your hand first before applying make up to the face.", "counterfactual": "A woman is showing how to try the color on your face first before applying make up to your hand."}
{"src_dataset": "VATEX", "video_name": "7JbhLm0tvcU_000024_000034.mp4", "caption": "A person ripping pieces of of cardboard and then picks them up.", "counterfactual": "A person picks up pieces of of cardboard and then rips them."}
{"src_dataset": "VATEX", "video_name": "9qtZYavEN-o_000090_000100.mp4", "caption": "Man lies on mat with knees bent and feet on floor, he lifts feet over body and behind head, and he lowers feet back to mat.", "counterfactual": "Man stands on mat with feet shoulder width apart, he lowers head and shoulders to mat and lifts feet behind head, he raises feet back to mat, he stands up and lies on mat with knees bent and feet on floor."}
{"src_dataset": "VATEX", "video_name": "QAEcFAzp0MU_000000_000010.mp4", "caption": "A girl does a hand stand into a roll on the grass then stands up.", "counterfactual": "A girl does a hand stand on the grass and rolls into a stand."}
{"src_dataset": "VATEX", "video_name": "MBEDYxjnUIY_000280_000290.mp4", "caption": "A woman holds one leg of a horse up while a man applies a salve to another leg of the horse.", "counterfactual": "A woman holds one leg of a horse up while a man applies a bridle to another leg of the horse."}
{"src_dataset": "VATEX", "video_name": "4suDxEe8rM0_000351_000361.mp4", "caption": "While a man is talking, he pulls a tree limb and then uses a saw to cut the limb off the tree.", "counterfactual": "While a man is talking, he hits a tree limb with an ax and then uses a saw to cut the limb off the tree."}
{"src_dataset": "VATEX", "video_name": "pTxBxE_LSrU_000014_000024.mp4", "caption": "A person removes a small package from beneath a rock and then puts it back.", "counterfactual": "A person removes a small package from beneath a rock and then moves it to the side."}
{"src_dataset": "VATEX", "video_name": "eigyV8fkc0Q_000005_000015.mp4", "caption": "A person is putting dough on an assembly machine, the machine then puts plastic over the dough to cover it.", "counterfactual": "A person is putting plastic on an assembly machine, the machine then puts dough over the plastic to cover it."}
{"src_dataset": "VATEX", "video_name": "OHnjPSvtkCQ_000135_000145.mp4", "caption": "A teen girl instructs how to apply foundation to the face.", "counterfactual": "A teen girl has makeup applied to the face."}
{"src_dataset": "VATEX", "video_name": "cmakjXglpAk_000000_000010.mp4", "caption": "A baseball player hits a ball and then starts to run.", "counterfactual": "A baseball player runs and then hits a ball."}
{"src_dataset": "VATEX", "video_name": "kRdcVBYwu5U_000027_000037.mp4", "caption": "A little girl squeezed a steel cup in her hand and bent it", "counterfactual": "A little girl bent a steel cup in her hand and squeezed it"}
{"src_dataset": "VATEX", "video_name": "kA7dv-EfTSQ_000196_000206.mp4", "caption": "A young child brushes his teeth at a sink and then spits.", "counterfactual": "A young child spits at a sink and then brushes his teeth."}
{"src_dataset": "VATEX", "video_name": "SgjPSN4QtEo_000000_000010.mp4", "caption": "A woman smiles and blinks one eye repeatedly before blinking the other eye repetitiously.", "counterfactual": "A woman smiles and then closes both eyes repeatedly."}
{"src_dataset": "VATEX", "video_name": "PS7563aUphM_000000_000010.mp4", "caption": "A man squirts lotion onto his finger then rubs the lotion onto a tattoo on his forearm", "counterfactual": "A man squirts lotion onto his forearm then rubs the lotion onto a tattoo on his finger"}
{"src_dataset": "VATEX", "video_name": "tgabmQLxHCQ_000003_000013.mp4", "caption": "Several people play badminton, one man serves the shuttlecock and returns it twice while his partner hangs out in the back of the court.", "counterfactual": "Several people play badminton, one man serves the shuttlecock and returns it once while his partner hangs out in the back of the court."}
{"src_dataset": "VATEX", "video_name": "diqTso9slWo_000068_000078.mp4", "caption": "A man turns the key in the ignition, starting a car and then turns the wheel.", "counterfactual": "A man turns the wheel, starting a car and then turns the key in the ignition."}
{"src_dataset": "VATEX", "video_name": "R9ftLqfpTwg_000006_000016.mp4", "caption": "Two people with a microscope, then a photo of Bill Cosby, then back to a person looking through the microscope.", "counterfactual": "A person with a microscope, then a photo of bill cosby, then back to a person looking through the microscope."}
{"src_dataset": "VATEX", "video_name": "a-jZ3b7BMmA_000000_000010.mp4", "caption": "A guy with white top and black bottom is doing pushups by jumping up and touching his knee and then back to normal pushups.", "counterfactual": "A guy with black top and white bottom is doing pushups by jumping up and touching his knee and then back to normal pushups."}
{"src_dataset": "VATEX", "video_name": "hahlep725ig_000025_000035.mp4", "caption": "A man is filling a liquid in a beer bottle before sealing the cap off.", "counterfactual": "A man is filling a liquid in a beer bottle after sealing the cap off."}
{"src_dataset": "VATEX", "video_name": "fIhA4yQjoDM_000074_000084.mp4", "caption": "A young man is spreading mayonnaise on a sandwich and then picks up the mustard bottle.", "counterfactual": "A young man is spreading mustard on a sandwich and then picks up the mayonnaise bottle."}
{"src_dataset": "VATEX", "video_name": "LmFFDV_gemA_000066_000076.mp4", "caption": "A man rides a horse across an open field and then dismounts it", "counterfactual": "A man rides a horse across an open field and then leaves it there"}
{"src_dataset": "VATEX", "video_name": "DFvcjTMfblg_000044_000054.mp4", "caption": "A boy runs across a yard and jumps over a railing and then walks up a stair case.", "counterfactual": "A boy runs across a yard and jumps over a railing and then hops over a curb."}
{"src_dataset": "VATEX", "video_name": "6tXUaIavSp4_000000_000010.mp4", "caption": "A girl is sitting on the floor before getting up and doing a few kicks in the air.", "counterfactual": "A girl is doing a few kicks in the air before sitting on the floor."}
{"src_dataset": "VATEX", "video_name": "neejjLpG8nA_000018_000028.mp4", "caption": "A person folds a sheet of paper, holds it up, then folds it again.", "counterfactual": "A person folds a sheet of paper, holds it up, then puts it in his pocket."}
{"src_dataset": "VATEX", "video_name": "FaN1-CyTV2s_000028_000038.mp4", "caption": "A girl catches up to a group of other roller skaters, then starts to pass them.", "counterfactual": "A girl passes by a group of other roller skaters, then starts to pass them."}
{"src_dataset": "VATEX", "video_name": "b3tHC5nLNgk_000025_000035.mp4", "caption": "A young man has a patch over his left eye and then he puts another one over his right eye, while someone is talking about it.", "counterfactual": "A young man has a patch over his right eye and then he puts another one over his left eye, while someone is talking about it."}
{"src_dataset": "VATEX", "video_name": "D-kcF7b_klQ_000011_000021.mp4", "caption": "A young woman throws her shoe up in the air and watches it as it comes down, then puts it on.", "counterfactual": "A young woman throws her shoe up in the air and watches it as it comes down, then throws it at her lover."}
{"src_dataset": "VATEX", "video_name": "ncG-Ys3dAT0_000006_000016.mp4", "caption": "A boy stands in his  yard kicking a soccer ball and then kicks it at the camera.", "counterfactual": "A boy stands in his yard kicking a soccer ball and then kicks it at a goal."}
{"src_dataset": "VATEX", "video_name": "0YWVgaLT5GM_000060_000070.mp4", "caption": "A long-haired teen uses a mic after another teen has used it.", "counterfactual": "A long-haired teen uses a mic before another teen has used it."}
{"src_dataset": "VATEX", "video_name": "4RkhTv80Qvg_000005_000015.mp4", "caption": "A fit man is doing push ups while performing a stunt after each repetition.", "counterfactual": "A fit man is doing push ups while  resting in between repetitions."}
{"src_dataset": "VATEX", "video_name": "-NgXQZMUbfc_000000_000010.mp4", "caption": "A woman stands outside smoothing off a snowman, then kneels down to align her head with the top of the snowman", "counterfactual": "A woman stands outside smoothing off a snowman, then sits down to align her head with the top of the snowman"}
{"src_dataset": "VATEX", "video_name": "3LOWrfmj8eM_000003_000013.mp4", "caption": "There is a gong of some kind being hit three times to symbolize something is happening.", "counterfactual": "There is a gong of some kind being hit twice to symbolize something is happening."}
{"src_dataset": "VATEX", "video_name": "4tFZjp_kc6U_000000_000010.mp4", "caption": "A group of boys slide onto a long surface with their snow boards and then down a hill.", "counterfactual": "A group of boys slide onto a long surface with their skis and then down a hill."}
{"src_dataset": "VATEX", "video_name": "C29kvQkzadQ_000017_000027.mp4", "caption": "A man wearing a t-shirt is lifting two dumbbells up and then down", "counterfactual": "A man wearing a t-shirt is lifting two dumbbells down and then up"}
{"src_dataset": "VATEX", "video_name": "6An5rzRsdMU_000000_000010.mp4", "caption": "Man running and jumping up at a tree trunk with both feet then falling to the ground.", "counterfactual": "Man running and jumping up at a tree trunk with both feet then pulling his feet up to the trunk and standing on it."}
{"src_dataset": "VATEX", "video_name": "8HJ0BpNqjjE_000253_000263.mp4", "caption": "A person looks at an empty conveyor belt before they go to the other side where sacks wrapped in plastic wait to enter the belt.", "counterfactual": "A person looks at an empty conveyor belt after they go to the other side where sacks wrapped in plastic wait to enter the belt."}
{"src_dataset": "VATEX", "video_name": "1rNA1LeL_Fg_000177_000187.mp4", "caption": "A man holding a plastering board picks up mortar and throws it against a brick wall repeatedly.", "counterfactual": "A man holding a plastering board picks up mortar and throws it against a brick wall once."}
{"src_dataset": "VATEX", "video_name": "7BpYP2REEmg_000000_000010.mp4", "caption": "On a grey background a person clicks their fingers once.", "counterfactual": "On a grey background a person clicks their fingers twice."}
{"src_dataset": "VATEX", "video_name": "wjSGBT2D-Tc_000001_000011.mp4", "caption": "Young boy in white hat and blue coat attempting to feed a stick to a parrot before the parrot flies away,", "counterfactual": "A young boy in white hat and blue coat attempting to feed a stick to a parrot after the parrot flies away"}
{"src_dataset": "VATEX", "video_name": "i8MIQuEsVTg_000000_000010.mp4", "caption": "A hand moves a piece of meat then it starts to slice through the meat.", "counterfactual": "A hand slices through a piece of meat then it starts to move."}
{"src_dataset": "VATEX", "video_name": "mrKntbg0ibw_000068_000078.mp4", "caption": "A girl dives off the high board and then a boy steps up to get ready.", "counterfactual": "A girl steps off the high board and then a boy dives off to get ready."}
{"src_dataset": "VATEX", "video_name": "C-hb3zWILKc_000041_000051.mp4", "caption": "A man is rubbing two stones together and then uses one stone to scratch the other stone.", "counterfactual": "A man rubs two stones together and then scratches himself with one stone."}
{"src_dataset": "VATEX", "video_name": "y3TGYwARWxA_000003_000013.mp4", "caption": "A man studies a triangular rubix puzzle before setting a timer and starting to work on it.", "counterfactual": "A man studies a triangular rubix puzzle after setting a timer and starting to work on it."}
{"src_dataset": "VATEX", "video_name": "JeEGBWh5hzk_000098_000108.mp4", "caption": "A man eats crab meat and then throws the shell in a trash can.", "counterfactual": "A man throws the crab meat in the trash can and then eats the shell."}
{"src_dataset": "VATEX", "video_name": "AgOyGISM_FA_000003_000013.mp4", "caption": "A woman is at a gym lifting weights which she sets down before people add more weight to each side.", "counterfactual": "A woman is at a gym lifting weights which she sets down after people add more weight to each side."}
{"src_dataset": "VATEX", "video_name": "l_CJXhNEumY_000003_000013.mp4", "caption": "A person electronically opens up hand build wooden doors, closes them, and then opens them again.", "counterfactual": "A person electronically closes up hand build wooden doors, opens them, and then closes them again."}
{"src_dataset": "VATEX", "video_name": "S_n8K7fuBBA_000039_000049.mp4", "caption": "A person is wiping a cap in a car engine and then twists the cap.", "counterfactual": "A person is putting a cap on a car engine and then twists the cap."}
{"src_dataset": "VATEX", "video_name": "3LV9AjlJ-5A_000417_000427.mp4", "caption": "A woman dabs makeup on her hand to show the color, then begins putting it on her face.", "counterfactual": "A woman dabs makeup on her face to show the color, then begins putting it on her hand."}
{"src_dataset": "VATEX", "video_name": "RJJNyVozaCQ_000010_000020.mp4", "caption": "A young person walks on there hands across a street to a sidewalk.", "counterfactual": "A young person walks on there hands across a sidewalk to a street."}
{"src_dataset": "VATEX", "video_name": "rfM1NFHgTaY_000338_000348.mp4", "caption": "A woman uses wire cutters to cut wire before threading beads", "counterfactual": "A woman uses wire cutters to cut wire after threading beads"}
{"src_dataset": "VATEX", "video_name": "GHPGrJdclxs_000005_000015.mp4", "caption": "The young man is holding a very heavy barbell, before squatting down to complete the exercise.", "counterfactual": "The young man is holding a very heavy barbell, after squatting down to complete the exercise."}
{"src_dataset": "VATEX", "video_name": "D-dJ--BP2yY_000021_000031.mp4", "caption": "A pole vaulter demonstrates using a pole to jump a higher pole twice.", "counterfactual": "A pole vaulter demonstrates using a pole to jump a higher pole three times."}
{"src_dataset": "VATEX", "video_name": "MIlyiRFx6eA_000010_000020.mp4", "caption": "A man is swinging a large mallet and hitting a mounted device over and over again", "counterfactual": "A man is swinging a large mallet and hitting a mounted device only once"}
{"src_dataset": "VATEX", "video_name": "3LOWrfmj8eM_000003_000013.mp4", "caption": "A person hits a gong three times with a wooden mallet.", "counterfactual": "A person hits a gong once with a wooden mallet."}
{"src_dataset": "VATEX", "video_name": "7nvm0QypB3U_000061_000071.mp4", "caption": "a person is boiling some vegetables and then frying them in a pan and plating them", "counterfactual": "a person is frying some vegetables and then boiling them in a pan and plating them"}
{"src_dataset": "VATEX", "video_name": "4VpUtUGcJzE_000000_000010.mp4", "caption": "A BMX rider rides his bike in a school parking lot and then crashes.", "counterfactual": "A bmx rider crashes his bike in a school parking lot and then rides his bike."}
{"src_dataset": "VATEX", "video_name": "ebKUfeBkcIM_000034_000044.mp4", "caption": "A person holds a tube and then zips up their jacket and walks off.", "counterfactual": "A person holds a jacket and then zips up a tube and walks off."}
{"src_dataset": "VATEX", "video_name": "l7xq8S8KeaE_000010_000020.mp4", "caption": "A dad levels his leg to his daughter to smell and the daughter bursts out laughing after she smells it.", "counterfactual": "A dad levels his leg to his daughter to smell and the daughter bursts out laughing before she smells it."}
{"src_dataset": "VATEX", "video_name": "RFbDelPr1Ps_000621_000631.mp4", "caption": "A woman getting her back wiped down after getting a message from the other person.", "counterfactual": "A woman getting her back wiped down before getting a message from the other person."}
{"src_dataset": "VATEX", "video_name": "HfkPAd_x--o_000017_000027.mp4", "caption": "A shirtless man is covering his eyes and then uncovering them.", "counterfactual": "A shirtless man is uncovering his eyes and then covering them."}
{"src_dataset": "VATEX", "video_name": "A0e7Z55s8pE_000008_000018.mp4", "caption": "A man stands on a ladder trying to clean snow off of a roof, then falls.", "counterfactual": "A man stands on a ladder trying to clean snow off of a roof, then climbs down."}
{"src_dataset": "VATEX", "video_name": "2mGjsb98CRs_000017_000027.mp4", "caption": "Someone is trying to feed a little girl, the little girl walks aways, claps her hands once and then shakes her head no.", "counterfactual": "Someone is trying to feed a little girl, the little girl walks aways, claps her hands twice and then shakes her head no."}
{"src_dataset": "VATEX", "video_name": "20Wlga1naNg_000067_000077.mp4", "caption": "An adolescent boy plays with a ball and then picks up a second one.", "counterfactual": "An adolescent boy plays with two balls and then picks up a second one."}
{"src_dataset": "VATEX", "video_name": "DUALGvqL5UA_000056_000066.mp4", "caption": "A woman is talking and then hits a cymbal demonstrating its sound.", "counterfactual": "A woman is listening and then hits a cymbal demonstrating its sound."}
{"src_dataset": "VATEX", "video_name": "WB909WkQeuA_000000_000010.mp4", "caption": "A woman bounces on a diving board before doing a flip into the water.", "counterfactual": "A woman bounces on a diving board after doing a flip into the water."}
{"src_dataset": "VATEX", "video_name": "OcaWxD1FVBg_000000_000010.mp4", "caption": "A man is laying on his back as he sits up and stretches forward and touches one foot before laying back down then touching the other foot.", "counterfactual": "A man is sitting on his back as he stands up and stretches forward and touches one foot before sitting back down then touching the other foot."}
{"src_dataset": "VATEX", "video_name": "EBNDZ7IKQ5c_000006_000016.mp4", "caption": "Someone is riding a skateboard and jumps a set of stairs, then falls.", "counterfactual": "Someone is riding a skateboard and jumps a set of stairs, then lands."}
{"src_dataset": "VATEX", "video_name": "q4owm3Er7d8_000000_000010.mp4", "caption": "A man is lifting a bar with heavy weights on each side up to his waist then dropping it and starting over.", "counterfactual": "A man is lowering a bar with heavy weights on each side down to his waist then lifting it and starting over."}
{"src_dataset": "VATEX", "video_name": "jTgBb04DDng_000000_000010.mp4", "caption": "A little kids crawls along the floor to a bottle and then grabs it.", "counterfactual": "A little kid crawls along the floor to a bottle and then places it down."}
{"src_dataset": "VATEX", "video_name": "L67IEDQjL04_000006_000016.mp4", "caption": "A man is chewing before grabbing a chip and chewing more.", "counterfactual": "A man is chewing after grabbing a chip and chewing more."}
{"src_dataset": "VATEX", "video_name": "efvOYBo03XM_000351_000361.mp4", "caption": "A woman is showing how to prepare and hollow out a pumpkin before carving it.", "counterfactual": "A woman is showing how to prepare and hollow out a pumpkin after carving it."}
{"src_dataset": "VATEX", "video_name": "giWvXm3g5Wg_000012_000022.mp4", "caption": "Someone uses a knife sharpening block to sharpen a knife, then uses a machine to sharpen the knife block.", "counterfactual": "Someone uses a machine to sharpen the knife block, then uses a knife sharpening block to sharpen the knife."}
{"src_dataset": "VATEX", "video_name": "eKt74vJybVk_000010_000020.mp4", "caption": "A person is turning a steering wheel all the way to the right then back to the left with their finger.", "counterfactual": "A person is turning a steering wheel all the way to the left then back to the right with their finger."}
{"src_dataset": "VATEX", "video_name": "a5eMVl_mqjw_000044_000054.mp4", "caption": "A women is talking and then starts painting her nails", "counterfactual": "A women is painting her nails and then starts talking"}
{"src_dataset": "VATEX", "video_name": "3LOWrfmj8eM_000003_000013.mp4", "caption": "Someone is using a large mallet to bang on a gong several times.", "counterfactual": "Someone is using a large mallet to tap on a gong once."}
{"src_dataset": "VATEX", "video_name": "pk8D3D6PSx0_000042_000052.mp4", "caption": "A baby in a snowsuit runs down a driveway before falling down.", "counterfactual": "A baby in a snowsuit runs down a driveway after falling down."}
{"src_dataset": "VATEX", "video_name": "MFt0MwJGTxU_000000_000010.mp4", "caption": "A man inhales from a hookah repeatedly and then blows out smoke.", "counterfactual": "A man exhales from a hookah repeatedly and then inhales smoke."}
{"src_dataset": "VATEX", "video_name": "_fsPbIQRJ1s_000000_000010.mp4", "caption": "a man outside practices kicking and then does two flips", "counterfactual": "a man outside practices flipping and then does two kicks"}
{"src_dataset": "VATEX", "video_name": "jo2_g8Bua1Q_000042_000052.mp4", "caption": "A cloth is covered in maroon colouring before it is picked up and scrunched up.", "counterfactual": "A cloth is covered in maroon colouring after it is picked up and scrunched up."}
{"src_dataset": "VATEX", "video_name": "eibBrEaSB8A_000000_000010.mp4", "caption": "Two men wearing helmets are waiting on their motorcycles before they can take off.", "counterfactual": "Two men wearing helmets are waiting on their motorcycles after they have taken off."}
{"src_dataset": "VATEX", "video_name": "LmFFDV_gemA_000066_000076.mp4", "caption": "A man rides a horse then stops the horse and gets off of it.", "counterfactual": "A man stops a horse and gets off of it then rides it."}
{"src_dataset": "VATEX", "video_name": "8FC7KLzeFFs_000012_000022.mp4", "caption": "A woman kneels balancing on a white ball, then laughs on the floor.", "counterfactual": "A woman laughs while standing on a white ball, then kneels on the floor."}
{"src_dataset": "VATEX", "video_name": "_yiKS8WxRTw_000005_000015.mp4", "caption": "Person in a kayak in an above ground pool, who is throws a floater to a man in the pool and then tips over in the kayak.", "counterfactual": "Person in a kayak in an above ground pool, who tips over a floater to a man in the pool and then throws a man in the pool."}
{"src_dataset": "VATEX", "video_name": "uBGcQowQFPw_000000_000010.mp4", "caption": "A little boy looks into the camera and attempts to whistle several times.", "counterfactual": "A little boy looks into the camera and attempts to whistle once."}
{"src_dataset": "VATEX", "video_name": "2OFfh8Q-AZo_000016_000026.mp4", "caption": "A man lurches forward a couple of steps and then throws a frisbee very far", "counterfactual": "A man lurches forward a couple of steps and then catches a frisbee very far"}
{"src_dataset": "VATEX", "video_name": "A5c8ZVrJLGE_000013_000023.mp4", "caption": "A little boy with red top and face painted is blowing the candle on the cake after people singing birthday songs", "counterfactual": "A little boy with red top and face painted is blowing the candle on the cake before people singing birthday songs"}
{"src_dataset": "VATEX", "video_name": "J8lnwLUebCs_000000_000010.mp4", "caption": "A person on a bike rides down a street then jumps over some logs.", "counterfactual": "A person on a bike rides down some logs then jumps over a street."}
{"src_dataset": "VATEX", "video_name": "9TnkwnECHVw_000008_000018.mp4", "caption": "A girl is putting beads and shells onto string after she cuts it.", "counterfactual": "A girl is putting beads and shells onto string before she cuts it."}
{"src_dataset": "VATEX", "video_name": "E1wfdjBqL3g_000094_000104.mp4", "caption": "A man on a baseball field throws a ball from his shoulder after doing a spin, in Discus Olympian fashion.", "counterfactual": "A man on a baseball field throws a ball from his shoulder before doing a spin, in discus olympian fashion."}
{"src_dataset": "VATEX", "video_name": "msZzgrBqt2E_000092_000102.mp4", "caption": "A child puts a fork on a table and then picks up a cup.", "counterfactual": "A child puts a cup on a table and then picks up a fork."}
{"src_dataset": "VATEX", "video_name": "2KsKfc2TcEU_000063_000073.mp4", "caption": "A woman is seen vacuuming, before turning it off and walking away.", "counterfactual": "A woman is seen vacuuming, after turning it off and walking away."}
{"src_dataset": "VATEX", "video_name": "UgrgEuiOskU_000047_000057.mp4", "caption": "A little kid is grabbing a cell phone from the ground and hitting it against the desk", "counterfactual": "A little kid is grabbing a cell phone from the desk and hitting it against the ground"}
{"src_dataset": "VATEX", "video_name": "l_5sQ5_v3Ac_000626_000636.mp4", "caption": "A man holds a cabinet door, and then adjusts the position after installation.", "counterfactual": "A man holds a cabinet door, and then adjusts the position before installation."}
{"src_dataset": "VATEX", "video_name": "h2PLauUMFpQ_000756_000766.mp4", "caption": "A man uses a brush to clean a shoe, then picks up a towel.", "counterfactual": "A man uses a towel to clean a shoe, then picks up a brush."}
{"src_dataset": "VATEX", "video_name": "sIt77FmjldQ_000000_000010.mp4", "caption": "A woman crosses her eyes twice and then smiles at the camera.", "counterfactual": "A woman crosses her eyes once and then smiles at the camera."}
{"src_dataset": "VATEX", "video_name": "LmTOumMTTWg_000027_000037.mp4", "caption": "A shot of a cheerleading team before it cuts to the crowd and then back to the cheerleaders.", "counterfactual": "A shot of the crowd before it cuts to the cheerleaders and then back to the crowd."}
{"src_dataset": "VATEX", "video_name": "46JDCSVWKmM_000056_000066.mp4", "caption": "A woman rubs a beauty treatment from a bowl on her face in the bathroom before she says it made her skin very soft.", "counterfactual": "A woman rubs a beauty treatment from a bowl on her face in the bathroom after she says it made her skin very soft."}
{"src_dataset": "VATEX", "video_name": "KhSekYgrGmI_000343_000353.mp4", "caption": "A lady is tearing a newspaper page multiple times with her hands.", "counterfactual": "A lady is tearing a newspaper page once with her hands."}
{"src_dataset": "VATEX", "video_name": "dDoCGsPWqa8_000077_000087.mp4", "caption": "Someone is displaying some electronic percussion technology before he demonstrates his drumming skills.", "counterfactual": "Someone is displaying some electronic percussion technology after he demonstrates his drumming skills."}
{"src_dataset": "VATEX", "video_name": "4DVx18w-rmk_000038_000048.mp4", "caption": "A little boy is holding a playing card and then starts throwing it as a trick.", "counterfactual": "A little boy is throwing a playing card and then starts holding it as a trick."}
{"src_dataset": "VATEX", "video_name": "K8SMIFy_IMs_000000_000010.mp4", "caption": "A person grabs the back of his head, has trouble sneezing, then finally sneezes.", "counterfactual": "A person grabs the back of his head, has trouble breathing, then finally breathes."}
{"src_dataset": "VATEX", "video_name": "TIXA4ZQxURQ_000022_000032.mp4", "caption": "A man throws a disk across a fireld and then throws another one.", "counterfactual": "A man throws a disk across a field and then puts another one in his pocket."}
{"src_dataset": "VATEX", "video_name": "0t0DB1B1w8Y_000000_000010.mp4", "caption": "a woman is hopping over many fences and barriers and then jumping onto a cushion to get her exercise", "counterfactual": "a woman is hopping over many fences and barriers and then jumping onto a bicycle to get her exercise"}
{"src_dataset": "VATEX", "video_name": "5L6dT8pjhTs_000048_000058.mp4", "caption": "A lady falls down twice while trying to ride a bicycle but at the end successfully does it.", "counterfactual": "A lady successfully rides a bicycle twice but at the end falls down twice."}
{"src_dataset": "VATEX", "video_name": "Um3R45eQe1s_000029_000039.mp4", "caption": "A man is holding a skinned pineapple and puts it down and starts skinning a fresh pineapple", "counterfactual": "A man is holding a fresh pineapple and puts it down and starts skinning a skinned pineapple"}
{"src_dataset": "VATEX", "video_name": "MqPBZFPTfy4_000000_000010.mp4", "caption": "A man hits a tire repeatedly with a large hammer.", "counterfactual": "A man hits a tire once with a large hammer."}
{"src_dataset": "VATEX", "video_name": "axUFmA1cpws_000000_000010.mp4", "caption": "A young male practices throwing a disc several times in the woods.", "counterfactual": "A young male practices throwing a disc one time in the woods."}
{"src_dataset": "VATEX", "video_name": "xduuz2Uttvw_000026_000036.mp4", "caption": "A man steps out from a group of cymbal players and knocks cymbals with another player before getting back in line.", "counterfactual": "A man steps out from a group of cymbal players and listens to the music for a while before getting back in line."}
{"src_dataset": "VATEX", "video_name": "DGzfHewaZFg_000188_000198.mp4", "caption": "A person holds a knife, touches the blade then picks up another object and begins rubbing the blade on the object.", "counterfactual": "A person holds a knife, touches the blade then drops the knife on the floor and begins rubbing the blade on the floor."}
{"src_dataset": "VATEX", "video_name": "Rd9mXMqM-VE_000000_000010.mp4", "caption": "A WOMAN IN A STRIPED SHIRT FOLD A PIECE OF TOILET PAPER MULTIPLE TIMES.", "counterfactual": "A woman in a striped shirt folds a piece of toilet paper once."}
{"src_dataset": "VATEX", "video_name": "qdbAK4zKr58_000048_000058.mp4", "caption": "A man parachutes into the side of a tower and hits it repeatedly on the way down.", "counterfactual": "A man parachutes into the side of a tower and hits it only once on the way down."}
{"src_dataset": "VATEX", "video_name": "ctljnM9Fozk_000010_000020.mp4", "caption": "A man is watering his garden and then adds mulch to it.", "counterfactual": "A man is water his garden and then adds water to it."}
{"src_dataset": "VATEX", "video_name": "g6NRqty89TQ_000000_000010.mp4", "caption": "A woman is using a rag to clean a man's shoe before she walks away.", "counterfactual": "A woman is using a rag to clean a man's shoe while she walks away."}
{"src_dataset": "VATEX", "video_name": "EvKczwDFAvY_000018_000028.mp4", "caption": "A person pushes a button on a console on a dash, before they move a joystick back and forth.", "counterfactual": "A person pushes a button on a console on a dash, after they move a joystick back and forth."}
{"src_dataset": "VATEX", "video_name": "46JDCSVWKmM_000056_000066.mp4", "caption": "a woman is in a bathroom putting a cream on her face before she takes a shower", "counterfactual": "a woman is in a bathroom putting a cream on her face after she takes a shower"}
{"src_dataset": "VATEX", "video_name": "XPNuj5erUM8_000004_000014.mp4", "caption": "A blindfolded woman is blowing her nose over and over again.", "counterfactual": "A blindfolded woman is blowing her nose once."}
{"src_dataset": "VATEX", "video_name": "FYDigD-c6jY_000015_000025.mp4", "caption": "A girl wearing a pink top is crossing the road after a car passes.", "counterfactual": "A girl wearing a pink top is crossing the road before a car passes."}
{"src_dataset": "VATEX", "video_name": "81gFQUWEutk_000011_000021.mp4", "caption": "A young man balances and jumps off a metal rack twice.", "counterfactual": "A young man is almost immediately bored and quits after he balances and jumps off a metal rack once."}
{"src_dataset": "VATEX", "video_name": "QqkXt7IuUeo_000000_000010.mp4", "caption": "A little girl winks at the camera after the camera man asks her to.", "counterfactual": "A little girl winks at the camera before the camera man asks her to."}
{"src_dataset": "VATEX", "video_name": "NEzHyDF3L9A_000006_000016.mp4", "caption": "A young boy wrestles a calf down to the ground, then takes the calfs legs and tie them together.", "counterfactual": "A young boy is wrestled down to the ground, then his legs are tied together."}
{"src_dataset": "VATEX", "video_name": "_dSL2UBG6YA_000106_000116.mp4", "caption": "A man is explaining and showing how he paints a ceiling, while he applies the paint, then steps back down onto the floor.", "counterfactual": "A man is explaining and showing how he paints a ceiling, while he applies the paint, then jumps down onto the floor."}
{"src_dataset": "VATEX", "video_name": "4DVx18w-rmk_000038_000048.mp4", "caption": "A boy wearing shorts is holding a playing card in his hands and then he throws it and picks it up and then he repeats this process once more.", "counterfactual": "A boy wearing shorts is holding a playing card in his hands and then he throws it and picks it up and then he repeats this process twice more."}
{"src_dataset": "VATEX", "video_name": "RjPp0ZPW0yc_000000_000010.mp4", "caption": "A machine operator in a work room is pulling down a lever on a machine before grinding sounds are heard.", "counterfactual": "A machine operator in a work room is pulling down a lever on a machine after grinding sounds are heard."}
{"src_dataset": "VATEX", "video_name": "dfo3WR33AcY_000407_000417.mp4", "caption": "A seated man is applying black shoe polish to a pair of boots, he then dries the polish with a boot gun.", "counterfactual": "A seated man is applying black shoe polish to a pair of boots, he then dries the polish with a shoe dryer."}
{"src_dataset": "VATEX", "video_name": "0soeKXEXVkk_000535_000545.mp4", "caption": "A boy runs down a slip and slide then slides into the side of a wading pool", "counterfactual": "A boy runs down a slip and slide then slips into the side of a wading pool"}
{"src_dataset": "VATEX", "video_name": "8YYeGsOzwQ0_000000_000010.mp4", "caption": "A person sneezes multiple times as the person behind her mocks her.", "counterfactual": "A person sneezes once as the person behind her mocks her."}
{"src_dataset": "VATEX", "video_name": "MIlyiRFx6eA_000010_000020.mp4", "caption": "A man is hitting a metal structure repeatedly with a mallet.", "counterfactual": "A man is hitting a metal structure once with a mallet."}
{"src_dataset": "VATEX", "video_name": "d13fbMZ75EQ_000009_000019.mp4", "caption": "Soldering is done to a piece of wood before a coating is applied to it.", "counterfactual": "Soldering is done to a piece of wood after a coating is applied to it."}
{"src_dataset": "VATEX", "video_name": "vHvx4SNmBfs_000039_000049.mp4", "caption": "A man places a little boy on a treadmill, and then gets on himself.", "counterfactual": "A man places a little boy on a treadmill, and then gets on the little boy."}
{"src_dataset": "VATEX", "video_name": "Z4pVvaID_ew_000012_000022.mp4", "caption": "A young child plays with a toy train set before prancing around the table.", "counterfactual": "A young child plays with a toy train set after prancing around the table."}
{"src_dataset": "VATEX", "video_name": "7GaSbJcbrTQ_000014_000024.mp4", "caption": "A girl smiles while bouncing on a trampoline, then lies down.", "counterfactual": "A girl smiles while lying down, then jumps on a trampoline."}
{"src_dataset": "VATEX", "video_name": "ioCn2rlF7UE_000089_000099.mp4", "caption": "A man adds water to his bouquet before he starts to put in the orchids.", "counterfactual": "A man adds water to his bouquet after he starts to put in the orchids."}
{"src_dataset": "VATEX", "video_name": "lcT0ukZeCzo_000317_000327.mp4", "caption": "A woman is using a knife to cut up a pineapple after to points out the core.", "counterfactual": "A woman is using a knife to cut up a pineapple before to points out the core."}
{"src_dataset": "VATEX", "video_name": "EDdp5B7bHaQ_000001_000011.mp4", "caption": "A man winks one eye repeatedly and then winks the other to music.", "counterfactual": "A man winks one eye repeatedly and then winks both eyes to music."}
{"src_dataset": "VATEX", "video_name": "wPsrRMiDDS0_000000_000010.mp4", "caption": "A man with facial hair adjusts his hat from the side to the front.", "counterfactual": "A man with facial hair adjusts his hat from the front to the side."}
{"src_dataset": "VATEX", "video_name": "6VUrCeAxiBU_000004_000014.mp4", "caption": "A man strikes a large gong several times, producing resonant sounds.", "counterfactual": "A man strikes a large gong once, producing resonant sounds."}
{"src_dataset": "VATEX", "video_name": "8YRQ62Mj2I0_000000_000010.mp4", "caption": "A man eats chips but then removes one of the chips from his mouth.", "counterfactual": "A man eats chips but then removes two chips from his mouth."}
{"src_dataset": "VATEX", "video_name": "k1peqGMGvAc_000000_000010.mp4", "caption": "A person turns a jump rope side to side before jumping rope.", "counterfactual": "A person jumps rope side to side before turning the jump rope."}
{"src_dataset": "VATEX", "video_name": "gjoZic4WjiQ_000012_000022.mp4", "caption": "A girl runs up a snowy slope and then falls and slips back down and someone else runs at the slope.", "counterfactual": "A girl walks up a snowy slope and then falls and slips back down and someone else walks at the slope."}
{"src_dataset": "VATEX", "video_name": "cpSW1wIsNfU_000108_000118.mp4", "caption": "A little girl shows the top of her toilet seat then lifts it up and says she's applying Pinalen.", "counterfactual": "A little girl shows the top of her toilet seat then lifts it up and says she's applying shaving cream."}
{"src_dataset": "VATEX", "video_name": "1Ab7zUfv0Cg_000381_000391.mp4", "caption": "A man is creating a painting with spray paint and then throws glitter on it.", "counterfactual": "A man is creating a painting with glitter and then throws spray paint on it."}
{"src_dataset": "VATEX", "video_name": "aQ4uMrvliQo_000037_000047.mp4", "caption": "A guy jumps off of a park bench then walks to put trash into a trash can then continues walking around.", "counterfactual": "A guy jumps off of a park bench then walks to put trash into a trash can and then sits back down on the bench."}
{"src_dataset": "VATEX", "video_name": "0HEi6q3bGaw_000011_000021.mp4", "caption": "Someone is talking to their friends before they take off on their snowmobiles.", "counterfactual": "Someone is talking to their friends after they take off on their snowmobiles."}
{"src_dataset": "VATEX", "video_name": "KqEduofYEPs_000013_000023.mp4", "caption": "A girl dances around with a broom stick and then whaps at the camera.", "counterfactual": "A girl dances around with a broomstick and then brushes the camera."}
{"src_dataset": "VATEX", "video_name": "6VUrCeAxiBU_000004_000014.mp4", "caption": "In a classroom, a man hits the gong several times with a stick.", "counterfactual": "In a classroom, a man hits the gong once with a stick."}
{"src_dataset": "VATEX", "video_name": "C7U3aPpccns_000000_000010.mp4", "caption": "A fit man demonstrates a lateral lunge to a forward lunge.", "counterfactual": "A fit man demonstrates a forward lunge to a lateral lunge."}
{"src_dataset": "VATEX", "video_name": "-XT6Blbeowg_000014_000024.mp4", "caption": "A little boy is sitting on a plywood table throwing ping pong balls at the cups located at the other end of the table while a man picks up the balls and gives them back to the little boy.", "counterfactual": "A little boy is sitting on a plywood table throwing ping pong balls at the cups located at the other end of the table while a man picks up the balls and throws them at the little boy."}
{"src_dataset": "VATEX", "video_name": "R3gGBiVBe6Y_000000_000010.mp4", "caption": "A man walks and then throws a frisbee far away in a park with another person", "counterfactual": "A man walks and then throws a frisbee far away in a park with a dog"}
{"src_dataset": "VATEX", "video_name": "FHgd4RqkU9Q_000000_000010.mp4", "caption": "A man wearing sunglasses and a top hat displays a hotdog which he then bites once and swallows the whole thing.", "counterfactual": "A man wearing sunglasses and a top hat displays a hotdog which he then bites twice and swallows the whole thing."}
{"src_dataset": "VATEX", "video_name": "7hRinJ_HSF8_000016_000026.mp4", "caption": "The man is applying a soap to the window, before using another tool to wipe it off.", "counterfactual": "The man is applying a tool to the window, before using another soap to wipe it off."}
{"src_dataset": "VATEX", "video_name": "BEdCfopQWFw_000069_000079.mp4", "caption": "A young man shuffles cards and then stacks them in a different pile.", "counterfactual": "A young man stacks cards and then shuffles them in a different pile."}
{"src_dataset": "VATEX", "video_name": "YbW-CE1-V4Q_000059_000069.mp4", "caption": "A woman irons a shirt on an ironing board, then stands in front of a pile of flat clothes.", "counterfactual": "A woman irons a shirt on a flat clothes, then stands in front of a pile of ironing boards."}
{"src_dataset": "VATEX", "video_name": "qdbAK4zKr58_000048_000058.mp4", "caption": "A daredevil parachutist slams into a building and she makes her way to the ground.", "counterfactual": "A daredevil parachutist slams into the ground and she makes her way to a building."}
{"src_dataset": "VATEX", "video_name": "p29JSs7GoMg_000094_000104.mp4", "caption": "A woman and young boy are walking through a field and the boy stops to pick an apple from a tree.", "counterfactual": "A woman and young boy are walking through a field and the woman picks an apple from a tree and then she hands it to the young boy."}
{"src_dataset": "VATEX", "video_name": "HVWk9aS39UQ_000281_000291.mp4", "caption": "A man talks and works on a car engine, placing a ring around a tube.", "counterfactual": "A man talks and works on a car engine, placing a tube around a ring."}
{"src_dataset": "VATEX", "video_name": "60lmG00V-1g_000022_000032.mp4", "caption": "A woman screws a metal pipe together, then places a towel on her leg and attempts to break the pipe.", "counterfactual": "A woman screws a metal pipe together, then places a towel on her leg and attempts to break the towel."}
{"src_dataset": "VATEX", "video_name": "1L87FAnu1Es_000043_000053.mp4", "caption": "A man cracks a egg and puts it into a cup and then picks up the cup and another cup that has egg in it to.", "counterfactual": "A man cracks a egg and puts it into a cup and then picks up the cup and another cup that has a bird in it to."}
{"src_dataset": "VATEX", "video_name": "t6w-_xe4OPM_000000_000010.mp4", "caption": "A boy is running down a strip to do a high jump over a bar.", "counterfactual": "A boy is running down a strip to do a high jump over a net."}
{"src_dataset": "VATEX", "video_name": "GhBWH6spLNY_000164_000174.mp4", "caption": "A man is grooming is beard with a beard trimmer before opening up beard balm.", "counterfactual": "A man is grooming is beard with a beard trimmer after opening up beard balm."}
{"src_dataset": "VATEX", "video_name": "ba_sxYkeXvU_000036_000046.mp4", "caption": "Man holds paint tray, and uses other hand to move paint roller on a long strip before dipping roller into tray.", "counterfactual": "Man holds paint roller, and uses other hand to move paint tray on a long strip before dipping roller into tray."}
{"src_dataset": "VATEX", "video_name": "wPsrRMiDDS0_000000_000010.mp4", "caption": "A man is sitting down while talking into the camera before he moves his cap from the side to the forward position.", "counterfactual": "A man is sitting down while talking into the camera after he moves his cap from the side to the forward position."}
{"src_dataset": "VATEX", "video_name": "9Rl4mj4fa_U_000203_000213.mp4", "caption": "A man points to a screen and than talks while facing the screen.", "counterfactual": "A man points to a screen and then talks while facing away from the screen."}
{"src_dataset": "VATEX", "video_name": "C-o3FYKKwFY_000023_000033.mp4", "caption": "A boy juggling two white balls once and then just showing them to the camera.", "counterfactual": "A boy juggling two white balls twice and then just showing them to the camera."}
{"src_dataset": "VATEX", "video_name": "A4ScOLc3kDk_000051_000061.mp4", "caption": "Guy pretending to read a book and sneeze 2 times", "counterfactual": "Guy pretending to read a book and sneeze 3 times"}
{"src_dataset": "VATEX", "video_name": "A4ScOLc3kDk_000051_000061.mp4", "caption": "A man sits and opens a book, then sneezes two times.", "counterfactual": "A man sits and opens a book, then sneezes once."}
{"src_dataset": "VATEX", "video_name": "b5wAeJw0fho_000042_000052.mp4", "caption": "Someone is hit a symbol repeatedly and then stops and hits it again.", "counterfactual": "Someone is hit a symbol repeatedly and then stops and hits it once."}
{"src_dataset": "VATEX", "video_name": "uavZAsalZmI_000081_000091.mp4", "caption": "A woman is standing outside and she is wiping the glass and then she sprays the glass with liquid.", "counterfactual": "A woman is standing outside and she is wiping the mirror and then she sprays the mirror with liquid."}
{"src_dataset": "VATEX", "video_name": "M6ykllLdpQA_000019_000029.mp4", "caption": "The baby is shaking it's head, before stopping and staring into the camera.", "counterfactual": "The baby is shaking its head, before continuing to shake it's head and staring into the camera."}
{"src_dataset": "VATEX", "video_name": "sIt77FmjldQ_000000_000010.mp4", "caption": "A woman crosses her eyes, uncrosses one while sticking her tongue out, then uncrosses them", "counterfactual": "A woman crosses her eyes, uncrosses one while sticking her tongue out, then crosses them"}
{"src_dataset": "VATEX", "video_name": "1-eurXds4Ys_000018_000028.mp4", "caption": "A boy presses buttons on a machine and then deposits coins into it.", "counterfactual": "A boy presses buttons on a machine and then deposits cash into it."}
{"src_dataset": "VATEX", "video_name": "aG7rjkh12Rw_000000_000010.mp4", "caption": "A man uses a sledgehammer to hit the top of a car several times.", "counterfactual": "A man uses a sledgehammer to hit the top of a car once."}
{"src_dataset": "VATEX", "video_name": "NxIUWtcE4jE_000004_000014.mp4", "caption": "Two men shake hands before skipping rocks on the water.", "counterfactual": "Two men shake hands after skipping rocks on the water."}
{"src_dataset": "VATEX", "video_name": "8N6IfG3ikfE_000029_000039.mp4", "caption": "Two horses are pulling a man in a harness down a road, then stop.", "counterfactual": "Two horses are pulling a man in a harness down a road, then pass him."}
{"src_dataset": "VATEX", "video_name": "07xU5ig8CBg_000002_000012.mp4", "caption": "A person runs a bike over a ramp and then falls down.", "counterfactual": "A person runs a bike over a ramp and then jumps down."}
{"src_dataset": "VATEX", "video_name": "68abPkuus8E_000010_000020.mp4", "caption": "A person pulled the tape off a person leg while waxing it", "counterfactual": "A person pulled the tape off a person leg after waxing it"}
{"src_dataset": "VATEX", "video_name": "UmbJQOAl5mQ_000013_000023.mp4", "caption": "A woman walking down the street blows on fire then eats it.", "counterfactual": "A woman walking down the street eats fire then blows on it."}
{"src_dataset": "VATEX", "video_name": "dfo3WR33AcY_000407_000417.mp4", "caption": "A male applies polish to a boot and  then uses a heat gun on the wax.", "counterfactual": "A male applies polish to a boot and then uses a heat gun on the polish."}
{"src_dataset": "VATEX", "video_name": "9HuUeribSjI_000000_000010.mp4", "caption": "A man runs up to a piÃ±ata and kicks it down.", "counterfactual": "A man runs up to a piÃ£Â±ata and kicks it down."}
{"src_dataset": "VATEX", "video_name": "oHzB-BFvQzM_000002_000012.mp4", "caption": "A little girl is picking apples, holds up two of them, then tosses one on the ground.", "counterfactual": "A little girl is picking apples, holds up one of them, then tosses it on the ground."}
{"src_dataset": "VATEX", "video_name": "0t0DB1B1w8Y_000000_000010.mp4", "caption": "A person jumps with two feet over four hurdles and then on to a mat.", "counterfactual": "A person jumps with two feet over four hurdles and then on to a horse."}
{"src_dataset": "VATEX", "video_name": "-J-2FfMVre8_000000_000010.mp4", "caption": "A man attempts to balance himself on a thin rope after letting go of wooden sticks for handles.", "counterfactual": "A man attempts to balance himself on a thin rope before letting go of wooden sticks for handles."}
{"src_dataset": "VATEX", "video_name": "hsBm02Ot-UE_000038_000048.mp4", "caption": "A man wakes up on his bed and turns off a gadget, then turns on the light", "counterfactual": "A man wakes up on his bed and turns off a light, then turns on a gadget"}
{"src_dataset": "VATEX", "video_name": "rDF3Y4Uftuw_000002_000012.mp4", "caption": "Youg dirl trying to blow out birthday candles twice while people watch.", "counterfactual": "Youg dirl trying to blow out birthday candles once while people watch."}
{"src_dataset": "VATEX", "video_name": "hmRfB4ubBZM_000000_000010.mp4", "caption": "A person drills a hole into a melon and then puts a straw into it", "counterfactual": "A person drills a hole into a pineapple and then puts a straw into it"}
{"src_dataset": "VATEX", "video_name": "a_rGCA-vxNU_000018_000028.mp4", "caption": "a man pours water over a dog, then shampoo.", "counterfactual": "a man pours water over a dog, then soaps it."}
{"src_dataset": "VATEX", "video_name": "GhBWH6spLNY_000164_000174.mp4", "caption": "A man showcases how to best trim ones beard, before showing how to apply beard balm.", "counterfactual": "A man showcases how to best trim ones beard, after applying beard balm."}
{"src_dataset": "VATEX", "video_name": "vgsveBkXVss_000291_000301.mp4", "caption": "A man is demonstrating how to seal a hole in tyre tubing using a wet sealant on which he dabs a finger before it dries.", "counterfactual": "A man is demonstrating how to seal a hole in tyre tubing using a wet sealant on which he dabs a finger after it dries."}
{"src_dataset": "VATEX", "video_name": "8Ky5s84mDFU_000046_000056.mp4", "caption": "A ball is thrown into the air and then thrown to a man.", "counterfactual": "A man is thrown into the air and then thrown to a ball."}
{"src_dataset": "VATEX", "video_name": "hgN5kxYwT_w_000000_000010.mp4", "caption": "A boy is looking through a microscope, then getting up and walking away.", "counterfactual": "A boy walks away from a microscope, then looking through it."}
{"src_dataset": "VATEX", "video_name": "f8ahDlvAAhc_000007_000017.mp4", "caption": "A man in a gym climbs a rope hand over hand and then descends.", "counterfactual": "A man in a gym descends a rope hand over hand and then climbs."}
{"src_dataset": "VATEX", "video_name": "TAJh1Xz93mo_000084_000094.mp4", "caption": "A woman cuts raw meat, then she picks them up from a tupperware container.", "counterfactual": "A woman picks up raw meat, then she cuts them from a tupperware container."}
{"src_dataset": "VATEX", "video_name": "Vfu1RJAVv7o_000001_000011.mp4", "caption": "A javelin thrower runs several steps and then throws the javelin forward.", "counterfactual": "A javelin is thrown forward and then a runner runs several steps."}
{"src_dataset": "VATEX", "video_name": "gg5NgF4VUBs_000000_000010.mp4", "caption": "A man rubs his face and then places moisturizer in his hands and rubs them together.", "counterfactual": "A man rubs his hands and then places moisturizer in his face and rubs them together."}
{"src_dataset": "VATEX", "video_name": "7GRLn6bWI0c_000005_000015.mp4", "caption": "A woman tells her dog to stay and than tells him to stand.", "counterfactual": "A woman tells her dog to stand and then tells him to stay."}
{"src_dataset": "VATEX", "video_name": "9kwn70duWiQ_000044_000054.mp4", "caption": "A girl and boy are kneeling on the floor and then stand up doing robot moves with their hands.", "counterfactual": "A girl and boy are standing on the floor and then kneel on the ground doing robot moves with their hands."}
{"src_dataset": "VATEX", "video_name": "35j0GIg28sA_000023_000033.mp4", "caption": "A girl takes several bites of a chip, then starts to lick the salt off her finger.", "counterfactual": "A girl takes several bites of a finger, then starts to lick the salt off her chip."}
{"src_dataset": "VATEX", "video_name": "Ocn7yFVKn_A_000024_000034.mp4", "caption": "A young girl talking about a corner that is cut on a piece of paper and then starts to fold the paper.", "counterfactual": "A young girl is talking about a piece of paper that is folded and then starts to cut the paper."}
{"src_dataset": "VATEX", "video_name": "t5_aJ7ZiQSo_000003_000013.mp4", "caption": "A card lays on the table, then a knife is thrown into the knife, and the card with the knife is shown; it's a joker.", "counterfactual": "A knife lays on the table, then a card is thrown into the knife, and the card with the knife is shown; it's a joker."}
{"src_dataset": "VATEX", "video_name": "U_u0hPg8wT8_000021_000031.mp4", "caption": "A boy is talking and then begins to play an instrument with his mouth.", "counterfactual": "A boy is playing an instrument with his mouth and then begins to talk."}
{"src_dataset": "VATEX", "video_name": "mWcrhIN6XWU_000038_000048.mp4", "caption": "A woman is rubbing a cloth on her face before pouring lotion into her hand.", "counterfactual": "A woman is pouring lotion on her face before rubbing a cloth on her hand."}
{"src_dataset": "VATEX", "video_name": "rqdHBBP8O4M_000003_000013.mp4", "caption": "A person pulls a leaf out of a basket and then spray paints it for a decoration.", "counterfactual": "A person pulls a decoration out of a basket and then spray paints it for a leaf."}
{"src_dataset": "VATEX", "video_name": "x2ayjGLcMWc_000000_000010.mp4", "caption": "A man on a horse chases a goat and then wraps it in a harness as a crowd cheers.", "counterfactual": "A man on a goat chases a horse and then wraps it in a harness as a crowd cheers."}
{"src_dataset": "VATEX", "video_name": "1eb7-V13Tms_000000_000010.mp4", "caption": "A bird eats seeds from a person's extended hand, flies away, returns and eats more, then flies off again.", "counterfactual": "A person eats seeds from a bird's extended hand, flies away, returns and eats more, then flies off again."}
{"src_dataset": "VATEX", "video_name": "-HMG9z5871I_000053_000063.mp4", "caption": "A person lays in the snow then sits up while others toss snowballs.", "counterfactual": "A person sits in the snow then lays in the snow while others toss snowballs at him."}
{"src_dataset": "VATEX", "video_name": "NQshaPQUU4g_000074_000084.mp4", "caption": "A hand pours corn into a pan and then pours in peas with it.", "counterfactual": "A hand pours a pan into a pan and then pours in corn with it."}
{"src_dataset": "VATEX", "video_name": "YnojwIPsH0g_000000_000010.mp4", "caption": "A man on a scooter doing a jump and then landing on his face.", "counterfactual": "A man on a scooter doing a face and then landing on his jump."}
{"src_dataset": "VATEX", "video_name": "6An5rzRsdMU_000000_000010.mp4", "caption": "A person runs across a bench and jumps and kicks a tree and falls down.", "counterfactual": "A person runs across a tree and jumps and kicks a bench and falls down."}
{"src_dataset": "VATEX", "video_name": "WFHuy4Cv5qY_000116_000126.mp4", "caption": "A woman talks about reducing the heat as she stirs her mixture and then places it on toast.", "counterfactual": "A woman talks about reducing the toast as she stirs her mixture and then places it on heat."}
{"src_dataset": "VATEX", "video_name": "--SIRvUHMTc_000000_000010.mp4", "caption": "A person stands up then immediately falls on water skis.", "counterfactual": "A person falls on water skis then immediately stands up."}
{"src_dataset": "VATEX", "video_name": "ioCn2rlF7UE_000089_000099.mp4", "caption": "A guy stands at a counter as he adds water to a vase then adds flowers to it.", "counterfactual": "A guy stands at a counter as he adds flowers to a vase then adds water to it."}
{"src_dataset": "VATEX", "video_name": "Vj0XDDcEk2o_000124_000134.mp4", "caption": "A man washes his razor in the running water from the faucet, then uses the razer to shave his face, while a voice-over gives instructions.", "counterfactual": "A man washes his face in the running water from the faucet, then uses the razor to shave his razor, while a voice-over gives instructions."}
{"src_dataset": "VATEX", "video_name": "N81OHjhcrbY_000198_000208.mp4", "caption": "A woman talks and rubs her right eyelid with a q-tip and then applies makeup to her left eyebrow.", "counterfactual": "A woman talks and rubs her left eyelid with a q-tip and then applies makeup to her right eyebrow."}
{"src_dataset": "VATEX", "video_name": "YhN2szE8rR8_000053_000063.mp4", "caption": "A young boy blows up a balloon and the he jumps all around.", "counterfactual": "A young boy jumps all around and then he blows up a balloon."}
{"src_dataset": "VATEX", "video_name": "y4jC1S7vCJE_000016_000026.mp4", "caption": "A man is milking a cow's utter and then a person is pouring milk through a cloth sieve into a pot.", "counterfactual": "A person is milking a cow's utter as a man is pouring milk through a cloth sieve into a pot."}
{"src_dataset": "VATEX", "video_name": "2HuIt-qcXFI_000016_000026.mp4", "caption": "Two boys playing swords and then stop playing and start talking.", "counterfactual": "Two boys playing swords and then stop talking and start talking."}
{"src_dataset": "VATEX", "video_name": "YhN2szE8rR8_000053_000063.mp4", "caption": "A young boy blows into a balloon before letting the air out.", "counterfactual": "A young boy blows into a balloon after letting the air out."}
{"src_dataset": "VATEX", "video_name": "fGhmbpcqqu8_000016_000026.mp4", "caption": "A man drives a golf ball and then watches it.", "counterfactual": "A man watches a golf ball and then drives it."}
{"src_dataset": "VATEX", "video_name": "7at4UFVmTCc_000020_000030.mp4", "caption": "A man lays down before having wax pads ripped off both of his hamstrings.", "counterfactual": "A man lays down after having wax pads ripped off both of his hamstrings."}
{"src_dataset": "VATEX", "video_name": "8hFyyjr-8Rc_000162_000172.mp4", "caption": "A person swings a flaming torch and then spits a flammable substance at the flame.", "counterfactual": "A person swings a flaming torch and then spits a flammable substance at the person."}
{"src_dataset": "VATEX", "video_name": "JKFWTr19ZT0_000055_000065.mp4", "caption": "A man is on his back as he keeps a football in the air using a bicycle kicking style before he lifts his back.", "counterfactual": "A man is on his back as he keeps a bicycle in the air using a football kicking style before he lifts his back."}
{"src_dataset": "VATEX", "video_name": "ycZLj9YgG4c_000004_000014.mp4", "caption": "a person mixes some brownies and then puts some paper over it", "counterfactual": "a person mixes some paper and then puts some brownies over it"}
{"src_dataset": "VATEX", "video_name": "PJVHvcE5z-8_000038_000048.mp4", "caption": "A girl is sitting cross legged on a toilet seat brushing her teeth and then she stands up.", "counterfactual": "A girl stands up on a toilet seat brushing her teeth and then she sits cross legged on a toilet seat brushing her teeth."}
{"src_dataset": "VATEX", "video_name": "1N2r_EIzs5g_000000_000010.mp4", "caption": "A young girl inflates and deflates a balloon repeatedly.", "counterfactual": "A young girl is being inflated and deflated by a balloon repeatedly."}
{"src_dataset": "VATEX", "video_name": "81gFQUWEutk_000011_000021.mp4", "caption": "A man jumped down from a platform and them climbed to the top of the rail", "counterfactual": "A man climbed down from a platform and then jumped to the top of the rail"}
{"src_dataset": "VATEX", "video_name": "r2BadvUBRWc_000008_000018.mp4", "caption": "A woman runs down track and then leaps to make a long jump in a track event.", "counterfactual": "A long jump in a track event runs down a woman and then leaps to make a woman in a track event."}
{"src_dataset": "VATEX", "video_name": "WaHdyPbgAqE_000001_000011.mp4", "caption": "A cowboy ropes a steer from his horse, but falls as he dismounts and then chases after the steer", "counterfactual": "A cowboy ropes his horse from a steer, but falls as he dismounts and then chases after the steer"}
{"src_dataset": "VATEX", "video_name": "9F7-bxIMkeU_000004_000014.mp4", "caption": "A man uses a pole vault to vault into the ocean, but falls into shallow water.", "counterfactual": "A man uses a pole vault to vault into shallow water, but falls into the ocean."}
{"src_dataset": "VATEX", "video_name": "7uOM7hfLrgw_000115_000125.mp4", "caption": "A couple of men are working on a machine that fills bags with something and then another man stacks them.", "counterfactual": "A couple of men are working on a machine that stacks bags and then another man fills them."}
{"src_dataset": "VATEX", "video_name": "oukDXzcfbB4_000264_000274.mp4", "caption": "A man drys the inside of a ball cap before putting it on his head.", "counterfactual": "A man drys the inside of his head before putting a ball cap on it."}
{"src_dataset": "VATEX", "video_name": "I5vs7yhnMPg_000105_000115.mp4", "caption": "A girl ties a bow in her shirt and she fluffs the bow up.", "counterfactual": "A girl fluffs a bow in her shirt and she ties the bow up."}
{"src_dataset": "VATEX", "video_name": "A5k6u3eWcGo_000003_000013.mp4", "caption": "a man stands outside holding a hose, and another man sits on the ground- the first man sprays  him and then slaps him.", "counterfactual": "a man sits outside holding a hose, and another man stands on the ground- the first man sprays him and then slaps him."}
{"src_dataset": "VATEX", "video_name": "IcSYsu7ZzCs_000004_000014.mp4", "caption": "A football player walks a few feet across the field, then stops to stretch before continuing his walk.", "counterfactual": "A football player walks a few feet across the field, then stops to stretch before continuing his stretch."}
{"src_dataset": "VATEX", "video_name": "P6iUVdelLbs_000000_000010.mp4", "caption": "A baby sits on a bed and then the baby slowly falls upside down on the bed", "counterfactual": "The baby slowly falls upside down on the bed and then the baby sits on a bed"}
{"src_dataset": "VATEX", "video_name": "hmRfB4ubBZM_000000_000010.mp4", "caption": "A man drills a hole in a coconut and then sticks in a straw for a drink.", "counterfactual": "A man drills a hole in a straw and then sticks in a coconut for a drink."}
{"src_dataset": "VATEX", "video_name": "n2k6sl1j1JE_000011_000021.mp4", "caption": "Someone is riding a bike down a dirt road and then falls down.", "counterfactual": "A bike is falling down a dirt road and then someone is riding."}
{"src_dataset": "VATEX", "video_name": "Wet9QOVaRPM_000457_000467.mp4", "caption": "A girl combs through her hair while talking, then picks up a brush and starts brushing.", "counterfactual": "A girl combs through her hair while talking, then picks up a brush and starts talking."}
{"src_dataset": "VATEX", "video_name": "0C_TGr-V2Bw_000000_000010.mp4", "caption": "An athlete runs down a track, and then reaches a line and makes a long jump into a sand pit.", "counterfactual": "An athlete runs down a track, and then reaches a line and makes a long jump over a sand pit."}
{"src_dataset": "VATEX", "video_name": "nOvTMptLfz8_000054_000064.mp4", "caption": "A man is practicing with a bow an arrow, after he hits a target he then reaches for another arrow.", "counterfactual": "A man is practicing with a bow an arrow, after he hits a target he then reaches for another target."}
{"src_dataset": "VATEX", "video_name": "d13fbMZ75EQ_000009_000019.mp4", "caption": "Someone uses a wood burning tool to burn a design into a slice of wood and then begins to brush polyurethane unto it.", "counterfactual": "Someone uses a wood burning tool to brush polyurethane unto a slice of wood and then begins to burn a design into it."}
{"src_dataset": "VATEX", "video_name": "adabI1LESIs_000115_000125.mp4", "caption": "A woman stacks a log on a stop, then brings down an ax twice in order to split the log.", "counterfactual": "A woman stacks a log on a stop, then brings down an ax once in order to split the log."}
{"src_dataset": "VATEX", "video_name": "5QSrCC6LgXQ_000000_000010.mp4", "caption": "A kid runs down a track and then makes a small jump into sand.", "counterfactual": "A kid runs down a track and then makes a small jump into a kid."}
{"src_dataset": "VATEX", "video_name": "17Gjt3E3w80_000089_000099.mp4", "caption": "A young woman lights her face with a lamp and then makes that light intermittent.", "counterfactual": "A young woman lights her lamp with her face and then makes that lamp intermittent."}
{"src_dataset": "VATEX", "video_name": "5P2OTIccstc_000071_000081.mp4", "caption": "A man melts a sheet of ice on a driveway while another man breaks it up with a shovel.", "counterfactual": "A man breaks up a sheet of ice on a driveway while another man melts it with a shovel."}
{"src_dataset": "VATEX", "video_name": "l6YSTcfgEw8_000027_000037.mp4", "caption": "A man looks at a door then walks to a room, looks in before going in and squating down to look at something", "counterfactual": "A man looks at a room, then walks to a door, looks in before going in and squatting down to look at something"}
{"src_dataset": "VATEX", "video_name": "XMFbCEKtovk_000023_000033.mp4", "caption": "The large area outdoors is covered with a layer of cement and then planed by machinery to smoothness", "counterfactual": "The large area outdoors is covered with a layer of machinery and then cemented by smoothing"}
{"src_dataset": "VATEX", "video_name": "3CtEhqybW5M_000327_000337.mp4", "caption": "Two people are video conferencing with each other and using sign language to do so before one starts to talk.", "counterfactual": "Two people are video conferencing with each other and using sign language to do so after one starts to talk."}
{"src_dataset": "VATEX", "video_name": "10_SXQ_sJrU_000088_000098.mp4", "caption": "A person squeezes a water bottle and picks up an egg with it while giving instructions.", "counterfactual": "A person squeezes an egg and picks up a water bottle with it while giving instructions."}
{"src_dataset": "VATEX", "video_name": "TP9cJIKpvDk_000010_000020.mp4", "caption": "A man is putting chips into his mouth and then feeding them to a pig, whilst someone else expresses their disgust.", "counterfactual": "A man is putting chips into a pig's mouth and then feeding them to a man, whilst someone else expresses their disgust."}
{"src_dataset": "VATEX", "video_name": "Da0bZCmiFzc_000000_000010.mp4", "caption": "A teenage girl, who is standing on a volleyball court, throws a volleyball up and then spikes it over the net.", "counterfactual": "A teenage girl, who is standing on a volleyball court, spikes a volleyball up and then throws it over the net."}
{"src_dataset": "VATEX", "video_name": "t6w-_xe4OPM_000000_000010.mp4", "caption": "A kid runs down a track with a long pole and then does the high jump.", "counterfactual": "A kid runs down a track with a high jump and then does the long pole."}
{"src_dataset": "VATEX", "video_name": "E8wPUDB5WAc_000000_000010.mp4", "caption": "A man runs across a field and then performs a high jump over a bar, while another person commentates", "counterfactual": "A man runs across a field, performs a high jump over a bar, and then comments"}
{"src_dataset": "VATEX", "video_name": "j8Bp0L9D1oM_000074_000084.mp4", "caption": "A man is doing the shot put in slow motion as a commentator goes through the movement.", "counterfactual": "A man is doing the shot put in slow motion after a commentator goes through the movement."}
{"src_dataset": "VATEX", "video_name": "D9aCTlKLF5Y_000060_000070.mp4", "caption": "a person is cooking dough that was in a pan and then puts them all in a glass container.", "counterfactual": "a person is cooking dough that was in a glass container and then puts them all in a pan."}
{"src_dataset": "VATEX", "video_name": "JibAaj4av9Y_000011_000021.mp4", "caption": "Three pumpkins are seen sitting on a table before someone takes a knife to one and carves the core off.", "counterfactual": "Three pumpkins are seen sitting on a table after someone takes a knife to one and carves the core off."}
{"src_dataset": "VATEX", "video_name": "F2nKBVeFF7s_000158_000168.mp4", "caption": "A person has a paper plane in his hands and puts it on the floor and then he picks a piece of paper and he bends it on the floor.", "counterfactual": "A person has a piece of paper in his hands and he bends it on the floor and then he picks a paper plane and he puts it on the floor."}
{"src_dataset": "VATEX", "video_name": "q5-y6td84AQ_000002_000012.mp4", "caption": "A young woman whistles a tune and then tries to get her friend to do it.", "counterfactual": "A young woman tries to get her friend to whistle a tune and then whistles a tune."}
{"src_dataset": "VATEX", "video_name": "Uj3FDarLXzY_000014_000024.mp4", "caption": "A person stands on the spring diving board, jumps up and then does a flip into the swimming pool.", "counterfactual": "A person does a flip on the spring diving board before jumping up and then standing on the edge of the pool."}
{"src_dataset": "VATEX", "video_name": "jsltYtLEKoY_000005_000015.mp4", "caption": "A person with sword in their mouth performs a push with their hands then pulls the sword out of their mouth.", "counterfactual": "A person with sword in their mouth performs a pull with their hands then performs a push with their hands."}
{"src_dataset": "VATEX", "video_name": "wAF9Laa7kaY_000023_000033.mp4", "caption": "A timelapse where a man cuts up small pieces of a wrap then puts into a case", "counterfactual": "A timelapse where a man cuts up small pieces of a case and then puts into a wrap"}
{"src_dataset": "VATEX", "video_name": "bjJw5KSto1k_000052_000062.mp4", "caption": "A man fastens and bends a reed as he crafts a basket.", "counterfactual": "A man fastens and bends a reed after crafting a basket."}
{"src_dataset": "VATEX", "video_name": "CZhwoBSGMKE_000093_000103.mp4", "caption": "A female is talking and then starts using a make up brush on her cheeks.", "counterfactual": "A female starts using a make up brush on her cheeks and then talks."}
{"src_dataset": "VATEX", "video_name": "9ANMf4YyG9c_000046_000056.mp4", "caption": "An african american shild spins a toy in his hands and then drops it.", "counterfactual": "An african american shild drops a toy in his hands and then spins a toy in his hands."}
{"src_dataset": "VATEX", "video_name": "sGxujaBZWEI_000001_000011.mp4", "caption": "A man was dropping a barbell and lifting it up to his thigh in multiple repetitions", "counterfactual": "A man was lifting a barbell to his thigh in multiple repetitions, then dropping it"}
{"src_dataset": "VATEX", "video_name": "dMc7rkyeIEU_000016_000026.mp4", "caption": "A baby on the floor is sitting up before she crawls.", "counterfactual": "A baby on the floor is crawling before she sits up."}
{"src_dataset": "VATEX", "video_name": "ykxTdjTcFI4_000022_000032.mp4", "caption": "A person  with gloves is climbing upstairs from a vehicle to the long rod", "counterfactual": "A person with gloves is climbing upstairs from a vehicle to the ladder"}
{"src_dataset": "VATEX", "video_name": "j8_2Ae_MTW4_000000_000010.mp4", "caption": "A person hits a cymbal multiple times and then stops hitting it.", "counterfactual": "A person stops hitting a cymbal multiple times and then hits it."}
{"src_dataset": "VATEX", "video_name": "3LOWrfmj8eM_000003_000013.mp4", "caption": "Someone is striking an ornate gong three times, producing a resonating sound.", "counterfactual": "Someone is striking an ornate gong two times, producing a resonating sound."}
{"src_dataset": "VATEX", "video_name": "J9xSHM190hU_000004_000014.mp4", "caption": "A person claps before a man pole vaults in slow motion.", "counterfactual": "A person pole vaults in slow motion while a man claps."}
{"src_dataset": "VATEX", "video_name": "LfV15U34x88_000089_000099.mp4", "caption": "One man pats another's stomach before it cuts to another man doing something with his mouth and then shows a young woman.", "counterfactual": "One man pats another's stomach after it cuts to another man doing something with his mouth and then shows a young woman."}
{"src_dataset": "VATEX", "video_name": "O9kGwMsJm7I_000170_000180.mp4", "caption": "A woman places a napkin on the table and shows how well she has folded it multiple times", "counterfactual": "A woman places a napkin on the table and shows how well she has folded it once"}
{"src_dataset": "VATEX", "video_name": "PJVHvcE5z-8_000038_000048.mp4", "caption": "A woman is siting on the toilet and she is brushing her teeth with an electric toothbrush and then she gets up from the toilet.", "counterfactual": "A woman gets up from the toilet and she is brushing her teeth with an electric toothbrush and then she sits on the toilet."}
{"src_dataset": "VATEX", "video_name": "96rvT8LhoyQ_000000_000010.mp4", "caption": "Graphics play before a man is talking and doing some exercises.", "counterfactual": "Graphics play after a man is talking and doing some exercises."}
{"src_dataset": "VATEX", "video_name": "81FISupw6KA_000000_000010.mp4", "caption": "A man selects a weight before doign tricep pushdowns on a machine in a gym.", "counterfactual": "A man selects a weight after doign tricep pushdowns on a machine in a gym."}
{"src_dataset": "VATEX", "video_name": "0SayN7fM7aE_000114_000124.mp4", "caption": "Two young boys lie out clothing on the floor to fold.", "counterfactual": "Two young boys fold clothing on the floor to lie out."}
{"src_dataset": "VATEX", "video_name": "qdKnAq7KQ5c_000085_000095.mp4", "caption": "A woman sitting at a table folding a piece of cloth before Ironing it.", "counterfactual": "A woman sitting at a table ironing a piece of cloth before folding it."}
{"src_dataset": "VATEX", "video_name": "7Eoaj1HBv28_000418_000428.mp4", "caption": "A lady shows how to apply eyebrow liner before explaining her look.", "counterfactual": "A lady shows how to apply eyebrow liner after explaining her look."}
{"src_dataset": "VATEX", "video_name": "f5ahf8XwzSw_000008_000018.mp4", "caption": "A volleyball player bounces the ball and prepares to serve, but fails.", "counterfactual": "A volleyball player serves the ball but fails to bounce it."}
{"src_dataset": "VATEX", "video_name": "C6txscH6ZlM_000066_000076.mp4", "caption": "A man does a card shuffling trick while people watch appreciatively.", "counterfactual": "A man does a card shuffling trick after people watch appreciatively."}
{"src_dataset": "VATEX", "video_name": "X8f1E4goDY0_000020_000030.mp4", "caption": "A person holds a hose and then sprays water at a dog.", "counterfactual": "A person sprays a dog at a hose and then holds it."}
{"src_dataset": "VATEX", "video_name": "_nSoOam8lZI_000000_000010.mp4", "caption": "A man lifts a weighted bar from the ground above his head then drops the bar below his knees and lifts it again several times.", "counterfactual": "A man lifts a weighted bar from the ground below his head and drops it above his knees and lifts it again several times."}
{"src_dataset": "VATEX", "video_name": "WHAEDr-9PBk_000000_000010.mp4", "caption": "A person riding a segway up an incline and then down some steps.", "counterfactual": "A person riding a segway down an incline and then up some steps."}
{"src_dataset": "VATEX", "video_name": "olcn2lYN2P4_000001_000011.mp4", "caption": "A young guy is sliding in the snow and and ends up sliding in the icy water", "counterfactual": "A young guy ends up sliding in the icy water and then slides in the snow"}
{"src_dataset": "VATEX", "video_name": "dIShYkSZzuA_000023_000033.mp4", "caption": "A person is applying some adhesive to a ceiling before covering it with wood.", "counterfactual": "A person is applying some adhesive to the wood before covering it with a ceiling."}
{"src_dataset": "VATEX", "video_name": "5TOz35p8lLk_000000_000010.mp4", "caption": "A man is talking and then begins to make funny faces.", "counterfactual": "A man makes funny faces and then begins to talk."}
{"src_dataset": "VATEX", "video_name": "-j1vjISEjps_000000_000010.mp4", "caption": "A man steadies his club before hitting a golf ball across the lawn.", "counterfactual": "A man steadies his club after hitting a golf ball across the lawn."}
{"src_dataset": "VATEX", "video_name": "7Mu3gZYM9ws_000139_000149.mp4", "caption": "A man stands near the stage before grabbing his jacket on the ground.", "counterfactual": "A man stands near the stage after grabbing his jacket on the ground."}
{"src_dataset": "VATEX", "video_name": "HJyq6PywM3U_000098_000108.mp4", "caption": "A woman, who is standing in a bathroom, pours a liquid solution on a toilet brush before she starts wiping the toilet with her brush.", "counterfactual": "A woman, who is standing in a bathroom, pours a liquid solution on a toilet brush after she starts wiping the toilet with her brush."}
{"src_dataset": "VATEX", "video_name": "95DAXZ79OA4_000000_000010.mp4", "caption": "A man is banging his head on a table and on a wall.", "counterfactual": "A man bangs his head on a wall and then on a table."}
{"src_dataset": "VATEX", "video_name": "I3URfattavI_000000_000010.mp4", "caption": "A person wraps a box using newspaper, then snips a thread with scissors.", "counterfactual": "A person wraps a box using scissors, then snips a thread with newspaper."}
{"src_dataset": "VATEX", "video_name": "ZoWgCBQc6wE_000002_000012.mp4", "caption": "A man is riding a horse then starts to beat up a baby cow.", "counterfactual": "A man is riding a baby cow, then starts to beat up a horse."}
{"src_dataset": "VATEX", "video_name": "8NyxkE-Vtws_000023_000033.mp4", "caption": "A young is standing at a baseball infield and catches  a ball with a glove and then throws it away.", "counterfactual": "A young is standing at a baseball infield throwing a ball away with a glove and then catching a ball."}
{"src_dataset": "VATEX", "video_name": "La5hfzBaJIg_000000_000010.mp4", "caption": "A girl holds a volleyball then hits it underhand with her right hand.", "counterfactual": "A girl hits a volleyball underhand with her right hand then holds it."}
{"src_dataset": "VATEX", "video_name": "GCQiuk3lRgU_000258_000268.mp4", "caption": "A woman puts something in a nail polish jar and shakes it.", "counterfactual": "A woman shakes something in a nail polish jar and then puts it in."}
{"src_dataset": "VATEX", "video_name": "hpxbo1yQfdQ_000000_000010.mp4", "caption": "Full sized carrots are initially displayed before a chefs knife is used to chop up real carrots in a kitchen.", "counterfactual": "Full sized carrots are initially chopped up by a chefs knife in a kitchen, then a chefs knife is used to display real carrots."}
{"src_dataset": "VATEX", "video_name": "r2BadvUBRWc_000008_000018.mp4", "caption": "An athlete runs and launches herself in the long jump discipline as a sports venue is filmed.", "counterfactual": "An athlete runs and launches herself in the long jump discipline after a sports venue is filmed."}
{"src_dataset": "VATEX", "video_name": "dMNdssqAA08_000056_000066.mp4", "caption": "Charcoal is placed on a grill and set on fire and then kabobs are grilled.", "counterfactual": "Charcoal is placed on a kabob and set on fire and then grilled."}
{"src_dataset": "VATEX", "video_name": "q4owm3Er7d8_000000_000010.mp4", "caption": "A man lifts a long weight twice while another man watches and cheers.", "counterfactual": "A man lifts a long weight once while another man watches and cheers."}
{"src_dataset": "VATEX", "video_name": "3xI6BK_hKXs_000004_000014.mp4", "caption": "The instructor is explaining a stretch, he takes his left arm, out stretched, wraps his arm with his right arm and stretches the left arm.", "counterfactual": "The instructor is explaining a stretch, he takes his right arm, out stretched, wraps his arm with his left arm and stretches the right arm."}
{"src_dataset": "VATEX", "video_name": "TWOQW1--tNg_000003_000013.mp4", "caption": "A boy climbes a rope hanging from a tree branch and then slides down.", "counterfactual": "A boy slides down a rope hanging from a tree branch and then climbes it."}
{"src_dataset": "VATEX", "video_name": "PaR0B1nH3KE_000071_000081.mp4", "caption": "A man is talking and then he begins to do a hand stand.", "counterfactual": "A man is doing a hand stand and then he is talking."}
{"src_dataset": "VATEX", "video_name": "jzOndFOIECw_000001_000011.mp4", "caption": "A person lighted a cigarette and started smoking it", "counterfactual": "A person started smoking a cigarette and then lighted it"}
{"src_dataset": "VATEX", "video_name": "V-OF7PsKTDU_000000_000010.mp4", "caption": "A man in a dark room is swallowing a light sabor and than pulling it back out", "counterfactual": "A man in a dark room is pulling a light sabor out of his mouth and then swallowing it"}
{"src_dataset": "VATEX", "video_name": "6horR3Ol4Rs_000000_000010.mp4", "caption": "A young child tries to eat cake with two utensils before being fed.", "counterfactual": "A young child is fed before trying to eat cake with two utensils."}
{"src_dataset": "VATEX", "video_name": "f5p05_oKhYM_000050_000060.mp4", "caption": "Three men lift up baseball caps and then place the caps back.", "counterfactual": "Three men place baseball caps on their heads and then lift up the caps."}
{"src_dataset": "VATEX", "video_name": "E1wfdjBqL3g_000094_000104.mp4", "caption": "At a field, a man winds up and spins twice before throwing the ball.", "counterfactual": "At a field, a man throws the ball after winding up and spinning once."}
{"src_dataset": "VATEX", "video_name": "NXzpCx7QP1o_000009_000019.mp4", "caption": "A kid is twisting his arms back and forth and puts his arms behind him.", "counterfactual": "A kid is twisting his arms behind and then puts his arms back and forth."}
{"src_dataset": "VATEX", "video_name": "fi8RiVnGr8Q_000003_000013.mp4", "caption": "A male is having hot cream smeared onto his eyebrows before the waxing begins.", "counterfactual": "A male is having wax smeared onto his eyebrows before the hot cream begins."}
{"src_dataset": "VATEX", "video_name": "Wet9QOVaRPM_000457_000467.mp4", "caption": "A girl is sitting on a couch and combing her hair repeatedly.", "counterfactual": "A girl is sitting on a couch and combing her hair once."}
