{"src_dataset": "MSRVTT", "video_name": "video9609.mp4", "caption": "two astronauts experiencing a tense situation before relaxing afterwards", "counterfactual": "two astronauts relaxing before experiencing a tense situation afterwards", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video8089.mp4", "caption": "a police officer drives his white car onto a grassy field and then back on to the street", "counterfactual": "a police officer drives his white car onto a street and then onto a grassy field", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9532.mp4", "caption": "the man first holds an award then is arrested and is in court", "counterfactual": "the man is first arrested and then holds an award in court", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9006.mp4", "caption": "a lady in her kitchen  first shows some great cooked noodles and then cooks the pork until done in a saucepan on a stove", "counterfactual": "a lady in her kitchen  first cooks the pork until done in a saucepan on a stove and then shows some great cooked noodles", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9400.mp4", "caption": "a video game character bursts into flame before shoving its claws into another and dragging it down to hell", "counterfactual": "a video game character bursts into flame after shoving its claws into another and dragging it down to hell", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video7200.mp4", "caption": "a woman is shaking many people s hands after receiving a trophy", "counterfactual": "a woman is receiving a trophy after shaking many people s hands", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video7498.mp4", "caption": "a cartoon character gets shot and then stabbed by two other cartoon characters", "counterfactual": "a cartoon character gets stabbed and then shot by two other cartoon characters", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9181.mp4", "caption": "small girl explains her process before she cleans a cage", "counterfactual": "small girl cleans a cage before she explains her process", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9357.mp4", "caption": "a woman laughs until she chokes", "counterfactual": "a woman chokes until she laughs", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video7509.mp4", "caption": "women dressed in swimsuits dance on stage before they synchronize swim", "counterfactual": "women dressed in swimsuits synchronize swim on stage before they dance", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video7919.mp4", "caption": "a video game character jumps and then seems to fly in the air", "counterfactual": "a video game character seems to fly in the air and then jumps", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video7307.mp4", "caption": "a parade is brought to a standstill for a little while then continues", "counterfactual": "a parade continues for a little while then is brought to a standstill", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video7138.mp4", "caption": "a man drive a car and park and talk", "counterfactual": "a man park a car and drive and talk", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9758.mp4", "caption": "several dignitaries shake hands and then a korean boy is interviewed", "counterfactual": "several dignitaries are interviewed and then a Korean boy shakes hands", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9843.mp4", "caption": "a man siphoning liquid from one container to another", "counterfactual": "a man siphoning liquid from another container to one", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9580.mp4", "caption": "a dog is eating out of a yellow bowl then from a blue bowl", "counterfactual": "a dog is eating out of a blue bowl then from a yellow bowl", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video8776.mp4", "caption": "a person shows the uncooked meat and then it is baked to eat", "counterfactual": "a person bakes the uncooked meat and then shows it to eat", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video7781.mp4", "caption": "ghost like figures are singing than they turn into real people", "counterfactual": "ghost-like figures turn into real people, then they start singing", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video8640.mp4", "caption": "a monkey sitting in a river looking around before closing his eyes", "counterfactual": "a monkey closing his eyes before sitting in a river and looking around", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video8560.mp4", "caption": "a lamborghini pulls up to a busy road before it makes a left turn", "counterfactual": "a lamborghini makes a left turn before it pulls up to a busy road", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video8973.mp4", "caption": "an animated red car sits near a silver animated mini van then drives off", "counterfactual": "an animated red car drives off near a silver animated mini van and then sits", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video8444.mp4", "caption": "the two women marinate chicken before they begin preparing the dish", "counterfactual": "the two women begin preparing the dish before they marinate chicken", "aspect": "Sequence"}
{"src_dataset": "MSRVTT", "video_name": "video9001.mp4", "caption": "a watermelon is cut and the insides blended", "counterfactual": "a watermelon is blended and the insides cut", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "VFYCU8FDRTM_000000_000010.mp4", "caption": "A person slides down a sandy path and falls down.", "counterfactual": "A person falls down and slides down a sandy path.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "ngbrye39-Qk_000190_000200.mp4", "caption": "A guy drops a cellular phone on the ground then he picks it up to reveal no stratches.", "counterfactual": "A guy picks up a cellular phone from the ground to reveal no scratches, then he drops it.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "osHg8V0M8Qs_000002_000012.mp4", "caption": "A man on a stage swallows a sword then bends forward to show the hilt.", "counterfactual": "A man on a stage bends forward to show the hilt then swallows a sword.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "kh7kB8n-tDY_000013_000023.mp4", "caption": "A woman shakes her head after taking a shot of liquor at a bar.", "counterfactual": "A woman shakes her head before taking a shot of liquor at a bar.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "r9JyAaVXJ3o_000001_000011.mp4", "caption": "A guy rides his skateboard, jumps on a bench, and then falls.", "counterfactual": "A guy rides his skateboard, falls, and then jumps on a bench.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "ta7i2yT1YHI_000012_000022.mp4", "caption": "A woman in a yoga studio stretches upward twice and then reaches down to her toes.", "counterfactual": "A woman in a yoga studio reaches down to her toes and then stretches upward twice.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "7qnnCkJdBZc_000121_000131.mp4", "caption": "Toddler crawls to grabs toy from corner, kneels to scratch wall with toy, and stands to reach for toy after throwing toy on table.", "counterfactual": "Toddler stands to reach for toy, kneels to scratch wall with toy, and crawls to grabs toy from corner before throwing toy on table.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "fYEoWhI2T3Q_000000_000010.mp4", "caption": "A person is pouring liquid from a bottle into a green shot glass, then a woman is drinking from a large bottle.", "counterfactual": "A woman is drinking from a large bottle, then a person is pouring liquid from a bottle into a green shot glass.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "Cjf6lzKOIFU_000062_000072.mp4", "caption": "A person pulls tape off the edge of flooring and presses the flooring down.", "counterfactual": "A person presses the flooring down and pulls tape off the edge of flooring.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "6zRgzbfPOcU_000011_000021.mp4", "caption": "A woman wearing blue gloves ties up a garbage bag in a trashcan, removes it and replaces the bag with a clean bag.", "counterfactual": "A woman wearing blue gloves removes a garbage bag in a trashcan, replaces the bag with a clean bag and ties it up.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "W9YS0dYAQIw_000008_000018.mp4", "caption": "A young boy walks towards a ball and picks it up and then tosses it.", "counterfactual": "A young boy tosses a ball and then walks towards it and picks it up.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "MqPBZFPTfy4_000000_000010.mp4", "caption": "A man hits a tire repeatedly with a large hammer.", "counterfactual": "A man hits a tire once with a large hammer.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "5D-lITAUrac_000000_000010.mp4", "caption": "A student in class smashes his forehead on the desk two times.", "counterfactual": "A student in class smashes his forehead on the desk three times.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "9TnkwnECHVw_000008_000018.mp4", "caption": "A girl is putting beads and shells onto string after she cuts it.", "counterfactual": "A girl is cutting a string after she puts beads and shells onto it.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "95YJMSMrrFY_000000_000010.mp4", "caption": "A young teenage boy is outdoors in front of a crowd running on a track then jumping into a pit of sand which a woman measures the distance of.", "counterfactual": "A young teenage boy is outdoors in front of a crowd jumping into a pit of sand which a woman measures the distance of then running on a track.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "FHgd4RqkU9Q_000000_000010.mp4", "caption": "A man wearing sunglasses and a top hat displays a hotdog which he then bites once and swallows the whole thing.", "counterfactual": "A man wearing sunglasses and a top hat displays a hotdog which he then bites twice and swallows the whole thing.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "80gP00Rpv7o_000074_000084.mp4", "caption": "A woman applied lip gloss on her lips and sat down", "counterfactual": "A woman sat down and applied lip gloss on her lips", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "1uA_9vkUWUs_000074_000084.mp4", "caption": "A person watered a flower pot with a watering can and dropped the can on the floor", "counterfactual": "A person dropped a watering can on the floor and watered a flower pot with the can", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "TS1YHVWuKNU_000014_000024.mp4", "caption": "A girl is filling a pillow up with fresh cotton before sealing the pillow up wth a sewing machine.", "counterfactual": "A girl is filling a pillow up with fresh cotton after sealing the pillow up wth a sewing machine.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "_7CUAi0Z_j4_000018_000028.mp4", "caption": "Two women take a drink after a man counts down.", "counterfactual": "Two women take a drink while a man counts down.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "25_JtMYvjIs_000167_000177.mp4", "caption": "A man and a woman are cooking together, and the woman is stirring while the man is adding items to the pan.", "counterfactual": "A man and a woman are cooking together, and the woman is stirring after the man adds items to the pan.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "QorodcJBwHo_000094_000104.mp4", "caption": "A girl stands, chewing on gum, then bends down and blows a bubble.", "counterfactual": "A girl bends down, chewing on gum, then stands and blows a bubble.", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "_vK13Pa2mPU_000002_000012.mp4", "caption": "a girl does back flips on a mat and the grass outdoors, then does front flips the other direction", "counterfactual": "a girl does front flips on a mat and the grass outdoors, then does back flips the other direction", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "AkFy3j-73JA_000018_000028.mp4", "caption": "a woman is ice skating then she does several twirls before stopping", "counterfactual": "a woman is ice skating then she does a single twirl before stopping", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "A6-uRRwh6Qg_000394_000404.mp4", "caption": "a woman moves her hand on top of a sandwich multiple times", "counterfactual": "a woman moves her hand on top of a sandwich once", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "AF8inqcdDa0_000001_000011.mp4", "caption": "a boy sits in a chair as a blanket then a football wiz by his head", "counterfactual": "a boy sits in a chair as a football then a blanket wiz by his head", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "4LTWOaW_a-o_000001_000011.mp4", "caption": "a steering wheel is being rotated right the rotated left", "counterfactual": "a steering wheel is being rotated left then rotated right", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "fAE7Jen7r5M_000011_000021.mp4", "caption": "a small boy swings his hands in the air and then he puts his hand on the ground", "counterfactual": "a small boy puts his hand on the ground and then swings his hands in the air", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "pc4ThgVk9Bk_000019_000029.mp4", "caption": "a man runs and broke his trap he sits down and fix it", "counterfactual": "a man runs and fixed his trap he sits down and breaks it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "4d6Ch7lhz5w_000000_000010.mp4", "caption": "a boy is blow drying his hair and then is blow drying his chest", "counterfactual": "a boy is blow drying his chest and then is blow drying his hair", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "fGhmbpcqqu8_000016_000026.mp4", "caption": "a man drives a golf ball and then watches it", "counterfactual": "a man watches a golf ball and then drives it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "P29BvS-QPoE_000000_000010.mp4", "caption": "a young man backflips off of the top of a rock into the water, people laugh during his attempt", "counterfactual": "a young man backflips off of the top of a rock into the water, people laugh after his attempt", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "cL2JxvNbnKw_000017_000027.mp4", "caption": "a man is hugging a woman and then he lets go and the woman walks off", "counterfactual": "a man lets go of a woman and then he hugs her and the woman walks off", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "l_CJXhNEumY_000003_000013.mp4", "caption": "a guy touches a wire to a surface making a little wooden door open then close once the wire is removed", "counterfactual": "a guy touches a wire to a surface making a little wooden door close then open once the wire is removed", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "oHzB-BFvQzM_000002_000012.mp4", "caption": "a young girl is picking apples from a tree, then she throws one", "counterfactual": "a young girl is throwing apples from a tree, then she picks one", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "xco91_ILA7U_000011_000021.mp4", "caption": "someone touches a tv and then smashes it with a long object", "counterfactual": "someone smashes a tv with a long object and then touches it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "V-mnBmZIZRM_000012_000022.mp4", "caption": "a boy stands on his head but then falls over", "counterfactual": "a boy falls over but then stands on his head", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "GzhYd83A39E_000078_000088.mp4", "caption": "a woman shows what attachment to apply to a blow drier before she uses it", "counterfactual": "a woman uses a blow drier before she shows what attachment to apply to it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "T8HG3HBbXMc_000000_000010.mp4", "caption": "a preteen girl talking to another teen about doing a video about applying lipstick with a brush before her mother got home", "counterfactual": "a preteen girl's mother gets home before she talks to another teen about doing a video about applying lipstick with a brush", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "XAoy-C2eroo_000115_000125.mp4", "caption": "a little baby walks around with someone's cell phone and then sits on a step stool", "counterfactual": "a little baby sits on a step stool and then walks around with someone's cell phone", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "aHtoFuDyNjg_000108_000118.mp4", "caption": "a man wearing a helmet is welding some pipes before yelling", "counterfactual": "a man wearing a helmet is yelling before welding some pipes", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "wjSGBT2D-Tc_000001_000011.mp4", "caption": "young boy in white hat and blue coat attempting to feed a stick to a parrot before the parrot flies away,", "counterfactual": "young boy in white hat and blue coat attempting to feed a stick to a parrot after the parrot flies away", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "YhN2szE8rR8_000053_000063.mp4", "caption": "a young boy is blowing air through a balloon, he then releases the air", "counterfactual": "a young boy releases the air from a balloon, he then blows air through it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "VF5iKfuVP68_000000_000010.mp4", "caption": "a child takes a playing card and throws it at a candle", "counterfactual": "a child throws a playing card at a candle and takes it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "JEG0Rlqcr64_000043_000053.mp4", "caption": "a man shrieks \"i have a belly button\" several times", "counterfactual": "a man shrieks \"i have a belly button\" once", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "2AVty18KSp0_000180_000190.mp4", "caption": "a person completes a lego plane then he moves it about to show it a different angles then he sets it down", "counterfactual": "a person sets down a lego plane then he completes it about to show it a different angles then he moves it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "wIRqb4rwRkQ_000000_000010.mp4", "caption": "a man tells how people commentate with there eye brows when talking", "counterfactual": "a man tells how people commentate with their eyebrows before talking", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "4DVx18w-rmk_000038_000048.mp4", "caption": "a little boy is holding a playing card and then starts throwing it as a trick", "counterfactual": "a little boy starts throwing a playing card as a trick and then holds it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "8NyxkE-Vtws_000023_000033.mp4", "caption": "a lady in the field catches a ball with a mitt and throws it", "counterfactual": "a lady in the field throws a ball and catches it with a mitt", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "oyd9k4W5lUw_000007_000017.mp4", "caption": "a man is speaking to an audience and the camera pans from him to the crowd and back to him", "counterfactual": "a man is speaking to an audience and the camera pans from the crowd to him and back to the crowd", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "wmMYDbtqVP0_000050_000060.mp4", "caption": "a girl put something on her forehead and then brushes it on with some kind of brush", "counterfactual": "a girl brushes something on her forehead and then puts it on with some kind of brush", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "_Go9v9lg4Ic_000005_000015.mp4", "caption": "a person uses a drumstick to hit a cymbal a few times slowly, then quickly a few times", "counterfactual": "a person uses a drumstick to hit a cymbal a few times quickly, then slowly a few times", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "IFl8xnZ70oU_000055_000065.mp4", "caption": "a person shuffles a deck of playing cards, then sets them down", "counterfactual": "a person sets down a deck of playing cards, then shuffles them", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "89kpJOg07WI_000028_000038.mp4", "caption": "at a table someone cuts a deck of cards in half then someone else grabs the cards", "counterfactual": "at a table someone grabs the cards then someone else cuts a deck of cards in half", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "_ydyeF4CRb8_000000_000010.mp4", "caption": "two boys in black shirts are spinning around a room until one crashes into the couch", "counterfactual": "two boys in black shirts are spinning around a room until they both crash into the couch", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "RadfPQjOJTs_000791_000801.mp4", "caption": "a woman is moving her christmas tree around before moving to look at it", "counterfactual": "a woman is looking at her christmas tree before moving it around", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "MgSNvlS2d3A_000126_000136.mp4", "caption": "a wax strip is being rubbed on a man's leg and then ripped off", "counterfactual": "a wax strip is ripped off a man's leg and then rubbed on", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "jo2_g8Bua1Q_000042_000052.mp4", "caption": "a cloth is covered in maroon colouring before it is picked up and scrunched up", "counterfactual": "a cloth is picked up and scrunched up before it is covered in maroon colouring", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "hbJwAPadu9M_000095_000105.mp4", "caption": "a person swirls oil around in a small pot before they whip and add eggs to the pot", "counterfactual": "a person whips and adds eggs to a small pot before they swirl oil around in the pot", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "bKjBf782q9c_000052_000062.mp4", "caption": "someone is measuring paper in a drawer of some kind and then is cutting it", "counterfactual": "someone is cutting paper in a drawer of some kind and then is measuring it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "P6j1ib4tLaE_000017_000027.mp4", "caption": "a man carefully washed the foot of a young adult male and then kissed it", "counterfactual": "a man kissed the foot of a young adult male and then carefully washed it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "D2nnRhNP6GY_000000_000010.mp4", "caption": "a man is quickly juggling four balls in the air, then catches them", "counterfactual": "a man catches four balls in the air, then quickly starts juggling them", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "odik0dRjdxk_000013_000023.mp4", "caption": "a young archer at a shooting gallery is preparing his bow before he aims and fires at the target", "counterfactual": "a young archer at a shooting gallery is aiming and firing at the target before he prepares his bow", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "0KYhxX1V8io_000035_000045.mp4", "caption": "a man kneels in a stream panning for gold, stands, then slips on a wet rock", "counterfactual": "a man stands in a stream panning for gold, kneels, then slips on a wet rock", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "058y9xGmmTQ_000206_000216.mp4", "caption": "a bald man is eating something and coughing while others are laughing and clapping", "counterfactual": "a bald man is coughing while others are laughing and clapping, and then he starts eating something", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "7rPXR4duVqE_000000_000010.mp4", "caption": "a bald man swigs alcohol, then lights it as he spits it out", "counterfactual": "a bald man spits out alcohol, then swigs it as he lights it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "w3sEsKHCUPU_000009_000019.mp4", "caption": "a boy stand and juggles with three balls, then continues to juggle as he kneels down and stands again", "counterfactual": "a boy kneels down and stands, then continues to juggle with three balls as he stands and kneels down again", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "PKf3raAti9M_000013_000023.mp4", "caption": "a couple are dancing outdoors, where they then take off running away", "counterfactual": "a couple take off running away outdoors, where they then start dancing", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "E42pQvtXGr0_000017_000027.mp4", "caption": "four people standing in a kitchen, a woman takes something from the counter to the stove", "counterfactual": "four people standing in a kitchen, a woman takes something from the stove to the counter", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "P0A8u_yeNdo_000042_000052.mp4", "caption": "a person is showing a part of a toy box then attaching it to the toy", "counterfactual": "a person is attaching a part of a toy box to the toy, then showing it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "3a9yKjC2tNw_000005_000015.mp4", "caption": "a man lied on a skateboard as it moved forward and then stood up on it", "counterfactual": "a man stood up on a skateboard as it moved forward and then lied on it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "P0EeH3bXbRo_000104_000114.mp4", "caption": "a guy shows his custom trike motorcycle and then drives it out onto the highway", "counterfactual": "a guy drives his custom trike motorcycle out onto the highway and then shows it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "oEXu-xMebvY_000078_000088.mp4", "caption": "a person is using two pens to make a beat on the table", "counterfactual": "a person is using a pen to make a beat on the table and then switches to using two pens", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "FMXiq6jSl7U_000013_000023.mp4", "caption": "a woman moves herself from her wheel chair to her customized sofa", "counterfactual": "a woman moves herself from her customized sofa to her wheel chair", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "0HEi6q3bGaw_000011_000021.mp4", "caption": "someone is talking to their friends before they take off on their snowmobiles", "counterfactual": "someone takes off on their snowmobiles before they talk to their friends", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "pTShlQCjjZI_000000_000010.mp4", "caption": "a young woman struggles to want to drink a shot of alcohol then he drinks it and covers her face", "counterfactual": "a young woman covers her face, struggles to want to drink a shot of alcohol, and then she drinks it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "L5Mp4_pwiK8_000000_000010.mp4", "caption": "a cricket player misses a ball, and someone catches and throws the ball", "counterfactual": "a cricket player catches and throws the ball, and someone misses the ball", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "NxIUWtcE4jE_000004_000014.mp4", "caption": "two people are shaking hands and then one man is throwing a rock into the river followed by another one", "counterfactual": "two people are throwing rocks into the river and then one man is shaking hands followed by another one", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "iT4p5yYblbA_000032_000042.mp4", "caption": "a person is swallowing a sword and the audience claps and cheers, then the person brings the sword back out", "counterfactual": "a person brings the sword back out and the audience claps and cheers, then the person is swallowing a sword", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "a_rGCA-vxNU_000018_000028.mp4", "caption": "a man pours water over a dog, then shampoo", "counterfactual": "a man pours shampoo over a dog, then water", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "WHAEDr-9PBk_000000_000010.mp4", "caption": "a segway is being ridden up an incline where it is then turned around to start down some stairs", "counterfactual": "a segway is being ridden down some stairs where it is then turned around to start up an incline", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "FKp3AjLsM8A_000079_000089.mp4", "caption": "a woman sits in front of a toilet and makes jokes before she cleans it", "counterfactual": "a woman cleans a toilet before she sits in front of it and makes jokes", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "rPKXxFIF8s4_000237_000247.mp4", "caption": "a woman in a lab looks into a microscope before turning to the camera", "counterfactual": "a woman in a lab turns to the camera before looking into a microscope", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "ioCn2rlF7UE_000089_000099.mp4", "caption": "a man adds water to his bouquet before he starts to put in the orchids", "counterfactual": "a man starts to put in the orchids before he adds water to his bouquet", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "7gVRjb-UxZk_000040_000050.mp4", "caption": "a woman is scooping various food items from bowls into one bowl", "counterfactual": "a woman is scooping one food item from various bowls into one bowl", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "V1xmfGJ9K5c_000021_000031.mp4", "caption": "a person sits in a tent then the tent is shown in a snowy field and the man is shown again", "counterfactual": "a person is shown in a snowy field, then the tent is shown and the man sits in it again", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "J4YjMOdSx9g_000008_000018.mp4", "caption": "a man pulls a long sword out of his mouth, walks over and wipes the sword off with a rag and then sheaths the sword", "counterfactual": "a man sheaths the sword, walks over and wipes the sword off with a rag, and then pulls a long sword out of his mouth", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "uGSB6vyepfc_000022_000032.mp4", "caption": "a woman gives a man a hair wash and haircut before he shows the results to a camera", "counterfactual": "a woman shows the results to a camera before giving a man a hair wash and haircut", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "kRdcVBYwu5U_000027_000037.mp4", "caption": "a little girl squeezed a steel cup in her hand and bent it", "counterfactual": "a little girl bent a steel cup in her hand and squeezed it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "eBTYOQQeZWA_000000_000010.mp4", "caption": "a fully dressed man in a jacket picks up a very heavy weight then puts it down", "counterfactual": "a fully dressed man in a jacket puts down a very heavy weight then picks it up", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "IqnW48s48DQ_000000_000010.mp4", "caption": "a baby crawls before sitting in the middle of a doorway, watching people go by", "counterfactual": "a baby sits in the middle of a doorway before crawling, watching people go by", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "RoXiwtbquGk_000068_000078.mp4", "caption": "a bulldozer pulls a tree upright that was previously lying down, then pushes it back down again", "counterfactual": "a bulldozer pushes a tree down, then pulls it upright that was previously lying down again", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "NQshaPQUU4g_000074_000084.mp4", "caption": "a hand pours corn into a pan and then pours in peas with it", "counterfactual": "a hand pours peas into a pan and then pours in corn with it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "lX4U73eF_yA_000042_000052.mp4", "caption": "different men are lying bricks to build walls then a female starts to talk about how to lay bricks properly", "counterfactual": "different men start to talk about how to lay bricks properly then a female starts lying bricks to build walls", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "LjN5FaJgfFY_000002_000012.mp4", "caption": "a young man throws an inhaler to another young man who then uses it", "counterfactual": "a young man uses an inhaler and then throws it to another young man", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "9kwn70duWiQ_000044_000054.mp4", "caption": "a girl and a boy are pretending to be robots and they both move from the floor to standing", "counterfactual": "a boy and a girl are pretending to be robots and they both move from standing to the floor", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "0NezYkEdfMQ_000016_000026.mp4", "caption": "a woman demonstrates how to fold items before putting them in a dresser", "counterfactual": "a woman puts items in a dresser before demonstrating how to fold them", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "20Wlga1naNg_000067_000077.mp4", "caption": "a boy is demonstrating how to juggle starting with just one baseball and than moves to two", "counterfactual": "a boy is demonstrating how to juggle starting with two baseballs and then moves to just one", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "YhN2szE8rR8_000053_000063.mp4", "caption": "a young boy blows into a balloon before letting the air out", "counterfactual": "a young boy lets the air out of a balloon before blowing into it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "1w9uJD2KvQ0_000348_000358.mp4", "caption": "a woman is standing by a bed folding clothes to packs", "counterfactual": "a woman is standing by a bed packs clothes to folding", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "kDzJrWyOwmc_000023_000033.mp4", "caption": "factory workers work on shoes before placing the shoes in a machine", "counterfactual": "factory workers place the shoes in a machine before working on the shoes", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "RcN2fdjdoE0_000000_000010.mp4", "caption": "a woman is blowing smoke out of both of her nostrils", "counterfactual": "a woman is blowing smoke out of one nostril and then the other", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "QJkpPoCxXqQ_000021_000031.mp4", "caption": "while inside of a room in a house, a woman talks and laughs before a man, who talks quickly and tackles another man", "counterfactual": "while inside of a room in a house, a woman talks and laughs after a man, who talks quickly and tackles another man", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "ZeCnXIB60RM_000030_000040.mp4", "caption": "a man with a large blond mohawk carries his skis up a hill, before skiing down", "counterfactual": "a man with a large blond mohawk skis down a hill, before carrying his skis up", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "S38zmlYcmyY_000000_000010.mp4", "caption": "a little girl does a cartwheel forwards and then backwards", "counterfactual": "a little girl does a cartwheel backwards and then forwards", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "7Eoaj1HBv28_000418_000428.mp4", "caption": "a woman is using a mascara brush to fix her eye lashes before she looks at the camera", "counterfactual": "a woman looks at the camera before she uses a mascara brush to fix her eye lashes", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "A3hAB6x0VBE_000000_000010.mp4", "caption": "the introduction screen for a video tutorial on adjusting eye wear (specifically the nose pads) plays before the video demonstration begins", "counterfactual": "the video demonstration begins before the introduction screen for a video tutorial on adjusting eye wear (specifically the nose pads) plays", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "k0euT5ZLKBM_000042_000052.mp4", "caption": "a women is drawing on a pumpkin then continues to carve", "counterfactual": "a women continues to carve a pumpkin then starts drawing on it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "f328tOrLsdo_000014_000024.mp4", "caption": "the man, dressed in costume throws the axe then the woman will take her turn", "counterfactual": "the man, dressed in costume takes his turn then throws the axe, followed by the woman", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "C29kvQkzadQ_000017_000027.mp4", "caption": "a man wearing a t-shirt is lifting two dumbbells up and then down", "counterfactual": "a man wearing a t-shirt is lifting two dumbbells down and then up", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "W06knkbj310_000130_000140.mp4", "caption": "a man plays the bagpipes near a microphone and then stops", "counterfactual": "a man stops playing the bagpipes near a microphone and then starts", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "t9mTLNGHTSY_000000_000010.mp4", "caption": "a young man is running to get speed just before doing a long jump", "counterfactual": "a young man is doing a long jump just before running to get speed", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "rjv8GzaSFgQ_000010_000020.mp4", "caption": "a man holds a whisk and then attaches it to a cordless drill", "counterfactual": "a man attaches a whisk to a cordless drill and then holds it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "XF29Mwf7Yys_000041_000051.mp4", "caption": "a man in a restaurant takes off his jacket before eating", "counterfactual": "a man in a restaurant eats before taking off his jacket", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "b5YUpGYiyKs_000003_000013.mp4", "caption": "a man is shoveling off his driveway after a heavy snow", "counterfactual": "a man is shoveling off his driveway before a heavy snow", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "7GaSbJcbrTQ_000014_000024.mp4", "caption": "a girl jumps up and down on a trampoline, before laying down on it", "counterfactual": "a girl lays down on a trampoline before jumping up and down on it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "6gAwIar7xDA_000006_000016.mp4", "caption": "a horse rider is trotting through the countryside before the horse gains speed", "counterfactual": "a horse rider gains speed before trotting through the countryside", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "5L6dT8pjhTs_000048_000058.mp4", "caption": "a woman falls off a bike, then rides a bike without falling", "counterfactual": "a woman rides a bike without falling, then falls off a bike", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "V0FvmFkqQKM_000030_000040.mp4", "caption": "a small baby inside a room, takes a ball and then throws it away", "counterfactual": "a small baby inside a room, throws a ball and then takes it back", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "PCDLlZt5Ckc_000130_000140.mp4", "caption": "lines are painted on a woman's painted nail and then brushed with clear polish", "counterfactual": "lines are brushed with clear polish on a woman's painted nail and then painted", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "vHBd1JAC_fE_000064_000074.mp4", "caption": "a young person drinks a beverage from a small cup and then throws the cup", "counterfactual": "a young person throws the cup and then drinks a beverage from a small cup", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "hgN5kxYwT_w_000000_000010.mp4", "caption": "a young boy finishes looking into a microscope and then stands up and walks a few steps", "counterfactual": "a young boy stands up and walks a few steps before finishing looking into a microscope", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "rLcVRXglEU0_000006_000016.mp4", "caption": "a woman stared at something and then winked at it", "counterfactual": "a woman winked at something and then stared at it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "hmRfB4ubBZM_000000_000010.mp4", "caption": "a person drills a hole into a melon and then puts a straw into it", "counterfactual": "a person puts a straw into a melon and then drills a hole into it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "EEMcAHWRTHU_000048_000058.mp4", "caption": "a tracker is shoveling snow into the truck that is following beside it", "counterfactual": "a tracker is following beside the truck that is shoveling snow into it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "8LaSGw_PRwI_000011_000021.mp4", "caption": "a baby plays around with a canteen just before taking a sip from it", "counterfactual": "a baby takes a sip from a canteen just before playing around with it", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "GDbDDkJyVKs_000023_000033.mp4", "caption": "a man on a bridge puts his head on the bridge before photos of his family are shown", "counterfactual": "a man on a bridge shows photos of his family before putting his head on the bridge", "aspect": "Sequence"}
{"src_dataset": "VATEX", "video_name": "2-ujw4m8-kA_000002_000012.mp4", "caption": "a man picks up a piece of wood, examines it, then returns it to the electric circular saw on a work bench", "counterfactual": "a man picks up a piece of wood on a work bench, returns it to the electric circular saw, then examines it", "aspect": "Sequence"}
