{"src_dataset": "VATEX", "video_name": "XnuUuUq-DYE_000058_000068.mp4", "caption": "A child chews loudly and without manners while eating chips.", "counterfactual": "A child chews politely and without much noise while eating chips.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "BxKLO_y8gBU_000077_000087.mp4", "caption": "A baby is being very messy while drinking juice at the table.", "counterfactual": "A baby is being very tidy while drinking juice at the table.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8X5jweazjJA_000000_000010.mp4", "caption": "A guy standing up outside ona field then he suddenly does a back flip", "counterfactual": "A guy standing up outside ona field then he slowly does a back flip", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "HxY32wNVydo_000051_000061.mp4", "caption": "A young man plays the flute and makes a brief comment.", "counterfactual": "A young man plays the flute and makes a long comment.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "svuaRfbvhWk_000000_000010.mp4", "caption": "A young guy painting the floor with a roller with ease", "counterfactual": "A young guy painting the floor with a roller with much effort", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wcMVNGauxks_000014_000024.mp4", "caption": "A person wearing a costume and a skull face mask is shaking their head vigorously.", "counterfactual": "A person wearing a costume and a skull face mask is shaking their head slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FtBS6OZSGMI_000028_000038.mp4", "caption": "Someone is pouring a drink from a bottle into a wine glass using a lot of care.", "counterfactual": "Someone is pouring a drink from a bottle into a wine glass using a lot of force.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "gqUIuaCUgCk_000055_000065.mp4", "caption": "A man is seen using a kayak in a calm section of river near a bridge.", "counterfactual": "A man is seen using a kayak in a river flowing rapidly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "71kmPW5MOZc_000049_000059.mp4", "caption": "A man is struggling to use a contraption to remove the core of a pineapple.", "counterfactual": "A man uses a contraption to remove the core of a pineapple with relative ease.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "h2PLauUMFpQ_000756_000766.mp4", "caption": "A man quickly cleans and polishes some leather shoes with commentary.", "counterfactual": "A man slowly cleans and polishes some leather shoes with commentary.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5jS7QxyiCcU_000001_000011.mp4", "caption": "A person is wakeboarding on a lake whlie being pulled by a quickly moving boat", "counterfactual": "A person is wakeboarding on a lake slowly while being pulled by a slowly moving boat", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "t0YEd74kWr0_000124_000134.mp4", "caption": "A baby is very messily eating a cake and getting it everywhere.", "counterfactual": "A baby is very cleanly eating a cake and getting it everywhere.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CC_bY6HrrKo_000000_000010.mp4", "caption": "People walk across a large field of sand in a line.", "counterfactual": "People walk across a large field of sand in a random fashion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "VF5iKfuVP68_000000_000010.mp4", "caption": "In a kitchen, a boy unsuccessfully tries to cut a candle by throwing a playing card at it.", "counterfactual": "In a kitchen, a boy successfully tries to cut a candle by throwing a playing card at it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "jrSl1_zUzv0_000036_000046.mp4", "caption": "a man slowly lowers his hand into a pond and grabs a big fish.", "counterfactual": "a man quickly lowers his hand into a pond and grabs a big fish.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8zaLOaq_2Ug_000000_000010.mp4", "caption": "An old man is doing a very slow jog, moving his arms up and down as he runs.", "counterfactual": "An old man is doing a very fast walk, moving his arms up and down as he walks.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2dwrPm8txvw_000004_000014.mp4", "caption": "A cricket player runs to a quick halt in a compilation of clips.", "counterfactual": "A cricket player runs to a slow halt in a compilation of clips.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2-cHlF42lek_000029_000039.mp4", "caption": "A young man is throwing an ax into a tree in slow motion.", "counterfactual": "A young man is throwing an ax into a tree in normal speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "VgUmznyjL-o_000000_000010.mp4", "caption": "A teen boy is startled as another young boy quietly opens the door to his room and makes a loud noise.", "counterfactual": "A teen boy is startled as another young boy quietly opens the door to his room and makes a quiet noise.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9cMLd-7Yj3w_000006_000016.mp4", "caption": "Two doors slowly open and reveal a man in a white tank top and black hair.", "counterfactual": "Two doors quickly open and reveal a man in a white tank top and black hair.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "f35RCNy7EHs_000000_000010.mp4", "caption": "A man is using his left foot to quickly and continuously press a kick pedal with colorful circles attached to it.", "counterfactual": "A man is using his left foot to slowly and continuously press a kick pedal with colorful circles attached to it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9PiozWZtilo_000016_000026.mp4", "caption": "A woman falls off the diving board into flat into the swimming pool.", "counterfactual": "A woman is carefully stepping off the diving board into flat into the swimming pool.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "j41tqfbwWUY_000000_000010.mp4", "caption": "A man in a grey hoodie sharpens knives by rapidly rubbing them against each other.", "counterfactual": "A man in a grey hoodie carefully sharpens knives by rubbing them against each other.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "cHIGg3o4jX4_000002_000012.mp4", "caption": "A man runs up and jumps into an open dumpster.", "counterfactual": "A man walks slowly up and jumps into an open dumpster.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "EK00SRG9JW0_000007_000017.mp4", "caption": "A man lying on a longboard travels quickly down a hill while an onlooker laughs", "counterfactual": "A man lying on a longboard travels slowly down a hill while an onlooker laughs", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0TqSc_DMLKQ_000180_000190.mp4", "caption": "A person uses a knife to cut the rind off of a pineapple in a specific pattern.", "counterfactual": "A person uses a knife to cut the rind off of a pineapple in a random pattern.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "M6ykllLdpQA_000019_000029.mp4", "caption": "A young baby dances by shaking their head wildly, then leans forward.", "counterfactual": "A young baby dances by shaking their head slowly, then leans forward.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "SbyJes4lXLE_000007_000017.mp4", "caption": "Three men monitor as large printing machines are working quickly.", "counterfactual": "Three men monitor as large printing machines are working slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "NxIUWtcE4jE_000004_000014.mp4", "caption": "Several guys are shown skipping rocks over water  right after each other.", "counterfactual": "Several guys are shown skipping rocks over water at different times.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "QD_7zTlW5LU_000000_000010.mp4", "caption": "A young boy climbs up onto the diving board and comfortably jumps in.", "counterfactual": "A young boy climbs up onto the diving board and barely jumps in.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "A4ScOLc3kDk_000051_000061.mp4", "caption": "A man is shown sneezing twice aggressively and loudly at the intro to a film.", "counterfactual": "A man is shown sneezing twice shyly and gently at the intro to a film.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9LYqBnMOfRs_000000_000010.mp4", "caption": "A person in a wheelchair is being pushed very rapidly down a street by two people.", "counterfactual": "A person in a wheelchair is being pushed very slowly down a street by two people.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "sKdnnChIsNY_000015_000025.mp4", "caption": "A fireman climbs the fire truck's ladder very slowly while another fireman watches.", "counterfactual": "A fireman runs up the fire truck's ladder very quickly while another fireman watches.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2Sbe-4PtTy4_000047_000057.mp4", "caption": "A video showing how a machine attaches a cover to other pages of a book perfectly.", "counterfactual": "A video showing how a machine attaches a cover to other pages of a book imperfectly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "n3oedFeDXQA_000056_000066.mp4", "caption": "A boy is indoors and climbing a rope ladder with encouragement.", "counterfactual": "A boy is indoors and climbing a rope ladder in an agitated manner.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "VbQBUIxNE4Y_000030_000040.mp4", "caption": "A young woman nervously attempts a pole vault before an interested audience.", "counterfactual": "A young woman confidently performs a pole vault before an interested audience.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "i-3KZaTDuWg_000000_000010.mp4", "caption": "A person hugs another person while patting their back in slow motion.", "counterfactual": "A person is hugging another person while patting their back in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "yaUfx_tWHNs_000000_000010.mp4", "caption": "a baby with bibs on is gently shaking his head sideways.", "counterfactual": "a baby with bibs on is wildly shaking his head side to side.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "YcBw2Zk3JNA_000021_000031.mp4", "caption": "Children attempting to play hockey on an ice rink but falling down rapidly.", "counterfactual": "Children attempting to play hockey on an ice rink, however they are skating rather rapidly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "DzYCGinZNzU_000000_000010.mp4", "caption": "Two men wind a large metal spring in a kitchen at high speed using time lapse.", "counterfactual": "Two men wind a large metal spring in a kitchen at low speed using slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7s1oCiXTpek_000000_000010.mp4", "caption": "A child is holding a pen incorrectly as they attempt to write on a piece of paper.", "counterfactual": "A child is holding a pen correctly as they attempt to write on a piece of paper.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Y8iM5-EwRUI_000034_000044.mp4", "caption": "A young blonde girl, walking around inside a jump house, talking very quickly.", "counterfactual": "A young blonde girl, walking around inside a jump house, speaking slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "WeMpnxtS0Sw_000057_000067.mp4", "caption": "A person removes mushrooms from a pot and chops them very quickly.", "counterfactual": "A person removes mushrooms from a pot and chops them very slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "NJw3u6geleU_000170_000180.mp4", "caption": "In fast motion a man is painting a design on a board with spray paint.", "counterfactual": "In slow motion a man is painting a design on a board with spray paint.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "bHVla4xDpNM_000039_000049.mp4", "caption": "A young boy plays saxophone with a serious look on his face.", "counterfactual": "A young boy plays saxophone with a happy look on his face.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "T8fXPNh7u_M_000000_000010.mp4", "caption": "A woman is quietly performing an open-leg variation of situps.", "counterfactual": "A woman is loudly performing an open-leg variation of situps.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9bqoTBEWHSo_000000_000010.mp4", "caption": "A woman and a boy do a coordinated dance as people talk in the background.", "counterfactual": "A woman and a boy do a spontaneous dance as people talk in the background.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "SA6UA9WHZgU_000002_000012.mp4", "caption": "A person is rapidly hitting a drum foot pedal that has three colorful little balls attached to it.", "counterfactual": "A person is slowly hitting a drum foot pedal that has three colorful little balls attached to it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "c_gQ9CSaZY4_000000_000010.mp4", "caption": "in fast motion, a person sorts some folded clothes in piles on the floor", "counterfactual": "in slow motion, a person sorts some folded clothes in piles on the floor", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "T_HXAfZDKdE_000000_000010.mp4", "caption": "A man records himself then slowly pans to his dirty computer desk with his keyboard", "counterfactual": "A man records himself then quickly pans to his dirty computer desk with his keyboard", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2OFfh8Q-AZo_000016_000026.mp4", "caption": "A person is playing disc golf and carefully flings the disc into the trees.", "counterfactual": "A person is playing disc golf and forcefully flings the disc into the trees.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "AmtRYx5JEZk_000000_000010.mp4", "caption": "A young boy attempts to use monkey bars at a playground but falls in pain.", "counterfactual": "A young boy successfully uses monkey bars at a playground and does not fall in pain.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "jkY4fSIciGE_000016_000026.mp4", "caption": "A person is sharpening a pencil while gently twisting the pencil.", "counterfactual": "A person is sharpening a pencil while aggressively twisting the pencil.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5itHnZhjeg0_000092_000102.mp4", "caption": "A man makes exaggerated movements while recording in a vocal booth.", "counterfactual": "A man makes a simple head movement while recording in a vocal booth.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "OOxphqMuui8_000011_000021.mp4", "caption": "A man is spreading ingredients onto a flat round wrap and rolling the wrap tightly.", "counterfactual": "A man is spreading ingredients onto a flat round wrap and rolling the wrap loosely.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pDri2cRQicM_000082_000092.mp4", "caption": "A little girl sitting at a table with a pumpkin actively working on carving a Jack-0-Lantern.", "counterfactual": "A little girl sits at a table with a pumpkin passively working on carving a jack-0-lantern.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "j8_AbSXsAiw_000139_000149.mp4", "caption": "A person is adding wet clothes to a dryer one by one.", "counterfactual": "A person is adding wet clothes to a dryer all at once.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2MBgEM5mHms_000000_000010.mp4", "caption": "A man with long hair plays a guitar at a fast pace.", "counterfactual": "A man with long hair plays a guitar at a slow pace.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "jarlN4U07Jw_000058_000068.mp4", "caption": "A man is holding a baby near a cake with a candle then the man leans the baby in and blows the candle out causing a woman to yell in happiness.", "counterfactual": "A man is holding a baby near a cake with a candle then the man leans the baby in and blows the candle out causing a woman to yell in anger.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "UgEAu_Ld9D8_000052_000062.mp4", "caption": "A woman rides a slow mechanical bull outside and a man asks her if she is ready.", "counterfactual": "A woman rides a fast mechanical bull outside and a man asks her if she is ready.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9rZnxQ4A5k4_000379_000389.mp4", "caption": "A woman in a skirt trying to skateboard and then a boy skateboarding quickly.", "counterfactual": "A woman in a skirt trying to skateboard and then a boy skateboarding slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ACsoDklrrQk_000083_000093.mp4", "caption": "Snowboarder holding a camera while they quickly go down a snowy mountainside.", "counterfactual": "Snowboarder holding a camera while they slowly go down a snowy mountainside.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4lKFCmm2ogE_000030_000040.mp4", "caption": "A man is playing a gentle melody on his stringed musical instrument.", "counterfactual": "A man is playing a loud and abrasive melody on his stringed musical instrument.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qQrtdNKiETI_000000_000010.mp4", "caption": "In a field in a park, a man throws a Frisbee a far distance.", "counterfactual": "In a field in a park, a man throws a frisbee a short distance.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GhBWH6spLNY_000164_000174.mp4", "caption": "A man uses an electric beard trimmer to shape his beard a little bit.", "counterfactual": "A man uses an electric beard trimmer to shape his beard completely.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8i_urmf0PM8_000163_000173.mp4", "caption": "A black woman is waxing her right eyebrow and pulls the tape off very quickly.", "counterfactual": "A black woman is waxing her right eyebrow and pulls the tape off very slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "vciTh3A0TaM_000007_000017.mp4", "caption": "A group of individuals run at high speed on an airport tarmac and one of them falls down.", "counterfactual": "A group of individuals run at a slow speed on an airport tarmac and one of them trips.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Ei3m22i9foo_000136_000146.mp4", "caption": "A man prepares and hits a golf ball, he uses light force during the swing.", "counterfactual": "A man prepares and hits a golf ball, he uses heavy force during the swing.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "sKdnnChIsNY_000015_000025.mp4", "caption": "A fully dressed firefighter slowly climbs a rescue ladder straight up.", "counterfactual": "A fully dressed firefighter quickly climbs a rescue ladder straight up.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9Kt6FIFQrTM_000009_000019.mp4", "caption": "A person is skiing down a ski course zigzagging as snow behind him gets kicked up.", "counterfactual": "A person is skiing down a ski course going straight as snow behind him gets kicked up.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "6GMwAeVcJCg_000183_000193.mp4", "caption": "A fast speed motion of a person wrapping up a package and tapping it.", "counterfactual": "A slow motion motion of a person wrapping up a package and tapping it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ogxFwKU27fE_000039_000049.mp4", "caption": "someone is building a snow man in fast motion in their back yard", "counterfactual": "someone is building a snow man in slow motion in their back yard", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "f-VgSfXcl2A_000091_000101.mp4", "caption": "Group of young people cautiously playing a game of dodgeball in a gym.", "counterfactual": "Group of young people are violently playing a game of dodgeball in a gym.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Ud5PyCQHW3U_000009_000019.mp4", "caption": "A newswoman excitedly announces the results of the previous day's game.", "counterfactual": "A newswoman depressedly announces the results of the previous day's game.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "h2qwgmlw3bg_000000_000010.mp4", "caption": "A young guy is eating corn on the cob and a hamburger in quick motion.", "counterfactual": "A young guy is eating corn on the cob in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wMZ881L_XzQ_000004_000014.mp4", "caption": "In a gym a man is standing and slowly lowers down a dumbbell with weights on it.", "counterfactual": "In a gym a man is standing and suddenly raises up a dumbbell with weights on it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "g63r5yW3WJY_000015_000025.mp4", "caption": "Young boy flying in the air on a snowboard and mistakenly landing on top of a dog.", "counterfactual": "Young boy flying in the air on a snowboard and purposefully landing on top of a dog.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qzFxIGRVrto_000017_000027.mp4", "caption": "Children are playing and milling around in a snow covered field as the adult mumbles.", "counterfactual": "Children are playing and milling around in a snow covered field as the adult speaks clearly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "j5pghUWZBuc_000093_000103.mp4", "caption": "A man folds a white napkin very quickly into an artistic shape as part of a competition.", "counterfactual": "A man folds a white napkin very slowly into an artistic shape as part of a competition.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "xfqst3Ql8cc_000009_000019.mp4", "caption": "A group of people are parasailing on a boat while the boat travels on the ocean at a high speed.", "counterfactual": "A group of people are parasailing on a boat while the boat travels on the ocean at a low speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "w1bG4NHIlJM_000024_000034.mp4", "caption": "White sheets are removed from a bed in slow motion.", "counterfactual": "White sheets are removed from a bed in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9k3JNTvU98M_000038_000048.mp4", "caption": "A person swings high in the air on a trapeeze swing.", "counterfactual": "A person swings low in the air on a trapeeze swing.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0t0DB1B1w8Y_000000_000010.mp4", "caption": "A woman expertly demonstrates how she jumps over every hurdle and makes it from the platform to the mat.", "counterfactual": "A woman expertly demonstrates how she fails to jump over every hurdle and makes it from the platform to the mat.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "kgHoKUZWKCs_000026_000036.mp4", "caption": "A female track and field athlete is performing a long jump in slow motion", "counterfactual": "A female track and field athlete is performing a long jump in fast motion", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CnHKmtkBBs8_000003_000013.mp4", "caption": "A man unsuccessfully tries several times to blow out trick candles.", "counterfactual": "A man successfully blows out trick candles.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "NcGD74_4G8E_000079_000089.mp4", "caption": "A man walks on a tightrope that is hung low between tree trunks.", "counterfactual": "A man walks on a tightrope that is hanging high between tree trunks.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "fwQlgilshuA_000003_000013.mp4", "caption": "A woman slowly pushes a newspaper around on a machine while watching the monitor.", "counterfactual": "A woman quickly pushes a newspaper around on a machine while watching the monitor.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "u4eXGXXeoxo_000082_000092.mp4", "caption": "A man is running on a treadmill but the video is moving is moving in slow motion.", "counterfactual": "A man is running on a treadmill but the video is moving in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ba2SS4b70vA_000012_000022.mp4", "caption": "A man with a knitted hat skips a rock a long distance.", "counterfactual": "A man with a knitted hat skips a rock a short distance.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "3ktfC-kTRQI_000000_000010.mp4", "caption": "A bartender showing his skills, dangerously spinning 2 burning bottles.", "counterfactual": "A bartender showing his skills, safely spinning 2 burning bottles.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "w6foWnwvreY_000160_000170.mp4", "caption": "A man and a lady are dancing together on top of a wooden floor.", "counterfactual": "A man and a lady are dancing separately on top of a wooden floor.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "svuaRfbvhWk_000000_000010.mp4", "caption": "A boy is rolling a paint roller on the ground as another person is sarcastically making fun of him.", "counterfactual": "A boy is rolling a paint roller on the ground as another person is genuinely making fun of him.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "IMVVld0T7ZY_000114_000124.mp4", "caption": "A few men are seen standing by a fast-moving stream of water while holding rope.", "counterfactual": "A few men are seen standing by a slow-moving stream of water while holding rope.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "me0BZU5mQ7g_000003_000013.mp4", "caption": "Man holding himself up on a rope and then rapidly climbing it at a gym.", "counterfactual": "Man holding himself up on a rope and then slowly climbing it at a gym.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ad8VP_08yLw_000000_000010.mp4", "caption": "A boy beats the drums and cymbals at an irregular pace", "counterfactual": "A boy taps the drums and cymbals at a regular pace", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "02HAfW8otDE_000000_000010.mp4", "caption": "A man in slow motion as he runs and tries to jump over a hurdle with a long stick", "counterfactual": "A man in fast motion as he runs and jumps over a hurdle with a long stick", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-sy1k5p1Jfg_000051_000061.mp4", "caption": "A group of people slowly stomp a big container of grapes.", "counterfactual": "A group of people rapidly stomp a big container of grapes.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FeTmPET58LA_000000_000010.mp4", "caption": "A little boy in a bucket hat slowly walks across the tight ropes at a playground.", "counterfactual": "A little boy in a bucket hat quickly walks across the tight ropes at a playground.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Zpb1kjnrbKc_001303_001313.mp4", "caption": "A group of people walking by holding a rail as they slowly walk inwards a cave", "counterfactual": "A group of people walking by holding a rail as they quickly walk outwards a cave", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GU5qoLNriY4_000000_000010.mp4", "caption": "A person is swinging a gong item and rapidly hits it with a tool", "counterfactual": "A person is swinging a gong item and slowly hits it with a tool", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_f_LhZafBEs_000041_000051.mp4", "caption": "A person pouring an egg white into a green bowl directly from the egg.", "counterfactual": "A person pouring an egg white into a green bowl indirectly from the egg.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "DauHQApK4po_000023_000033.mp4", "caption": "In front of a group of friends, a young gentlemen stomps and breaks something.", "counterfactual": "In front of a group of friends, a young gentlemen calmly steps and breaks something.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "rDDXpIIy0rQ_000032_000042.mp4", "caption": "A horse rider  successfully roping a steer in a rodeo contest,", "counterfactual": "A horse rider unsuccessfully roping a steer in a rodeo contest", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "N8ZN0L22d10_000000_000010.mp4", "caption": "Person riding a snowmobile speeding towards a bump and jumping over it.", "counterfactual": "Person riding a snowmobile slowing down towards a bump and jumping over it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "06ydvG0KMdc_000002_000012.mp4", "caption": "An attractive young woman really works up some lather as she demonstrates three push ups.", "counterfactual": "An attractive young woman really takes it easy as she demonstrates three push ups.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2Y7Z2Eb7B-g_000000_000010.mp4", "caption": "A boy pushes a girl in a wheelchair quickly down the aisle of a supermarket", "counterfactual": "A boy pushes a girl in a wheelchair slowly down the aisle of a supermarket", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "TCVjcN3FIg4_000100_000110.mp4", "caption": "Several people are riding a bobsled down a track and they are taking curves at high speeds.", "counterfactual": "Several people are riding a bobsled down a track and they are taking curves at low speeds.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CGfNBa3892c_000050_000060.mp4", "caption": "Three teenagers are standing in front of a car, two of them are washing the third one's long black hair with soap and water in the street, they are excitable.", "counterfactual": "Two teenagers are standing in front of a car, one of them is washing the third one's long black hair with soap and water in the street, they are calm.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4isOUk55zGs_000000_000010.mp4", "caption": "In a park a woman is attempting to do a flip and she successfully does it with her two hands", "counterfactual": "In a park a woman is attempting to do a flip and she unsuccessfully does it with her two hands", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qm97zAkPIcs_000137_000147.mp4", "caption": "Group of men riding skateboards at a rapid pace down the side of a mountain.", "counterfactual": "A group of men are riding very slow skateboards down the side of a mountain.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "L5Ixz3In8VU_000000_000010.mp4", "caption": "A man uses a weight exercise slowly on his arms.", "counterfactual": "A man uses a weight exercise quickly on his arms.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ShSSAEfnyDs_000000_000010.mp4", "caption": "A person yells into another persons ear and they person reacts.", "counterfactual": "A person whispers into another person's ear and they person reacts.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "zCo46NbHo60_000003_000013.mp4", "caption": "A person finely and quickly cuts a large mushroom into tiny pieces.", "counterfactual": "A person roughly and slowly cuts a large mushroom into tiny pieces.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pDri2cRQicM_000082_000092.mp4", "caption": "A child is diligently cutting holes in a pumpkin using a knife and a screwdriver.", "counterfactual": "A child is un-diligently cutting holes in a pumpkin using a knife and a screwdriver.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "QP3cjM6o6N8_000017_000027.mp4", "caption": "Someone is narrating as two people are playing hockey with each other.", "counterfactual": "Someone is narrating as two people are playing hockey against each other.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "IhLf4VqGmvw_000003_000013.mp4", "caption": "Crowds of people gathering fish from the shoreline with their bare hands quickly.", "counterfactual": "Crowds of people gathering fish from the shoreline with their bare hands slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "yg-ycnodqe0_000006_000016.mp4", "caption": "A woman in a gym slowly climbs a rope, while some music plays in the background", "counterfactual": "A woman in a gym quickly climbs a rope, while some music plays in the background", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pBbY2bAG8cY_000000_000010.mp4", "caption": "A man in a ball cap and shorts and a t-shirt shows in slow motion how to throw a Frisbee.", "counterfactual": "A man in a ball cap and shorts and a t-shirt shows in fast motion how to throw a frisbee.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "vxikQBqXwEA_000101_000111.mp4", "caption": "A young make is playing in the sand carefully digging with a stick.", "counterfactual": "A young man is playing in the sand carelessly digging with a stick.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "E44VD0sc-oU_000036_000046.mp4", "caption": "A young woman and man walking slowing over wooden bars.", "counterfactual": "A young woman and man walk quickly over wooden bars.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "r56uijT7L3E_000000_000010.mp4", "caption": "On a backyard trampoline, a young boy performs a big backflip.", "counterfactual": "A big boy performs a small backflip on a trampoline in a backyard.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8fFpqo-nuB8_000008_000018.mp4", "caption": "A girl is slowly eating a large piece of chocolate cake from a plate.", "counterfactual": "A girl is quickly eating a large piece of chocolate cake from a plate.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "LwA6QzYcdNE_000000_000010.mp4", "caption": "A man with boots slowly drives a red snow plow, making a path.", "counterfactual": "A man without boots quickly drives a red snow plow, making a path.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "598ziIPDVbA_000028_000038.mp4", "caption": "two adults are kayaking across a body of water peacefully.", "counterfactual": "two adults are kayaking across a body of water violently.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Z5y5xogMxmM_000002_000012.mp4", "caption": "A young girl sits on a swing outdoors and slowly moves back and forth.", "counterfactual": "A young girl sits on a swing outdoors and quickly moves back and forth.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GrepoZ-6l18_000000_000010.mp4", "caption": "a little girl makes worried faces as someone pierces her ears", "counterfactual": "a little girl makes excited faces as someone pierces her ears", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-4czhey2lwY_000003_000013.mp4", "caption": "A man on stage dances wildly to the music while people cheer.", "counterfactual": "A man on stage dances slowly to the music while people cheer.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qHw1Qr2ouWo_000020_000030.mp4", "caption": "Someone wearing a green hat trying to quickly shuck oysters.", "counterfactual": "Someone wearing a green hat trying to slowly shuck oysters.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Ia2gZq0FD9Q_000020_000030.mp4", "caption": "A person dressed up a wolf howls aloud while another person talks to it.", "counterfactual": "A person dressed up as a wolf howls quietly while another person talks to it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Z2_Xy-rqaS0_000011_000021.mp4", "caption": "A man in a black sweatshirt flips a playing card towards a door in slow motion.", "counterfactual": "A man in a black sweatshirt flips a playing card towards a door in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CnYoY8iq8vY_000003_000013.mp4", "caption": "A young girl with braces is laughing very loudly at something someone said.", "counterfactual": "A young girl without braces is laughing very loudly at something someone said.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "BHyey-l251E_000083_000093.mp4", "caption": "A girl in a pink top is excitingly riding a camel.", "counterfactual": "A girl in a pink top is frustratingly trying to ride a camel.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "NjxF_UXECGY_000331_000341.mp4", "caption": "A woman professionally works her fingers into another woman's scalp and massages it.", "counterfactual": "A woman personally works her fingers into another woman's scalp and massages it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CnHKmtkBBs8_000003_000013.mp4", "caption": "A man wearing a baseball unsuccessfully keeps trying to blow out the candles on a cake.", "counterfactual": "A man wearing a baseball successfully keeps trying to blow out the candles on a cake.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "baEoQJbrqP0_000143_000153.mp4", "caption": "A man is roping a calf as fast as he can in a competition.", "counterfactual": "A man is roping a calf as slow as he can in a competition.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Kop2rIvVh9o_000046_000056.mp4", "caption": "A man wetting his face and shaving part of his beard", "counterfactual": "A man wetting his face and shaving all of his beard", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_kQxazaUhMk_000001_000011.mp4", "caption": "A person carefully applies pain to a canvas.", "counterfactual": "A person haphazardly applies paint to a canvas.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "zfBWtZ7phDc_000002_000012.mp4", "caption": "One woman sneezes loudly then walks away while another woman laughs.", "counterfactual": "One woman sneezes softly then walks away while another woman laughs.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4Kg_ga6WbBU_000100_000110.mp4", "caption": "A person gliding lands safely on the ground while others watch.", "counterfactual": "A person gliding crashes onto the ground while others watch.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "N5zwcsTS4d8_000002_000012.mp4", "caption": "A video shows some tips for swimming and gliding faster in water.", "counterfactual": "A video shows some tips for swimming and gliding slower in water.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1Dup1VT66qU_000006_000016.mp4", "caption": "A young athlete is throwing a heavy ball as fas as they can toss it.", "counterfactual": "A young athlete is throwing a heavy ball as slow as they can toss it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ge5SVvtj78w_000010_000020.mp4", "caption": "A party is going on with a lot of people in loud onversation.", "counterfactual": "A party is going on with a lot of people in soft conversation.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "SfGVf0KEMcw_000027_000037.mp4", "caption": "A woman happily shave the beard off of a man with an electric shaver.", "counterfactual": "A woman unhappily shave the beard off of a man with an electric shaver.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "bj_kAPISHaE_000109_000119.mp4", "caption": "A girl has her ears pierced and appears very nervous.", "counterfactual": "A girl has her ears pierced and appears very calm.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wI0TiLy5QjU_000229_000239.mp4", "caption": "A young girl has her arm examined by another lady, the lady speaks in details about her arm.", "counterfactual": "A young girl has her arm examined by another lady, the lady speaks in general about her arm.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1ETCFP3Rgko_000009_000019.mp4", "caption": "As the wind blows heavily at an outdoor basketball court, a man is kneeling and bouncing three basketballs.", "counterfactual": "As the wind blows lightly at an outdoor basketball court, a man is kneeling and bouncing three basketballs.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "P1sCmXtfLf4_000000_000010.mp4", "caption": "A young girl stares at the camera and shouts something, then disappears", "counterfactual": "A young girl stares at the camera and whispers something, then disappears", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "iVgG4MniibI_000075_000085.mp4", "caption": "A young man does a quick hand stand and then leaves the room.", "counterfactual": "A young man does a slow hand stand and then leaves the room.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7Ba3ZIMPZdg_000002_000012.mp4", "caption": "While in fast motion, people are moving back and forth inside a tunnel and spray painting in areas where lights are flashing.", "counterfactual": "While in slow motion, people are moving back and forth inside a tunnel and spray painting in areas where lights are flashing.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "A42YKez_D_g_000002_000012.mp4", "caption": "It is windy and a man is windsurfing on the ocean.", "counterfactual": "It is calm and a man is windsurfing on the ocean.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "cIojq64_JGA_000000_000010.mp4", "caption": "In a gym a boy runs and jumps high over a rope.", "counterfactual": "In a gym a boy runs and jumps low under a rope.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2wZJwqabw70_000023_000033.mp4", "caption": "A woman rides a segway toward a man who slowly backs away.", "counterfactual": "A woman rides a segway toward a man who quickly backs away.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "q7kPw2pdB30_000020_000030.mp4", "caption": "A group of people play the drums with a fast beat while an older man dances on the floor.", "counterfactual": "A group of people play the drums with a slow beat while an older man dances on the floor.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ZK_1jqvgg-g_000006_000016.mp4", "caption": "a guy named Michael is rolling the floor manually with a hat on.", "counterfactual": "a guy named micheal is rolling the floor mechanically with a hat on.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2wZJwqabw70_000023_000033.mp4", "caption": "A man walks slowly backwards as a woman rides a Segway towards him", "counterfactual": "A man walks quickly backwards as a woman rides a segway away from him", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "n-mMLqh-YtY_000000_000010.mp4", "caption": "A woman applies makeup and brushes her hair in high speed.", "counterfactual": "A woman applies makeup and brushes her hair in low speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "p2tqhvm8siQ_000243_000253.mp4", "caption": "People rappel slowly down the side of a rock cliff.", "counterfactual": "People rappel quickly down the side of a rock cliff.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "rEMOAQGni-M_000005_000015.mp4", "caption": "An elderly woman trying to use a jump rope as she struggles to do a jump correctly", "counterfactual": "An elderly woman easily doing a jump rope as she jumps with ease", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "p4R-q94KBcU_000000_000010.mp4", "caption": "two little girls roller skating slowly inside a roller rink", "counterfactual": "two little girls roller skating quickly inside a roller rink", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CDVobHg563k_000000_000010.mp4", "caption": "Two men are standing next to each other and drinking some drinks quickly.", "counterfactual": "Two men are standing next to each other and drinking some drinks slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "phpv6WPyKDo_000000_000010.mp4", "caption": "The man is doing a demonstration on how to chop onions so finely and fast.", "counterfactual": "The man is doing a demonstration on how to chop onions slowly and carefully.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "r4sYfEcGrgg_000004_000014.mp4", "caption": "A young woman stretches her shoulder as she gets ready to throw a javelin she throws it far", "counterfactual": "A young woman stretches her shoulder as she gets ready to throw a javelin she throws it near", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GpWfeIyA-nE_000086_000096.mp4", "caption": "A child mumbles incomprehensibly as he picks at his hair with a comb.", "counterfactual": "A child talks clearly as he picks at his hair with a comb.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "G8unFTBx3b0_000087_000097.mp4", "caption": "A bartender is carefully pouring, measuring, and mixing two alcoholic drinks", "counterfactual": "A bartender is sloppily pouring, measuring, and mixing two alcoholic drinks", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-MgXP03ijj8_000004_000014.mp4", "caption": "The young man is slowly skiing down a small hill and doing turns.", "counterfactual": "The young man is skiing down a small hill at full speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "fEIdzLSZZPo_000008_000018.mp4", "caption": "A little girl in a  pink top eats cake in slow motion while sitting against a cushion.", "counterfactual": "A little girl in a  pink top eats cake in fast motion while sitting against a cushion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "WASSmFKNVc4_000189_000199.mp4", "caption": "A woman with glasses and pink hair slowly licks a sucker as music plays.", "counterfactual": "A woman with glasses and pink hair quickly sucks a sucker as music plays.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2OFfh8Q-AZo_000016_000026.mp4", "caption": "A man lurches forward a couple of steps and then throws a frisbee very far", "counterfactual": "A man steps forward a couple of steps and then throws a frisbee short", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_rkl2gffKUM_000020_000030.mp4", "caption": "A woman dances wildly barefoot while another woman looks at her and encourages her.", "counterfactual": "A woman dances quietly barefoot while another woman looks at her and encourages her.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Skn1hjwRuRg_000011_000021.mp4", "caption": "A person is carefully stitching a pattern onto some cloth.", "counterfactual": "A person is quickly stitching a pattern onto some cloth.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GwLVIoBrnGE_000000_000010.mp4", "caption": "A man tries to bend a stick by usingn his arms as it slowly bends in a u shape", "counterfactual": "A man tries to bend a stick by using his arms as it quickly bends in a u shape", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "V7KettWtL14_000014_000024.mp4", "caption": "A young man prepares to punch a wooden board held by two people, and then he does it successfully.", "counterfactual": "A young man is preparing to punch a wooden board held by two people, and then he does it unsuccessfully.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "C-d8Qjl7OIs_000002_000012.mp4", "caption": "A man with a shocked expression on his face blows out a candle.", "counterfactual": "A man with a calm expression on his face blows out a candle.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "r2BadvUBRWc_000008_000018.mp4", "caption": "A persons run and long jump is put into slow motion.", "counterfactual": "A person's run and long jump is shown in real time.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "oF19bJzWki4_000078_000088.mp4", "caption": "The man is demonstrating how he manually scrapes the wooden panel.", "counterfactual": "The man is demonstrating how he automatically scrapes the wooden panel.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0H0AdWJ-UJY_000022_000032.mp4", "caption": "The man takes a large white handkerchief and noisily blows his nose", "counterfactual": "The man takes a large white handkerchief and quietly blow his nose", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "sq0mrRVotXc_000002_000012.mp4", "caption": "A baby slowly crawls on a carpeted floor and then grabs a small object", "counterfactual": "A baby quickly crawls on a carpeted floor and then drops a small object", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GOH6fBhoi2o_000010_000020.mp4", "caption": "Music plays as a toddler is seen happily sitting very close to a TV screen.", "counterfactual": "Music plays as a toddler is seen happily sitting very far from a tv screen.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9cjb8k2w9Pw_000007_000017.mp4", "caption": "People sit comfortably in various settings and slowly puff on a hookah", "counterfactual": "People sit uncomfortably in various settings and quickly puff on a hookah", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2LPE0KU05-Y_000089_000099.mp4", "caption": "A girl is holding a microphone close to a woman that is wearing a hat.", "counterfactual": "A girl is holding a microphone far away from a woman that is wearing a hat.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "v-E6NalwaAg_000012_000022.mp4", "caption": "A man with an ax wildly chops wood almost as if he is angry.", "counterfactual": "A man with an ax quietly chops wood almost as if he is calm.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5sZA6LORUEw_000000_000010.mp4", "caption": "A man is jump roping at a very fast pace and skipping through the rope.", "counterfactual": "A man is jumping very slow and hopping through the rope.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5w2cXmcpoR0_000001_000011.mp4", "caption": "Outdoors, a large male on a unicycle cycles along in a straight line putting his arms out for balance.", "counterfactual": "Outdoors, a large male on a unicycle cycles along in a curved line putting his arms out for balance.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "gle0CcqRDWM_000000_000010.mp4", "caption": "A man flips over in a kayak in a pool and then safely escapes", "counterfactual": "A man flips over in a kayak in a pool and then has a problem getting out of the pool", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "E0a0YgqQ8LM_000058_000068.mp4", "caption": "Someone is casually hand watering with a fan nozzle in thier garden.", "counterfactual": "Someone is vigorously hand watering with a fan nozzle in their garden.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7EHfC-qMNrM_000022_000032.mp4", "caption": "A man is quickly jumping rope inside of a gymnasium.", "counterfactual": "A man is slowly jumping rope inside of a gymnasium.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "EA3HCx0yTIY_000281_000291.mp4", "caption": "A man sitting at a drum set slowly hits the cymbals with a drumstick.", "counterfactual": "A man sitting at a drum set quickly hits the cymbals with a drumstick.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Y2Y8uhqwBUs_000015_000025.mp4", "caption": "A man making an unboxing where he tries to rip open a box and show whats inside", "counterfactual": "A man opening a box where he tries to gently open a box and show whats inside", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ajtMoUrzf_o_000020_000030.mp4", "caption": "An old commercial on Canon products of people happily using them.", "counterfactual": "An old commercial on canon products of people angrily using them.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CdpVL_aK2q8_000083_000093.mp4", "caption": "A man is swimming in slow motion under eater in a swimming pool.", "counterfactual": "A man is swimming in fast motion under eater in a swimming pool.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "RD0sSLt6ckA_000000_000010.mp4", "caption": "A young woman with long hair and heavy makeup winks and smiles quickly after moving her head to the side.", "counterfactual": "A young woman with long hair and heavy makeup winks and smiles slowly after moving her head to the side.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qdbAK4zKr58_000048_000058.mp4", "caption": "A person parachutes into the side of tower causing him to fall erratically.", "counterfactual": "A person parachutes into the side of tower causing him to land directly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CBx-7WJRHgo_000000_000010.mp4", "caption": "a man tries to cross a rapidly moving stream in his motorbike but fall off into the water.", "counterfactual": "a man tries to cross a rapidly moving stream in his motorbike but makes it to the other side in safety.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "6l-Waa_Pnmw_000009_000019.mp4", "caption": "A young boy sings hard while shaking his head up and down.", "counterfactual": "A young boy sings soft while shaking his head up and down.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ZbI_bpw83Pc_000007_000017.mp4", "caption": "A person and his friend begin blowing through a tube together, they pause and smile at the camera.", "counterfactual": "A person and his friend begin blowing through a tube separately, they pause and smile at the camera.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7TmunkUlVtE_000000_000010.mp4", "caption": "Someone is scooping out a pumpkin and getting ready to carve it in fast motion.", "counterfactual": "Someone is scooping out a pumpkin and getting ready to carve it in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "WnKZaNwBVNg_000046_000056.mp4", "caption": "A pigeon  is eating outside on a ledge and a person is moving their hand very slowly to them.", "counterfactual": "A pigeon is eating outside on a ledge and a person is moving their hand very quickly to them.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "UEir8hX3aJA_000000_000010.mp4", "caption": "A woman demonstrates the scientific principle of the oscillating wave as she moves two ropes up and down in rapid motion.", "counterfactual": "A woman demonstrates the scientific principle of the oscillating wave as she moves two ropes up and down in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "u8yLXnZLqJw_000154_000164.mp4", "caption": "Outside a man is on a slow horse back ride", "counterfactual": "Outside a man is on a fast horse back ride", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "xjkdzoqdnzg_000006_000016.mp4", "caption": "A girl is up a rope and slowly continues to climb to the top.", "counterfactual": "A girl is up a rope and quickly descends to the bottom.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FLwOWjM3eyU_000000_000010.mp4", "caption": "A young person skis smoothly and turns around to respond to an adult woman.", "counterfactual": "A young person skis awkwardly and turns around to respond to an adult woman.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "OeD-0dgV53k_000048_000058.mp4", "caption": "a person in a bright jacket slowly rides down a flight of stairs as others are near by for help.", "counterfactual": "a person in a bright jacket quickly rides up a flight of stairs as others are near by for help.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "q3JbA6MxmIw_000002_000012.mp4", "caption": "A young man is getting his legs waxed rapidly by a woman", "counterfactual": "A young man is getting his legs waxed slowly by a woman", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "JhDoDO1dYP0_000038_000048.mp4", "caption": "A women is giving guidence on a groomer object to gently use on a horse.", "counterfactual": "A women is giving guidence on a groomer object to harshly use on a horse.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "phpv6WPyKDo_000000_000010.mp4", "caption": "A man is slicing a vegetable on a chopping board with quick motions.", "counterfactual": "A man is slicing a vegetable on a chopping board with slow motions.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Z5y5xogMxmM_000002_000012.mp4", "caption": "A little girl in a pink shirt is on a swing in slow motion", "counterfactual": "A little girl in a pink shirt is on a swing in fast motion", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7KQ7gbJwd3A_000027_000037.mp4", "caption": "Slow motion view of a teen running and kicking another teen with a martial arts kick.", "counterfactual": "Normal speed view of a teen running and kicking another teen with a martial arts kick.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0eymUbb5D_8_000057_000067.mp4", "caption": "A man walks on a tight rope suspended a long distance between trees.", "counterfactual": "A man walks on a tight rope suspended a short distance between trees.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qDHRGeE9GcA_000000_000010.mp4", "caption": "A little boy in the middle of a room bouncing  ball continuously", "counterfactual": "A little boy in the middle of a room bouncing ball slowly", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "A4I-Qt0jT6k_000016_000026.mp4", "caption": "A man plays the drums and cymbals rapidly in a dark room", "counterfactual": "A man plays the drums and cymbals slowly in a dark room", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "3BpiVYdTRfM_000272_000282.mp4", "caption": "A person is slowly folding the corners of a strip of paper.", "counterfactual": "A person is quickly unfolding the corners of a strip of paper.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "X16P9KvmJ4k_000000_000010.mp4", "caption": "A person wearing pink gloves is trimming a pineapple very quickly.", "counterfactual": "A person wearing pink gloves is trimming a pineapple very slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8lBU0D4kNDw_000008_000018.mp4", "caption": "Three guys are shaking their heads heavily for a music and laughing each other", "counterfactual": "Three guys are shaking their heads slightly for a music and laughing each other", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "3Qdz1LR3IdI_000000_000010.mp4", "caption": "A person scrapes ice quickly to prepare a sweet treat.", "counterfactual": "A person scrapes ice slowly to prepare a sweet treat.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "tFVDBYsGMwg_000000_000010.mp4", "caption": "A boy is putting all the food in his mouth in one go on the coach with his friends.", "counterfactual": "A boy puts some of the food in his mouth on the coach with his friends.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "dYEPXMdxGVU_000015_000025.mp4", "caption": "While playing kickball, a woman rolls the ball to the kicker, who kicks is very lightly and runs.", "counterfactual": "While playing kickball, a woman rolls the ball to the kicker, who kicks is very hard and runs.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "t-W6nF_ULeU_000187_000197.mp4", "caption": "A group of people are competing a speed skate around a track.", "counterfactual": "A group of people are competing a slowly skate around a track.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "BK3-IWrDs3Q_000001_000011.mp4", "caption": "A girl makes funny faces and crosses her eyes intentionally.", "counterfactual": "A girl makes funny faces and crosses her eyes accidentally.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wcMVNGauxks_000014_000024.mp4", "caption": "a person with a skull mask on dances wildly in front of the camera", "counterfactual": "a person with a skull mask on dances slowly in front of the camera", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Hrt2-YSJaBM_000016_000026.mp4", "caption": "A man on a bicycle as he goes up a ramp and then falls down hitting himself", "counterfactual": "A man on a bicycle as he rides up a ramp and then lands safely", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4lKFCmm2ogE_000030_000040.mp4", "caption": "A person was playing guitar by keeping in his hands with effort", "counterfactual": "A person was playing guitar with ease", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1EwTziZP7Zo_000000_000010.mp4", "caption": "A young boy laughs hysterically into the camera, and then gets a second wind.", "counterfactual": "A young boy laughs calmly into the camera, and then gets a second wind.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0vriOSloUe0_000000_000010.mp4", "caption": "A woman is sitting as she is worried while a doctor is checking her ear.", "counterfactual": "A woman is sitting and she is calm as a doctor is checking her ear.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "k3WbOqW3GQU_000024_000034.mp4", "caption": "Man in historic costume sitting on a stone step playing a lute on his lap in a slow way.", "counterfactual": "Man in historic costume sitting on a stone step playing a lute on his lap in a fast way.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4ws1RQ6KbpM_000000_000010.mp4", "caption": "A group of people are watching a man fastly slide through a flat ground water slide then falls and lands on head.", "counterfactual": "A group of people are watching a man slowly slide through a flat ground water slide then falls and lands on head.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ApQOH_a3eq8_000003_000013.mp4", "caption": "Someone throws knives and breaks balloons set up on a board in a backyard.", "counterfactual": "Someone throws knives at balloons set up on a board in a backyard and hits the balloons, but does not break them.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1uA_9vkUWUs_000074_000084.mp4", "caption": "A variety of plants in a container are watered by hand", "counterfactual": "A variety of plants in a container are watered automatically", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "bbLNwQdRNCg_000000_000010.mp4", "caption": "A little kid is running really fast and then trying to hop over a barrier without dropping it but unfortunately does not make it", "counterfactual": "A little kid is running slowly and then trying to hop over a barrier without dropping it but unfortunately does not make it", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "MqPBZFPTfy4_000000_000010.mp4", "caption": "In a building someone is using a big rubber mallet and banging it against something making a loud noise.", "counterfactual": "In a building someone is using a large rubber mallet and banging it against something making a soft noise.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "b3t6xpITK2k_000003_000013.mp4", "caption": "Two girls are hysterically laughing in front of a bartender, the bartender mocks them in return.", "counterfactual": "Two girls are softly laughing in front of a bartender, the bartender is curiously looking at them in return.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "f8FJw0apM_c_000023_000033.mp4", "caption": "A man is pulling himself up a rope and is almost to the top.", "counterfactual": "A man is pulling himself up a rope and is still quite far from the top.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Ues7bMYruPI_000000_000010.mp4", "caption": "Some children are playing a ball game in a school hall as they rush to collect the ball from the centre spot before returning to base.", "counterfactual": "Some children are playing a ball game in a school hall as they slowly collect the ball from the centre spot before returning to base.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "kgHoKUZWKCs_000026_000036.mp4", "caption": "a woman standing on the track doing a long jump", "counterfactual": "a woman jumping short distances on the track", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "CDVobHg563k_000000_000010.mp4", "caption": "Two teenage boys a drinking alcohol as fast as the can to impress peers.", "counterfactual": "Two teenage boys a drinking alcohol as slow as the can to impress peers.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "h5gW_rb6szQ_000013_000023.mp4", "caption": "A man is juggling mixing cups in a bar in slow motion.", "counterfactual": "A man is juggling mixing cups in a bar in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-R8VmNs5u3U_000005_000015.mp4", "caption": "A man using a cloth fabric to cleanly wipe your windows from dust and other materials", "counterfactual": "A man using a cloth fabric to roughly wipe your windows from dust and other materials", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "t573KgLsuNA_000009_000019.mp4", "caption": "A young boy riding a unicycle with great skills and confidence", "counterfactual": "A young boy riding a unicycle with average skills and confidence", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "sjbyEx20ou4_000000_000010.mp4", "caption": "A young man is running very fast on a treadmill while being supported by a harness.", "counterfactual": "A young man runs on a treadmill very carefully while being supported by a harness.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qWdw_6eIPAQ_000035_000045.mp4", "caption": "Boys are in a karate class, demonstrating speed and precision as they break boards.", "counterfactual": "Boys are in a karate class, demonstrating slow and uncoordinated as they break boards.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "baEoQJbrqP0_000143_000153.mp4", "caption": "A cowboy at a rodeo catches a calf, and then quickly ties a rope around its legs.", "counterfactual": "A cowboy at a rodeo catches a calf, and then slowly ties a rope around its legs.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "QOI9G153cvw_000025_000035.mp4", "caption": "A woman carefully arranges a boquet of roses in a vase.", "counterfactual": "A woman quickly arranges a boquet of roses in a vase.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "eYn8jtKpVkM_000031_000041.mp4", "caption": "People dance wildly in a church while a band plays church music", "counterfactual": "People dance calmly in a church while a band plays church music", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "kh7kB8n-tDY_000013_000023.mp4", "caption": "A person is taking a shot and having a gross reaction at a bar.", "counterfactual": "A person is taking a shot and having a subtle reaction at a bar.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7GaSbJcbrTQ_000014_000024.mp4", "caption": "A girl is running on a trampoline and falls down.", "counterfactual": "A girl is running on a trampoline slowly and doesn't fall down.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wl4VBbzlt_0_000000_000010.mp4", "caption": "A small child on a baby seat is creating a mess as he tries to eat and adults mill around.", "counterfactual": "A small child on a baby seat is carefully eating and adults mill around.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "RlfVK8z5wJ0_000000_000010.mp4", "caption": "On a frozen lake a female carefully walks out to a yellow marker and lifts something out of the water through a hole in the ice.", "counterfactual": "On a frozen lake a female quickly walks out to a yellow marker and lifts something out of the water through a hole in the ice.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "cWbSJOfhcE4_000128_000138.mp4", "caption": "A person is being slowed dropped down from a height by another person holding the other end of the rope.", "counterfactual": "A person is being quickly dropped down from a height by another person holding the other end of the rope.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5UU3iRQW28U_000000_000010.mp4", "caption": "A baby is eating cake with his hands and is messy", "counterfactual": "A baby is eating cake with his hands and is clean", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "P4LfZUGthmg_000036_000046.mp4", "caption": "Men in protective gear repelling quickly in an indoor gym that has padded equipment.", "counterfactual": "Men in protective gear repelling slowly in an indoor gym that has padded equipment.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8wIhEyLDR0E_000023_000033.mp4", "caption": "A man prepares to throw a throwing-dart in slow motion.", "counterfactual": "A man prepares to throw a throwing-dart in normal speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "o2mqzjWJJNw_000010_000020.mp4", "caption": "A man outside doing some welding near his house dangerously", "counterfactual": "A man outside doing some welding near his house safely", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2sse3fDcMsY_000008_000018.mp4", "caption": "Shirtless man doing a backflip but flopping on his back off a diving board into a pool.", "counterfactual": "Shirtless man doing a backflip and completing it successfully off a diving board into a pool.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "k1JI3LPooPg_000000_000010.mp4", "caption": "A man runs and throws a javelin a very short distance outdoors.", "counterfactual": "A man runs and throws a javelin a very long distance outdoors.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ZNLnTMuwz0E_000025_000035.mp4", "caption": "A man is laughing hysterically as a person rips a piece of paper.", "counterfactual": "A man is laughing quietly as a person rips a piece of paper.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wI14syQ_tIE_000000_000010.mp4", "caption": "Man placing a large amount of chips into his mouth at the same time and trying not to choke.", "counterfactual": "Man placing a moderate amount of chips into his mouth at the same time and trying not to choke.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "u0q1lSAoTuM_000001_000011.mp4", "caption": "A girl is slamming two red ropes on the ground to excercise outdoors.", "counterfactual": "A girl is hitting two red ropes gently on the ground to excercise outdoors.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8ghPT4cMyJA_000323_000333.mp4", "caption": "A man was walking on the air above the tall buildings in the air with effort", "counterfactual": "A man was walking on the air above the tall buildings with ease", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7ptFDhJMSWQ_000007_000017.mp4", "caption": "A small boy on roller skates moves tentatively around a gym as adults watch.", "counterfactual": "A small boy on roller skates moves confidently around a gym as adults watch.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wcMVNGauxks_000014_000024.mp4", "caption": "A man in a skull mask does a strange dance and shakes his head.", "counterfactual": "A man in a skull mask does a simple dance and shakes his head.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "VFYCU8FDRTM_000000_000010.mp4", "caption": "A person is riding a bicycle down a dirt road and she falls,", "counterfactual": "A person is riding a bicycle down a dirt road and she lands softly", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0C_TGr-V2Bw_000000_000010.mp4", "caption": "A man sprints down a track before launching himself for the long jump.", "counterfactual": "A man slowly jogs down a track before running into the long jump.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "05ZSAMVA7g4_000004_000014.mp4", "caption": "A young male athlete successfully completes a high jump at an indoor track meet.", "counterfactual": "A young male athlete unsuccessfully completes a high jump at an indoor track meet.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "z8Uy4ZzaM5Q_000083_000093.mp4", "caption": "Several miniature toy trains are riding on their tracks simultaneously.", "counterfactual": "Several miniature toy trains are riding on their tracks one at a time.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "VO9ry7FV0tQ_000002_000012.mp4", "caption": "Two little boys are sitting at a table and eating and drinking milk quickly.", "counterfactual": "Two little boys are sitting at a table and eating and drinking milk slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "z8l7Gy9JtAg_000012_000022.mp4", "caption": "A child is swinging before another comes up and kicks it hard, but isn't hurt.", "counterfactual": "A child is swinging before another comes up and kicks it gently, but isn't hurt.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0jbpGIvCQPM_000000_000010.mp4", "caption": "A girl catches a ball with her baseball mitt and throws it back really fast.", "counterfactual": "A girl catches a ball with her baseball mitt and throws it back slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "82_d4p-XSFg_000000_000010.mp4", "caption": "A group of young children stand together uncertainly as the camera records them", "counterfactual": "A group of young children stand together eagerly as the camera records them", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8wIhEyLDR0E_000023_000033.mp4", "caption": "A man with a tatoo is preparing to shoot a dart in slow motion.", "counterfactual": "A man with a tatoo is preparing to shoot a dart in normal speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ur3v50r9qzo_000000_000010.mp4", "caption": "The man is having to do extensive exercises in the gym.", "counterfactual": "The man is doing moderate exercises in the gym.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "jgTIiXoJ7Fs_000001_000011.mp4", "caption": "A small girl was climbing on the rope with effort from down to up and another person hold that rope", "counterfactual": "A small girl was climbing on the rope with ease from up to down and another person hold that rope", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "aVFpr1J5acI_000003_000013.mp4", "caption": "A man using a diving board unconventionally, bouncing on his buttocks first, then doing a front flip into the water", "counterfactual": "A man using a diving board conventionally, jumping in the air and doing a front flip into the water", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "85e9l9qxtzQ_000000_000010.mp4", "caption": "A person stands on a treadmill, turns it on and starts running and it goes too fast and they fall off the back of it.", "counterfactual": "A person stands on a treadmill, turns it on and starts running and it goes too slow and they fall off the back of it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2kJxrcNRS9w_000047_000057.mp4", "caption": "A young girl does flips outside in the sunlight at close proximity to the camera.", "counterfactual": "A young girl does flips outside in the sunlight at a great distance from the camera.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "y4J5iNYRYiE_000180_000190.mp4", "caption": "A woman is cooking on a pan and is slow cooking the food", "counterfactual": "A woman is cooking on a pan and is quickly cooking the food", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "189m-tUz_4k_000023_000033.mp4", "caption": "A woman stands in front of a camera and then is shown next to news anchors, and she then briefly walks into a room", "counterfactual": "A woman stands in front of a camera and then is shown next to news anchors, and she then slowly walks into a room", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "598ziIPDVbA_000028_000038.mp4", "caption": "People are kayaking smoothly along a very serene waterway.", "counterfactual": "People are kayaking unsteadily along a very serene waterway.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7at4UFVmTCc_000020_000030.mp4", "caption": "A group of people rip out the wax strips from a mans leg as he gets up in pain", "counterfactual": "A group of people gently remove the wax strips from a mans leg as he gets up in pain", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "a_LbJAGMpvM_000249_000259.mp4", "caption": "guys are laughing loud having a shot of drink and sharing them in the night.", "counterfactual": "guys are laughing quietly having a shot of drink and sharing them in the night.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7d_m-QsQtRM_000073_000083.mp4", "caption": "A man performs a number of energetic dance moves on the sidewalk.", "counterfactual": "A man performs a number of lazy dance moves on the sidewalk.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "xETzy1LuJWU_000083_000093.mp4", "caption": "A young woman is using a scrub to gently clean her face.", "counterfactual": "A young woman is using a scrub to roughly clean her face.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "vC2BtUaUnho_000017_000027.mp4", "caption": "A man struggles to whistle while sitting at an outdoor dining area.", "counterfactual": "A man is whistling very easily while sitting at an outdoor dining area.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FtBS6OZSGMI_000028_000038.mp4", "caption": "A person pouring alcohol into a glass with slow framed speed.", "counterfactual": "A person pouring alcohol into a glass with normal framed speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "iLNmg_zAa6Y_000009_000019.mp4", "caption": "A person is riding a bicycle with sleds instead of wheels down the snow and jumps a little ramp.", "counterfactual": "A person is riding a bicycle with sleds instead of wheels down the snow and takes a big jump.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "AMzDOF-2N8g_000000_000010.mp4", "caption": "A man pretends to blow his nose, lifts up his shirt to expose his chest, and cackles maniacally.", "counterfactual": "A man pretends to blow his nose, lifts up his shirt to expose his chest, and cackles calmly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "626py8FOERY_000002_000012.mp4", "caption": "A child makes loud mouth noises while trying to look tough.", "counterfactual": "A child makes quiet mouth noises while trying to look tough.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1EwTziZP7Zo_000000_000010.mp4", "caption": "A very close up shot of a young boy laughing.", "counterfactual": "A very wide shot of a young boy laughing.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "M4srNDvyIPM_000013_000023.mp4", "caption": "A boy in a warehouse repeatedly slams his head onto a box while a few guys have a laugh", "counterfactual": "A boy in a warehouse gently taps his head onto a box while a few guys have a laugh", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ccYBCslrh1A_000029_000039.mp4", "caption": "A young girl is rubbing her hands up and down her face then makes a fish face at the camera.", "counterfactual": "A young girl is rubbing her hands up and down her face then makes a very serious face at the camera.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "e5qBwONhahU_000000_000010.mp4", "caption": "A young person skate boards down the side walks at a slow speed.", "counterfactual": "A young person skate boards down the side walks at a high speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-Qw4kMRwH8s_000129_000139.mp4", "caption": "Several women in a dance studio do a dance in time.", "counterfactual": "Several women in a dance studio do a dance in a random fashion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qGw6tfeebrU_000036_000046.mp4", "caption": "A person is sitting down and playing a mandolin skillfully.", "counterfactual": "A person is sitting down and playing a mandolin clumsily.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "OEq2LB9GS6w_000392_000402.mp4", "caption": "An animal shakes its head quickly as a person pets the animal.", "counterfactual": "An animal shakes its head slowly as a person pets the animal.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "f3Mhm3QYjok_000042_000052.mp4", "caption": "A couple of people are looking excited with their phone.", "counterfactual": "A couple of people are looking nervously with their phone.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "u4eXGXXeoxo_000082_000092.mp4", "caption": "A man is running on an inclined tread mill at a fast pace in slow motion", "counterfactual": "A man is running on an inclined tread mill at a slow pace in normal motion", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8uHiwUKKyMg_000000_000010.mp4", "caption": "A disc case arranged in a line fell over each other one by one", "counterfactual": "A disc case arranged in a line fell over each other at the same time", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "bCRO46WqWUI_000028_000038.mp4", "caption": "A woman bartender pouring drinks into her shirt to much enthusiasm.", "counterfactual": "A woman bartender pours drinks into her shirt slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "lHe6Ehd5S0Y_000001_000011.mp4", "caption": "A young man stares into the camera without blinking for a staring contest.", "counterfactual": "A young man slowly blinks several times during a staring contest.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-Q8eF2vIooQ_000002_000012.mp4", "caption": "Outside on a field a person is a slow horse ride", "counterfactual": "A person is a fast horse ride", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9TybRcGIC4M_000131_000141.mp4", "caption": "Outside in the snow a man is slowly moving on skis.", "counterfactual": "A man quickly moves on skis outside in the snow.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "N29wwGJGzsg_000017_000027.mp4", "caption": "A man prepares to lift an incredibly large amount of weights.", "counterfactual": "A man prepares to lift a regular amount of weights.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "J4gnrSK5RvQ_000030_000040.mp4", "caption": "A guy gets mad at an arcade guy and pushes it and scream.", "counterfactual": "A guy gets mad at an arcade guy and gently pushes it and talks to it calmly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "266DF3P2lt0_000006_000016.mp4", "caption": "A dodge ball game takes place between two sides with a nice throw being made.", "counterfactual": "A dodge ball game takes place between two sides with a slow throw being made.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "22QytzFKlos_000000_000010.mp4", "caption": "A person dives into a pool and then swims but doesn't really move.", "counterfactual": "A person dives into a pool and then swims with effort.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "MIlyiRFx6eA_000010_000020.mp4", "caption": "A man is hitting very hard at a steel object with a big hammer.", "counterfactual": "A man is hitting very softly at a steel object with a big hammer.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "SvqiQgmirCI_000047_000057.mp4", "caption": "A man uses a paint brush thick with yellow paint to cover a sketch on a piece of wood.", "counterfactual": "A man uses a paint brush lightly with yellow paint to cover a sketch on a piece of wood.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "bfnnkLbuHK0_000007_000017.mp4", "caption": "A kayak is going down a channel and the water is choppy.", "counterfactual": "A kayak is going down a channel and the water is calm.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "v6EZNrgNoYA_000000_000010.mp4", "caption": "A girl is dancing, a person opens the door beside her and hits her.", "counterfactual": "A girl is dancing, a person opens the door beside her and gently nudges her.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pXu99CtlDHw_000011_000021.mp4", "caption": "Person running down a tracking doing a long jump while others watch.", "counterfactual": "Person running down a tracking doing a slow jump while others watch.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-MbgmB0jOpY_000004_000014.mp4", "caption": "a person on a pair of skis, skis down a mountain as fast as they can", "counterfactual": "a person on a pair of skis, skis down a mountain slowly as possible", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FBa93py8mCo_000022_000032.mp4", "caption": "in a kitchen two women are cooking something and pricing is really hard on a plate with a spoon", "counterfactual": "in a kitchen two women are cooking something and pricing is easy on a plate with a spoon", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "MgSNvlS2d3A_000126_000136.mp4", "caption": "A girl is rubbing a wax strip hard on a boys leg and then he pulls the wax strip off.", "counterfactual": "A girl is rubbing a wax strip soft on a boys leg and then he pulls the wax strip off.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "71iDwP6_bjU_000002_000012.mp4", "caption": "A baby is struggling to crawl to reach a pad.", "counterfactual": "A baby is not struggling to crawl to reach a pad.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "OnsSTe5gPkM_000000_000010.mp4", "caption": "A person slides down fast on a water slide and an amusement park.", "counterfactual": "A person slides down slowly on a water slide and an amusement park.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "hahlep725ig_000025_000035.mp4", "caption": "A man is filling up bottles with a hose that are carefully placed into a green crate.", "counterfactual": "A man is filling up bottles with a hose that are quickly placed into a green crate.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ur4YjPkzLi4_000233_000243.mp4", "caption": "A man shows the contents of a prospecting pan up close as he talks.", "counterfactual": "A man shows the contents of a prospecting pan from a distance as he talks.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "bg8Ee4sgbJ4_000018_000028.mp4", "caption": "A man does a vigorous dance set to music, outside at the end of a driveway.", "counterfactual": "A man does a leisurely dance set to music, outside at the end of a driveway.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "xW6hpK-DBMY_000080_000090.mp4", "caption": "A man in black calmly demonstrates the proper way to sharpen a knife.", "counterfactual": "A man in black rapidly demonstrates the proper way to sharpen a knife.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "aAIJuq6SPgo_000045_000055.mp4", "caption": "Someone in a school sports hall is using a basketball to practise ball control after a powerful bounce.", "counterfactual": "Someone in a school sports hall is using a basketball to practise ball control after a gentle bounce.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "KeJRWZAEAxM_000031_000041.mp4", "caption": "A boy struggles to perform weighted triceps extensions at the gym.", "counterfactual": "A boy performs weighted triceps extensions at the gym without effort.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1YemrpNBpf4_000001_000011.mp4", "caption": "A young man wearing white face makeup is having part of his chest hair removed with sticky paper.", "counterfactual": "A young man wearing white face makeup is having all of his chest hair removed with sticky paper.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "h2qwgmlw3bg_000000_000010.mp4", "caption": "A teenage boy eats corn on the cob and the rest of the food on his plate in fast motion.", "counterfactual": "A teenage boy eats corn on the cob and the rest of the food on his plate in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "35j0GIg28sA_000023_000033.mp4", "caption": "A girl eating chips with small bites while a boy wearing earbuds is seated beside her", "counterfactual": "A girl eats chips loudly while a boy wearing earbuds is seated beside her", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "zfBWtZ7phDc_000002_000012.mp4", "caption": "A woman is laughing and walking away while possibly sneezing.", "counterfactual": "A woman is laughing and walking away without possibly sneezing.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "erq1mdumjdU_000008_000018.mp4", "caption": "A person shows how to flip a pancake real slow .", "counterfactual": "A person shows how to flip a pancake real fast \".", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "A4ScOLc3kDk_000051_000061.mp4", "caption": "A man flips quickly through a book and then sneezes really loudly.", "counterfactual": "A man slowly flips through a book and then sneezes quietly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "a_LbJAGMpvM_000249_000259.mp4", "caption": "A group of men are talking loudly and passing something around.", "counterfactual": "A group of men are talking quietly and passing something around.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0sICsDdHAnw_000170_000180.mp4", "caption": "A person on a horse rides  it by a fence in slow motion", "counterfactual": "A person on a horse rides it by a fence in fast motion", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Xc4VjKPDAOg_000003_000013.mp4", "caption": "Someone on a bike rides through the grass, up over a wooden ramp and straight into the water.", "counterfactual": "Someone on a bike rides through the grass, up over a wooden ramp and gently into the water.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "xbSUH2ZWtpg_000013_000023.mp4", "caption": "A grey-and-white goat in a pen gets some affectionate petting.", "counterfactual": "A grey-and-white goat in a pen gets some aggressive petting.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "r-UDWOB9SU8_000067_000077.mp4", "caption": "A man plays a fast tune on an accordion indoors.", "counterfactual": "A man plays a slow tune on an accordion indoors.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4UBqzoGTu0s_000000_000010.mp4", "caption": "A man is talking while holding an object that is partially in his mouth, and then, he moves the object.", "counterfactual": "A man is talking while holding an object that is completely in his mouth, and then, he moves the object.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "31mjIwvFr7s_000017_000027.mp4", "caption": "A man in a red shirt bashes a white wall using a sledgehammer.", "counterfactual": "A man in a red shirt lightly touches a white wall with a sledgehammer.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "KgQ7p-NBkpg_000001_000011.mp4", "caption": "A woman successfully performs a squat clean and split jerk.", "counterfactual": "A woman unsuccessfully performs a squat clean and split jerk.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GwLVIoBrnGE_000000_000010.mp4", "caption": "A man in a red shirt is trying very hard to bend a large piece of metal tubing.", "counterfactual": "A man in a red shirt is easily bending a large piece of metal tubing.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Y8iM5-EwRUI_000034_000044.mp4", "caption": "A girl is walking around and talking in a bouncy hoouse.", "counterfactual": "A girl is walking around and talking in a slow and calm manner.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Cfarqb9We4Q_000015_000025.mp4", "caption": "A boy is turning a bat around in front of him in slow motion.", "counterfactual": "A boy is turning a bat around in front of him in normal speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ACqrR9G1T-w_000017_000027.mp4", "caption": "Worker positions flat tool vertically over square opening and uses mallet to bang on tool handle.", "counterfactual": "Worker positions flat tool vertically over square opening and uses mallet to gently tap on tool handle.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "63rfFPVVwXo_000043_000053.mp4", "caption": "Several people are in a grape vat casually stomping grapes and taking pictures of themselves.", "counterfactual": "Several people are in a grape vat rapidly stomping grapes and taking pictures of themselves.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "h2qwgmlw3bg_000000_000010.mp4", "caption": "A boy is sitting at a table and eating a corn in fast motion.", "counterfactual": "A boy is sitting at a table and eating a corn in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "UaXjy8niATI_000067_000077.mp4", "caption": "A woman is having hair around her ear shaved off using hair clippers as the hairdresser slowly clips it off.", "counterfactual": "A woman is having hair around her ear shaved off using hair clippers as the hairdresser quickly clips it off.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "85e9l9qxtzQ_000000_000010.mp4", "caption": "A girl stands on the edges of a running treadmill and when she steps on the middle she has to run fast and is thrown off while people laugh.", "counterfactual": "A girl stands on the edges of a running treadmill and when she steps on the middle she runs fast and keeps running without being thrown off while people laugh.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9Kt6FIFQrTM_000009_000019.mp4", "caption": "A person skiing downhill turns side to side to go through gates.", "counterfactual": "A person skiing downhill goes through gates straight ahead.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "gozhkpe-sEU_000006_000016.mp4", "caption": "A woman gets a scalp massage and looks very relaxed while receiving it.", "counterfactual": "A woman gets a scalp massage and looks stressed while receiving it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "BT4rOXKTVSQ_000017_000027.mp4", "caption": "A young man makes a really hard shot in a game of beer pong.", "counterfactual": "A young man makes a really soft shot in a game of beer pong.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "tMh2VAsrgh4_000053_000063.mp4", "caption": "A person shows themselves sloppily wrapping a gift on the ground.", "counterfactual": "A person shows themselves carefully wrapping a gift on the ground.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "tIGde0O8Brk_000000_000010.mp4", "caption": "A man is seen running and jumping over a pole in slow motion.", "counterfactual": "A man is seen running and jumping over a pole in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "6gAwIar7xDA_000006_000016.mp4", "caption": "A horse rider is trotting through the countryside before the horse gains speed.", "counterfactual": "A horse rider is galloping through the countryside before the horse gains speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "BQ5OjpbBAf8_000090_000100.mp4", "caption": "Two men are kayaking in the ocean with choppy waves.", "counterfactual": "Two men are kayaking in the ocean with very calm waves.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "b3t6xpITK2k_000003_000013.mp4", "caption": "two women are laughing loudly in a bar and the bartender mocks at them by laughing loudly at them.", "counterfactual": "two women are laughing loudly in a bar and the bartender mocks at them by laughing softly at them.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wbOD_G3ttgU_000083_000093.mp4", "caption": "Couples are dancing together to a song in a dance studio.", "counterfactual": "Couples are dancing individually to a song in a dance studio.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "NB-5Ln_KFZg_000173_000183.mp4", "caption": "A person is drawing very artistically with a pencil.", "counterfactual": "A person is drawing poorly with a pencil.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "aJTF-3Gno6g_000006_000016.mp4", "caption": "A woman slowly lies down, then raises herself up to a sitting position and touches her toes.", "counterfactual": "A woman quickly lies down, then raises herself up to a sitting position and touches her toes.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Yc1peiXYbVQ_000004_000014.mp4", "caption": "a man in the laying bed asleep is awaken abruptly out of his sleep", "counterfactual": "a man in the laying bed asleep is awaken slowly out of his sleep", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4MXKoiiX64Q_000015_000025.mp4", "caption": "An intro title introduces us to a hand softly petting a cat.", "counterfactual": "An intro title introduces us to a hand very quickly petting a cat.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "s3jFgtaouNQ_000000_000010.mp4", "caption": "A woman is jogging in slow motion while a man smiles", "counterfactual": "A woman is jogging in fast motion while a man smiles", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "zp8dNM03-tE_000003_000013.mp4", "caption": "A man lifts a large weight onto his shoulders and slowly squats and lifts.", "counterfactual": "A man lifts a large weight onto his shoulders and quickly squats and lifts.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Ba46Gq1Gms0_000000_000010.mp4", "caption": "Group of people rapidly cleaning a large glass door leading to a back porch in a home.", "counterfactual": "Group of people slowly cleaning a large glass door leading to a back porch in a home.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Gg562YQmWDw_000072_000082.mp4", "caption": "A young boy throws a kick at a wooden board held by an adult, and breaks the board.", "counterfactual": "A young boy throws a kick at a wooden board held by an adult, and misses.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "BzxSeJSnqV0_000009_000019.mp4", "caption": "A kid on stage is doing a lot of arm dance movements to music", "counterfactual": "A kid on stage is doing a little arm dance movements to music", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Yisfa4gTaPs_000225_000235.mp4", "caption": "A man pumps air into a long balloon, and ties it up tight.", "counterfactual": "A man pumps air into a long balloon, and ties it up loosely.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1miAAtyZXVQ_000257_000267.mp4", "caption": "In a slow moving stream several people are wading into the water.", "counterfactual": "In a fast moving stream several people are wading into the water.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5g1npcADyzE_000000_000010.mp4", "caption": "A man wearing a golf hat is hitting a ball really fast and somebody is adding special effects to it", "counterfactual": "A man wearing a golf hat is hitting a ball really slowly and somebody is adding special effects to it", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "82_d4p-XSFg_000000_000010.mp4", "caption": "A group of four small children making slight dance moves as lively music plays.", "counterfactual": "A group of four small children are making strong dance moves as lively music plays.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_4TY2CTWiRI_000059_000069.mp4", "caption": "A man repeatedly uses an axe to chop a wooden log but makes limited impact with each blow.", "counterfactual": "A man is repeatedly using an axe to chop a wooden log and hits the log forcefully each time.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "0vriOSloUe0_000000_000010.mp4", "caption": "a girl is getting her ear pierced and she is nervous.", "counterfactual": "a girl is getting her ear pierced and she is calm.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "G7Y8ptl7rHk_000018_000028.mp4", "caption": "Someone counts their foreign money as each piece slowly falls to the table.", "counterfactual": "Someone counts their foreign money very quickly as each piece quickly falls to the table.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "v6uGV-OusgU_000019_000029.mp4", "caption": "A boy messily eats an ice cream cone as a woman chats with him.", "counterfactual": "A boy very carefully eats an ice cream cone as a woman chats with him.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "31rIxx-7KvQ_000040_000050.mp4", "caption": "A man is carefully sharpening a knife blade on a belt.", "counterfactual": "A man is hastily sharpening a knife blade on a belt.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "95YJMSMrrFY_000000_000010.mp4", "caption": "A kid runs all the way down a track and then jumps into the sand.", "counterfactual": "A kid runs half the way down a track and then jumps into the sand.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4jfu5754c9Q_000005_000015.mp4", "caption": "Commercial for a news channel showing a pregnant woman saying we deliver on time.", "counterfactual": "Commercial for a news channel showing a pregnant woman saying we deliver ahead of time.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "BVVazq6r9cM_000000_000010.mp4", "caption": "A girl in a fleece jacket insists very loudly that she can indeed lick her elbow.", "counterfactual": "A girl in a fleece jacket insists very softly that she can indeed lick her elbow.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "r-UDWOB9SU8_000067_000077.mp4", "caption": "A person is playing a accordion very intently with style.", "counterfactual": "A person is playing an accordion very carelessly with style.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "RD0sSLt6ckA_000000_000010.mp4", "caption": "A woman with very long brown hair smiles and winks in fast speed.", "counterfactual": "A woman with very long brown hair smiles and winks in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "sJowpTSLmlA_000005_000015.mp4", "caption": "A person is riding on a skateboard outside in public, the person jumps back on the board later.", "counterfactual": "A person is riding on a skateboard outside in public, the person jumps back on the board right away.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "dj7Uss0XyB4_000021_000031.mp4", "caption": "A person gives detailed instructions on how to make three eggs on a skillet.", "counterfactual": "A person gives only general instructions on how to make three eggs on a skillet.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ygUgKNJIwWo_000000_000010.mp4", "caption": "A girl runs towards and jumps into sand while people look on", "counterfactual": "A girl walks slowly towards and jumps into sand while people look on", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "xetP2Q0SluI_000002_000012.mp4", "caption": "A man awkwardly running on a sidewalk with a stick.", "counterfactual": "A man elegantly running on a sidewalk with a stick.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5HEco-rBThc_000045_000055.mp4", "caption": "A man holds a fish and talks enthusiastically about it.", "counterfactual": "A man holds a fish and talks with a neutral expression about it.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "933ATvsTuBo_000000_000010.mp4", "caption": "A mail truck is driving down the street very slow", "counterfactual": "A mail truck is driving down the street without driving slow", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7aqtLLcA5zI_000026_000036.mp4", "caption": "In an indoor gymnasium, someone does crazy dance moves on the floor as the crowd cheers.", "counterfactual": "In an indoor gymnasium, someone does slow dance moves on the floor as the crowd cheers.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "C4g_K_MIPUg_000090_000100.mp4", "caption": "A person was watering the plants slowly in the center of the plant with hose pipe", "counterfactual": "A person was watering the plants quickly in the center of the plant with hose pipe", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_rxOb5aJgmk_000020_000030.mp4", "caption": "A man is very evenly spray painting a car with blue paint.", "counterfactual": "A man is very unevenly spray painting a car with blue paint.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8QZh4lxyXTg_000014_000024.mp4", "caption": "While on tightrope, man leans backwards and falls off, and places one foot in front of the other foot.", "counterfactual": "While on tightrope, man places one foot in front of the other foot without any difficulties.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "R3gGBiVBe6Y_000000_000010.mp4", "caption": "A man walks and then throws a frisbee far away in a park with another person", "counterfactual": "A man walks and then throws a frisbee close to the other person in a park", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "1NFmcmlThdc_000000_000010.mp4", "caption": "A young woman is talking to a toddler and making funny faces with him.", "counterfactual": "A young woman is talking to a toddler and making serious faces with him.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "t11JmUAwjto_000031_000041.mp4", "caption": "Massaging the right leg of a man after he's had his legs waxed harshly.", "counterfactual": "Massaging the right leg of a man after he's had his legs waxed gently.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FQ3CVI9OHAU_000000_000010.mp4", "caption": "At a grocery store a man makes obscene faces to a woman's body.", "counterfactual": "At a grocery store a man makes polite faces to a woman's body.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "oH01vQhOTJ0_000000_000010.mp4", "caption": "a person is paragliding down the face of the mountain at high speed in a fly suit", "counterfactual": "a person is paragliding down the face of the mountain at low speed in a leather jacket", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "jK5Q_nYZ9fc_000046_000056.mp4", "caption": "Techno music can be heard while a young man repeatedly and unsuccessfully attempts a handstand on the lawn.", "counterfactual": "Techno music can be heard while a young man repeatedly and successfully attempts a handstand on the lawn.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "VoohRAD8U8Q_000006_000016.mp4", "caption": "A girl opens a refrigerator door, and then struggles and fails open the freezer door.", "counterfactual": "A girl opens a refrigerator door, and then struggles and opens the freezer door easily.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "lSqpinuEYOI_000020_000030.mp4", "caption": "A woman operates a loom to rapidly create a textile product", "counterfactual": "A woman operates a loom to slowly create a textile product", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "02HAfW8otDE_000000_000010.mp4", "caption": "A teenage boy runs in slow motion and begins to fling himself over the pole vault.", "counterfactual": "A teenage boy runs in fast motion and begins to fling himself over the pole vault.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "x4a-yY_fSX4_000239_000249.mp4", "caption": "A young woman relaxes with her eyes closed as another person applies makeup to her eye lids.", "counterfactual": "A young woman struggles with her eyes closed as another person applies makeup to her eye lids.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "6yueEUn_lM4_000000_000010.mp4", "caption": "A baby is laying face down on a beg and is slowly crawling toward a target", "counterfactual": "A baby is laying face down on a beg and is quickly crawling toward a target", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "z9XbTjeYJTw_000014_000024.mp4", "caption": "The lady is doing a demonstration on how to wrap gifts artistically.", "counterfactual": "The lady is wrapping gifts haphazardly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "W9UK_TCYoA8_000003_000013.mp4", "caption": "A man is timing himself to see how fast he can put on a neck tie.", "counterfactual": "A man is timing himself to see how slow he can put on a neck tie.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "o2mqzjWJJNw_000010_000020.mp4", "caption": "A man is welding something outside creating a lot of sparks.", "counterfactual": "A man is welding something outside creating a few sparks.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9WaPYUGht54_000023_000033.mp4", "caption": "A young boy with a bat waits on the ball to be thrown.", "counterfactual": "A young boy with a bat prepares to throw the ball as fast as he can.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "t6BDCkIHqzQ_000014_000024.mp4", "caption": "Someone is skiing down a hill with double posted signs and they are weaving between them.", "counterfactual": "Someone is skiing down a hill with double posted signs and they are skiing straight through them.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "mGd-Pfuj-Vk_000000_000010.mp4", "caption": "Person wearing a glide suit flying down the side of a mountain close to objects.", "counterfactual": "Person wearing a glide suit flying down the side of a mountain far from objects.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "coOfwLeUU5I_000020_000030.mp4", "caption": "A young man eats a doughnut while showing it off to the camera.", "counterfactual": "A young man eats a doughnut while looking at the camera shyly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "l7-_ky02OI8_000002_000012.mp4", "caption": "A person stands outside near the beach, eats a mint from the package in his pocket, and then his nipples grow very long", "counterfactual": "A person stands outside near the beach, eats a mint from the package in his pocket, and then his nipples do not grow very long", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "dnzSQiK7PKw_000000_000010.mp4", "caption": "A woman and a boy bowl at the same time then return to their seats.", "counterfactual": "A woman and a boy bowl one after the other then return to their seats.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "S72BJD-UxP8_000075_000085.mp4", "caption": "a block of wood is burning in parts by an instrument.", "counterfactual": "a block of wood is burning evenly by an instrument.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Z2pgniaw_Zc_000049_000059.mp4", "caption": "People are sitting around an area while a man talks very fast like an auctioneer.", "counterfactual": "People are sitting around an area while a man talks very slowly like an auctioneer.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "tedRqaxitsQ_000017_000027.mp4", "caption": "A group of people running on a treadmill at a fast speed.", "counterfactual": "A group of people running on a treadmill at a slow speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "udRzaqScwas_000005_000015.mp4", "caption": "Two women are dressed in flapper outfits, dancing in sync.", "counterfactual": "Two women are dressed in flapper outfits, dancing out of sync.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "r7B2l4qXtNw_000005_000015.mp4", "caption": "Out in a yard, a man jumps rope in slow motion.", "counterfactual": "Out in a yard, a man jumps rope in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "RA90UGf5wxA_000000_000010.mp4", "caption": "Two men are walking on a windy day as the wind pushes them backwards.", "counterfactual": "Two men are walking on a windy day without being pushed backwards.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "MId-VxzmGKM_000059_000069.mp4", "caption": "A man rests outside the storefront and plays the accordion for passersby.", "counterfactual": "A man restlessly plays the accordion for passersby.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "LeX_sYy93Kg_000001_000011.mp4", "caption": "A person ties their shoes in slow motion but does not finish.", "counterfactual": "A person ties their shoes in fast motion but does not finish.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "IgLTMmrT6Ts_000019_000029.mp4", "caption": "A man is showing a little boy how to use an electric drill while a woman cautions them to be careful.", "counterfactual": "A man is showing a little boy how to use an electric drill while a woman watches without cautioning them to be careful.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4rt6cd0DbjY_000371_000381.mp4", "caption": "Riding a horse slowly along a course that is caged in a farm area.", "counterfactual": "Riding a horse quickly along a course that is caged in a farm area.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "XnuUuUq-DYE_000058_000068.mp4", "caption": "A boy sitting at a table in front of a washing machine and dryer is loudly eating potato chips while talking.", "counterfactual": "A boy sitting at a table in front of a washing machine and dryer is quietly eating potato chips while talking.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Xdxpo_ZxA04_000064_000074.mp4", "caption": "At a home, a man lays down and verbally explains a type of exercise.", "counterfactual": "A man lays down and physically demonstrates a type of exercise.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "X1YF9vjV0Ks_000006_000016.mp4", "caption": "At a conference table, a large group of people have a serious meeting.", "counterfactual": "At a conference table, a large group of people have a casual meeting.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "WpGBC2ITQdI_000000_000010.mp4", "caption": "A couple sit in a darkened restaurant while one takes repeated large sips of a drink", "counterfactual": "A couple sit in a darkened restaurant while one takes repeated small sips of a drink", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "L8TEHoElMWg_000000_000010.mp4", "caption": "A bunch of kids are in a huge trampoline net thing jumping together.", "counterfactual": "A bunch of kids are in a huge trampoline net thing jumping individually.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "3lM6ebiaE84_000010_000020.mp4", "caption": "A man stands in a bit of shallow water and easily picks up a live fish with both hands", "counterfactual": "A man stands in a bit of deep water and struggles to pick up a live fish with both hands", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "YEiHsVDxh3A_000029_000039.mp4", "caption": "A hand draws a small group of leaves very quickly.", "counterfactual": "A hand draws a small group of leaves very slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "411iw6IMcXg_000004_000014.mp4", "caption": "A woman rips a piece of wax off a mans chest and he screams then gets up.", "counterfactual": "A woman rips a piece of wax off a mans chest and he grunts then gets up.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "eTTol6npMj0_000000_000010.mp4", "caption": "A young woman widely stretching her mouth to emit a very loud yawn,", "counterfactual": "A young woman widely stretching her mouth to emit a very quiet yawn", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_QQn_eu17F4_000000_000010.mp4", "caption": "A man has his hands grasp close to his chest and is doing squats until bouncing off an exercise ball and starting the process over.", "counterfactual": "A man has his hands grasp far from his chest and is doing squats until bouncing off an exercise ball and starting the process over.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8zaLOaq_2Ug_000000_000010.mp4", "caption": "A man jogs slowly down a path wearing his headset and swinging his arms.", "counterfactual": "A man jogs quickly down a path wearing his headset and swinging his arms.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Tw_2htX4-Lo_000025_000035.mp4", "caption": "A group of people are drawing quickly on large pads of paper.", "counterfactual": "A group of people are drawing slowly on large pads of paper.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "C-hAzpBhjOE_000019_000029.mp4", "caption": "A man is using a leaf blower and doesn't seem to be making much progress.", "counterfactual": "A man is using a leaf blower and is making a lot of progress.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "T7JBwJrPl8k_000070_000080.mp4", "caption": "A little dog is being wiped down with a towel, after a bath, and then looks happily dry.", "counterfactual": "A little dog is being wiped down with a towel, after a bath, and then looks angrily dry.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "GtRr4H-Q11w_000001_000011.mp4", "caption": "A white bird grooms itself near a pond silently, then a young man with a leaf blower begins to clean an area.", "counterfactual": "A white bird grooms itself near a pond loudly, then a young man with a leaf blower begins to clean an area.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "VGeZLZJdxBg_000022_000032.mp4", "caption": "A couple people stand in a vat of grapes and stomp them very quickly/", "counterfactual": "A couple people stand in a vat of grapes and stomp them very slowly", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-EHqT6ZDcb4_000011_000021.mp4", "caption": "A girl climbs a suspended rope partway in a gym while other girls clamor.", "counterfactual": "A girl climbs a suspended rope fully in a gym while other girls watch.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "EBBJM-rGcX0_000000_000010.mp4", "caption": "A contestant participates in a shock put contest while the judges examine his toss closely.", "counterfactual": "A contestant participates in a shock put contest while the judges examine his toss casually.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "m2_qmRnjICE_000017_000027.mp4", "caption": "A man is picking apples and putting them in a bin carefully while a man is talking about the apples.", "counterfactual": "A man is picking apples and putting them in a bin carelessly while a man is talking about the apples.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "MhVg5YenAps_000001_000011.mp4", "caption": "A person attempts to thread a needle multiple times with little success.", "counterfactual": "A person attempts to thread a needle once with great success.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Z8YcQALgi2o_000351_000361.mp4", "caption": "A person wearing a helmet and attached to a harness slowly climbs down a slippery mountain with a rope.", "counterfactual": "A person wearing a helmet and attached to a harness quickly climbs down a slippery mountain with a rope.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "r6QEw8m4yu4_000020_000030.mp4", "caption": "Two guys are dueling with jousting stick and one of them gets hit in the face accidentally.", "counterfactual": "Two guys are dueling with jousting stick and one of them gets hit in the face intentionally.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "YhNzDQrUUdA_000001_000011.mp4", "caption": "Girl in pink dress marches backwards across studio floor and turns forward to finish with running steps.", "counterfactual": "Girl in pink dress marches backwards across studio floor and turns forward to finish with slow walking steps.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pdS4p-BNpRQ_000016_000026.mp4", "caption": "A man running in the snow as he throws a ladel into the snow far away", "counterfactual": "A man running in the snow as he throws a ladel into the snow close by", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "oLVxjvNTTVw_000057_000067.mp4", "caption": "A balloon dog is partially made in the first few steps.", "counterfactual": "A balloon dog is fully made in the first few steps.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "bdEhYyz7z2E_000127_000137.mp4", "caption": "A pencil is shown in fast speed drawing a picture.", "counterfactual": "A pencil is shown in slow motion drawing a picture.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "Y5EQN8-opaU_000001_000011.mp4", "caption": "I person is ice skating on ice and the scene is in fast motion.", "counterfactual": "A person is ice skating on ice and the scene is in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-coszqJ8J7w_000000_000010.mp4", "caption": "A person skiing behind a boat moves quickly from side to side.", "counterfactual": "A person skiing behind a boat moves slowly from side to side.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_kQxazaUhMk_000001_000011.mp4", "caption": "A man is using a brush to do some art by painting in a careful manner.", "counterfactual": "A man is using a brush to do some art by painting in a rough manner.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "05ZSAMVA7g4_000004_000014.mp4", "caption": "A male high jumper is successfully performing a jump at a track meet.", "counterfactual": "A male high jumper is unsuccessfully performing a jump at a track meet.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "eHl051ajzN8_000056_000066.mp4", "caption": "A golfer sets up to perform a long drive on a golf course.", "counterfactual": "A golfer sets up to perform a short drive on a golf course.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "dhjUIvHSlKw_000006_000016.mp4", "caption": "A little boy slowly goes down a heel on a snowboard while doing some turns.", "counterfactual": "A little boy quickly goes down a heel on a snowboard while doing some turns.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "w7Z4x_09kPY_000303_000313.mp4", "caption": "A woman is shown at home happily opening presents at Christmas.", "counterfactual": "A woman is shown at home sadly opening presents at christmas.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pkbYpNYqyJk_000010_000020.mp4", "caption": "A man is on a treadmill running at a high speed.", "counterfactual": "A man is on a treadmill running at a low speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "86CfWe9ds60_000000_000010.mp4", "caption": "Two men stand in a cow pen, then the men take turns swinging their hand at the cow, then the cow becomes agitated", "counterfactual": "Two men stand in a cow pen, then the men take turns swinging their hand at the cow, then the cow goes into a calm state", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "c_gQ9CSaZY4_000000_000010.mp4", "caption": "Someone has a bunch of clothes folded on the floor and places them one by one into a bag.", "counterfactual": "Someone has a bunch of clothes folded on the floor and places them all at once into a bag.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "D-dJ--BP2yY_000021_000031.mp4", "caption": "A man running fast and hold a wood from hand and jumping high.", "counterfactual": "A man running fast and jumping low.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "gqUIuaCUgCk_000055_000065.mp4", "caption": "A man sets off in a kayak and tentatively paddles left and right as he goes off slowly into the distance.", "counterfactual": "A man sets off in a kayak and paddles straight into the distance as he goes off quickly into the distance.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "s4MzGCYB9SM_000260_000270.mp4", "caption": "Someone demonstrates how to pour oil carefully into a vehicle.", "counterfactual": "Someone demonstrates how to pour oil quickly into a vehicle.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "NqYl5Q_Tb7g_000049_000059.mp4", "caption": "A person slowly paddles a kayak toward another kayak on a calm lake.", "counterfactual": "A person quickly paddles a kayak toward another kayak on a calm lake.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "I56FHUiYEEg_000007_000017.mp4", "caption": "A young man runs and throws a javelin at a far distance while competing.", "counterfactual": "A young man runs and throws a javelin at a near distance while competing.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "jQblrPUh-FM_000008_000018.mp4", "caption": "A sitting at a table in the conference room slowly flips bills in a stack of money that he is holding.", "counterfactual": "A sitting at a table in the conference room  quickly flips bills in a stack of money that he is holding.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "7bzoR6jv8o4_000000_000010.mp4", "caption": "Man chews, places potato chip partly into mouth, tilts head back, lifts hands to shoulder, and wiggles.", "counterfactual": "Man chews, places potato chip completely into mouth, tilts head forward, lowers hands to hips, and wiggles.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2GAPlZ6gD8s_000038_000048.mp4", "caption": "A man is standing outside and juggling some balls very quickly", "counterfactual": "A man is standing outside and juggling some balls very slowly", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "C4S1PvZ8TeY_000083_000093.mp4", "caption": "A group of skiers ski tentatively down a snow covered slope falling along the way", "counterfactual": "A group of skiers ski down a snow covered slope skiing confidently and cleanly", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8Dk21aq68DY_000102_000112.mp4", "caption": "On a very snowy road, a snow plow drives quickly down the road.", "counterfactual": "On a very snowy road, a snow plow drives slowly down the road.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "2GAPlZ6gD8s_000038_000048.mp4", "caption": "A youg man juggles three balls rapidly while he stands outside on the lawn", "counterfactual": "A youg man juggles three balls slowly while he stands outside on the lawn", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "OASCPKazLIM_000132_000142.mp4", "caption": "A person carefully begins to gift wrap a book on a table.", "counterfactual": "A person quickly begins to gift wrap a book on a table.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "TCVjcN3FIg4_000100_000110.mp4", "caption": "A man happily rides a toboggan down the icy luge.", "counterfactual": "A man unhappily rides a toboggan down the icy luge.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "a4Muq4BQOlE_000000_000010.mp4", "caption": "Several people are stabbing at material located in small containers continuously.", "counterfactual": "Several people are stabbing at material located in small containers intermittently.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "TtZNidgf-Fo_000141_000151.mp4", "caption": "A person moves and industrial sander slowly back and forth on a wooden floor", "counterfactual": "A person moves and industrial sander quickly back and forth on a wooden floor", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "mwH1ue9RaQ8_000004_000014.mp4", "caption": "A large group of people utilize a home made sled to go down a hill at a low rate of speed.", "counterfactual": "A large group of people utilize a home made sled to go down a hill at a high rate of speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "_JpGo7Qr8vE_000041_000051.mp4", "caption": "A girl raises and lowers her eyebrows, then smiles and laughs, while a man raises and lowers his eyebrows, and a baby smiles.", "counterfactual": "A girl raises and lowers her eyebrows, then smiles and laughs, while a man raises and lowers his eyebrows, and a baby frowns.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "8FlOhqpiavs_000005_000015.mp4", "caption": "a couple of people hug each other while they are next to each other", "counterfactual": "a couple of people hug each other while they are on top of each other", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "NOJQPKw9yto_000000_000010.mp4", "caption": "A man is riding roller skates in a gym and slides quickly.", "counterfactual": "A man is riding roller skates in a gym and slides slowly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "750QhTe9Z4U_000000_000010.mp4", "caption": "A boy drives a red tractor slowly over a field of grass.", "counterfactual": "A boy drives a red tractor quickly over a field of grass.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "y4J5iNYRYiE_000180_000190.mp4", "caption": "A woman shows how to cook some food really slow and gives the time.", "counterfactual": "A woman shows how to cook some food really fast and gives the time.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "qW57bMrrA8M_000000_000010.mp4", "caption": "A man wearing a black hat, takes his time and lets out a slow yawn.", "counterfactual": "A man wearing a black hat, takes his time and lets out a fast yawn.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-MbgmB0jOpY_000004_000014.mp4", "caption": "A man seems to be skiing in the designated path seemingly without effort.", "counterfactual": "A man seems to be skiing in the designated path seemingly with effort.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "5QSrCC6LgXQ_000000_000010.mp4", "caption": "A kid runs down a track and then makes a small jump into sand.", "counterfactual": "A kid runs down a track and then makes a big jump into sand.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "phpv6WPyKDo_000000_000010.mp4", "caption": "A man quickly cuts green onions on a cutting board", "counterfactual": "A man slowly cuts green onions on a cutting board", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FcyojK5_5Ak_000006_000016.mp4", "caption": "during the competition a man is running in a park and then propelling himself off using a stick but fails to do it successfully", "counterfactual": "during the competition a man is running in a park and then propelling himself off using a stick successfully", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pg1Lnaj8la8_000003_000013.mp4", "caption": "Teenage boy sitting on the edge of a bed playing a guitar with skill.", "counterfactual": "Teenage boy sitting on the edge of a bed playing a guitar with badly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4ilyKmcgOOg_000000_000010.mp4", "caption": "Someone is rapelling slowly down the side of a building.", "counterfactual": "Someone is rapelling quickly down the side of a building.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "ycZLj9YgG4c_000004_000014.mp4", "caption": "In a mixing bowl someone mixes something and prepares a recipe in fast motion.", "counterfactual": "In a mixing bowl someone mixes something and prepares a recipe in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "yZnVFmHkwdM_000114_000124.mp4", "caption": "A man is shown in accelerated motion as he installs floor covering in a room.", "counterfactual": "The man is installing floor covering in a room at a slower speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "pdS4p-BNpRQ_000016_000026.mp4", "caption": "A boy runs a way down a snow covered street and then throws a projectile object hard.", "counterfactual": "A boy runs down a snow covered street and then throws a projectile object soft.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9fuIpQgnNEQ_000049_000059.mp4", "caption": "A group of people form a line outside and walk slowly as the line moves.", "counterfactual": "A group of people form a line outside and walk quickly as the line moves.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "OnsSTe5gPkM_000000_000010.mp4", "caption": "Two people, riding a raft together, slide down a water slide very fast, and slide part way up the other side.", "counterfactual": "Two people, riding a raft together, slide down a water slide very fast, and slide all the way up the other side.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "wcMVNGauxks_000014_000024.mp4", "caption": "A person wearing a skull mask moves his head around agressively.", "counterfactual": "A person wearing a skull mask moves his head around passively.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "w1bG4NHIlJM_000024_000034.mp4", "caption": "A person lifts up a sheet from a bed very slowly.", "counterfactual": "A person lifts up a sheet from a bed very quickly.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "80gP00Rpv7o_000074_000084.mp4", "caption": "A young woman applies makeup to her face and then says that applying makeup is not difficult.", "counterfactual": "A young woman applies makeup to her face and then says that applying makeup is difficult.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "OEq2LB9GS6w_000392_000402.mp4", "caption": "One person is holding the pet while the other strokes its head, causing the pet to quickly shakes its head", "counterfactual": "Two people are holding the pet while the other strokes its head, causing the pet to quickly shakes its head", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "c_gQ9CSaZY4_000000_000010.mp4", "caption": "A person is packing clothes and putting them in green bags in fast motion.", "counterfactual": "A person is packing clothes and unpacking them in green bags in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9PiozWZtilo_000016_000026.mp4", "caption": "A woman tries to dive in the pool but lands face first on accident.", "counterfactual": "A woman tried to dive in the pool but landed face first on purpose.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "S0K9hxuTlj0_000013_000023.mp4", "caption": "Two men are making sausage and eggs and the video is in fast motion.", "counterfactual": "Two men are making sausage and eggs and the video is in slow motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "FtBS6OZSGMI_000028_000038.mp4", "caption": "A man slowly pours beer from a bottle into a glass", "counterfactual": "A man quickly pours beer from a bottle into a glass", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "cHsOSosRVSs_000016_000026.mp4", "caption": "A young girl falls over in the kitchen in slow motion.", "counterfactual": "A young girl falls over in the kitchen in fast motion.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "IB0GWABkT-k_000189_000199.mp4", "caption": "Riding a skateboard down a paved suburban street on a sunny day at a rapid pace.", "counterfactual": "Riding a skateboard down a paved suburban street on a sunny day at a moderate pace.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "JCFOBsuCop0_000000_000010.mp4", "caption": "A group of students fall to the floor at the same time.", "counterfactual": "A group of students fall to the floor at different times.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "EA3HCx0yTIY_000281_000291.mp4", "caption": "A man sits at his drum set and slowly hits the symbols continuously.", "counterfactual": "A man sits at his drum set and rapidly hits the symbols continuously.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "-Q8eF2vIooQ_000002_000012.mp4", "caption": "A man slowly rides a horse in a fenced area, and picks up speed.", "counterfactual": "A man quickly rides a horse in a fenced area, and picks up speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "4gsbJ71r59A_000000_000010.mp4", "caption": "A man runs really fast with a bull in his hand and fails to jump over the barrier", "counterfactual": "A man runs with a bull in his hand and jumps over a barrier", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "9Kt6FIFQrTM_000009_000019.mp4", "caption": "A person skis down a snowy slope at a fast speed.", "counterfactual": "A person skis down a snowy slope at a slow speed.", "aspect": "Intensity"}
{"src_dataset": "VATEX", "video_name": "SD4G3Z4dQaU_000000_000010.mp4", "caption": "A girl plays the saxophone as the video moves in fast motion.", "counterfactual": "A girl plays the saxophone as the video moves in slow motion.", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8037.mp4", "caption": "people dancing in unison", "counterfactual": "people dancing individually", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7856.mp4", "caption": "two asian women yell at each other", "counterfactual": "two asian women whisper at each other", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9240.mp4", "caption": "leeches are all over teenagers bodies and they frantically pull them off", "counterfactual": "leeches are all over teenagers bodies and they slowly pull them off", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8100.mp4", "caption": "a talk show host interviews stephen hawking in a comedic way", "counterfactual": "a talk show host interviews stephen hawking in a serious way", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9627.mp4", "caption": "people struggling to walk through snow covered field", "counterfactual": "people walking through snow covered field without struggling", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9724.mp4", "caption": "two men are singing excitedly", "counterfactual": "two men are singing quietly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8296.mp4", "caption": "a student is reprimanded by a teacher as others watch the event", "counterfactual": "a student is praised by a teacher as others watch the event", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7551.mp4", "caption": "a slow journey down an outdoor stairway and walkway with no narration and the only sound being that of heavy rain", "counterfactual": "a fast journey down an outdoor stairway and walkway with no narration and the only sound being that of heavy rain", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9801.mp4", "caption": "man and woman are dancing slowly on an important day", "counterfactual": "man and woman are dancing very fast on an important day", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7264.mp4", "caption": "there is a man is singing a song very calmly", "counterfactual": "there is a man is singing a song very loudly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8238.mp4", "caption": "some one in a kitchen cutting crabs carefully with a knife", "counterfactual": "some one in a kitchen cutting crabs carelessly with a knife", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7182.mp4", "caption": "a man in a red shirt and a man in a green shirt play table tennis competitively", "counterfactual": "a man in a green shirt and a man in a red shirt play table tennis casually", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7856.mp4", "caption": "a woman is shouting angrily at another woman", "counterfactual": "a woman is talking calmly to another woman", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9088.mp4", "caption": "a person in  blue color cloth wearing dress inside water swimming water  moving ups and down fast displaying on screen", "counterfactual": "a person in blue color cloth wearing dress inside water swimming water  moving ups and down slow displaying on screen", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9405.mp4", "caption": "people at a roadside cafe happily  catch air borne balloons tied to little gifts", "counterfactual": "people at a roadside cafe furiously catch air born balloons tied to little gifts", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7616.mp4", "caption": "an orange sports car accelerates quickly", "counterfactual": "an orange sports car slowly accelerates", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9765.mp4", "caption": "men ride their horses through the race track at high speeds", "counterfactual": "men ride their horses at a low speed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7518.mp4", "caption": "minecraft characters are having a funny discussion", "counterfactual": "minecraft characters are having a serious discussion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9003.mp4", "caption": "two men compete in a game of table tennis by vigorously volleying the ping pong ball over the net", "counterfactual": "two men compete in a game of table tennis by slowly volleying the ping pong ball over the net", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7116.mp4", "caption": "a woman is chastised for not wearing a full face cover", "counterfactual": "a woman is praised for not wearing a full face cover", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9949.mp4", "caption": "the black sports car drives fast in the dirt road", "counterfactual": "the black sports car drives slowly in the dirt road", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9328.mp4", "caption": "car driving at really fast speed", "counterfactual": "car driving at normal speed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8457.mp4", "caption": "a man rowing a kayak is shown in slow motion", "counterfactual": "a man rowing a kayak is shown in normal speed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9234.mp4", "caption": "man yells at another", "counterfactual": "man quietly says something to another", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7854.mp4", "caption": "a person is playing a colourful video game very nicely", "counterfactual": "a person is playing a colourful video game very badly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9475.mp4", "caption": "images of a video game are flashing quickly across the screen", "counterfactual": "images of a video game are flashing slowly across the screen", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7108.mp4", "caption": "a young woman rushing through a couple of places", "counterfactual": "a young woman walking calmly through a couple of places", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7273.mp4", "caption": "a women in black dress is singing happily", "counterfactual": "a women in black dress is singing sadly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8522.mp4", "caption": "a child and young girl make funny faces", "counterfactual": "a child and young girl make normal faces", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8913.mp4", "caption": "a vine sports video that change music quickly and features several different sports", "counterfactual": "a vine sports video that change music slowly and features several different sports", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9234.mp4", "caption": "a dark man rapidly speaking arabic excitedly gestures towards the dirt road to a companion walking with him", "counterfactual": "a dark man slowly speaking arabic excitedly gestures towards the dirt road to a companion walking with him", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8239.mp4", "caption": "the race is starting and players run fast", "counterfactual": "the race is finishing and players run slow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9337.mp4", "caption": "a grand old lady shops for some large garlic at her favorite market and point out to her best salesman", "counterfactual": "a lady in a hurry shops for some large garlic at her favorite market and points to her best salesman", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8140.mp4", "caption": "an animated girl is talking excitedly to three women", "counterfactual": "an animated girl is talking quietly to three women", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8354.mp4", "caption": "a complaining fellow drives a car that is hard to turn", "counterfactual": "a fellow drives a car that is easy to turn", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7869.mp4", "caption": "hands carefully adjust a selfie stick that is holding a phone", "counterfactual": "hands quickly adjust a selfie stick that is holding a phone", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9229.mp4", "caption": "a man is eating ice cream with a cookie and his friend cuts up the pint to make a cookie sandwich very efficiently", "counterfactual": "a man is eating ice cream with a cookie and his friend cuts up the pint to make a cookie sandwich very inefficiently", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7964.mp4", "caption": "a man is holding a woman tightly", "counterfactual": "a man is holding a woman gently", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7856.mp4", "caption": "a woman is talking loudly to a crowd with big rollers in her hair", "counterfactual": "a woman is talking softly to a crowd with big rollers in her hair", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8166.mp4", "caption": "two people are talking and agreeing with each other on a television show", "counterfactual": "two people are talking and arguing with each other on a television show", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9606.mp4", "caption": "a man is faster snow riding", "counterfactual": "a man is slower snow riding", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7661.mp4", "caption": "a woman pacifying the other one", "counterfactual": "a woman is shouting at the other one", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7223.mp4", "caption": "the red clock handles move around really fast", "counterfactual": "the red clock handles move around really slow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9877.mp4", "caption": "a quarterback throws a long pass", "counterfactual": "a quarterback passes a short pass", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7171.mp4", "caption": "a scantily-clad britney spears sarcastically answers news anchors  questions at a press conference before giving them all a piece of her mind", "counterfactual": "a scantily-clad britney spears seriously answers news anchors questions at a press conference before giving them all a piece of her mind", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9603.mp4", "caption": "a person is frantically answering her phone", "counterfactual": "a person is calmly talking on her phone", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8421.mp4", "caption": "a group of women are swimming professionally", "counterfactual": "a group of women are swimming casually", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7315.mp4", "caption": "crowd is applauding loudly", "counterfactual": "crowd is clapping softly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9328.mp4", "caption": "a fast car is racing down a track", "counterfactual": "a slow car is racing down a track", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8162.mp4", "caption": "a girl sings impressively on the voice", "counterfactual": "a girl sings unimpressive on the voice", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9433.mp4", "caption": "woman yelling while she is on the phone", "counterfactual": "woman speaking in a low voice while she is on the phone", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7872.mp4", "caption": "the brown van is driven carefully on the street", "counterfactual": "the brown van is driven carelessly on the street", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8397.mp4", "caption": "an animal staring at the camera and moving its mouth quickly", "counterfactual": "an animal staring at the camera and moving its mouth slowly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8806.mp4", "caption": "a fashion magazine is shown close-up", "counterfactual": "a fashion magazine is shown wide-angle", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7616.mp4", "caption": "a fast car speeds away", "counterfactual": "a slow car speeds away", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9214.mp4", "caption": "a car is driving at high rate of speed and avoids hitting another car", "counterfactual": "a car is driving at a low rate of speed and hits another car", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7852.mp4", "caption": "a stroller is collapsed easily", "counterfactual": "a stroller is not easily collapsed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9190.mp4", "caption": "two players wrestling on the stage strongly", "counterfactual": "two players wrestling on the stage gently", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7872.mp4", "caption": "a yellow coloured school bus is moving slowly in a busy street", "counterfactual": "a yellow coloured school bus is moving fast in a busy street", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9219.mp4", "caption": "the b-boy dancer is dancing hard", "counterfactual": "the b-boy dancer is dancing lightly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9296.mp4", "caption": "a blue baby stroller rotates and slowly collapes while written instructions appear on the left side of the screen", "counterfactual": "a blue baby stroller rotates and quickly collapses while written instructions appear on the left side of the screen", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7781.mp4", "caption": "singers are singing a song in a music show passionately", "counterfactual": "singers are singing a song in a music show slowly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8455.mp4", "caption": "a man talking a driving a car fast", "counterfactual": "a man talking a driving a car slow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7544.mp4", "caption": "a car goes racing down the road", "counterfactual": "a car drives slowly down the road", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9118.mp4", "caption": "track runners take off quickly to jump hurdles", "counterfactual": "track runners take off slowly to skip hurdles", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8356.mp4", "caption": "a cartoon  game firing gun shot moving fast running  displaying on screen", "counterfactual": "a cartoon game firing gun shot moving slow running  displaying on screen", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8749.mp4", "caption": "a reporter is talking about marijuana business being slow", "counterfactual": "a reporter is talking about marijuana being sold at a brisk pace", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8094.mp4", "caption": "fireworks shooting high in the sky", "counterfactual": "fireworks shooting low in the sky", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7929.mp4", "caption": "a sport vehicle is driving erratically around a city while a british man explains how to play the video game", "counterfactual": "a sport vehicle is driving normally around a city while a british man explains how to play the video game", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7197.mp4", "caption": "a man is running in fast forward maneuvering men with guns", "counterfactual": "a man is running in slow motion maneuvering men with guns", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9588.mp4", "caption": "sports injuries are displayed up close", "counterfactual": "sports injuries are displayed at a distance", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8939.mp4", "caption": "a woman tensely describes flying a spacecraft on a plane across the country", "counterfactual": "a woman calmly describes flying a spacecraft on a plane across the country", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7389.mp4", "caption": "a girl responds tersely to her boyfriend s question", "counterfactual": "a girl replies kindly to her boyfriend s question", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7050.mp4", "caption": "a woman shows how easy her baby stroller folds", "counterfactual": "a woman shows how hard her baby stroller folds", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9096.mp4", "caption": "a short clip of the pirates of the caribbean film", "counterfactual": "a long clip of the pirates of the caribbean film", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9519.mp4", "caption": "a short clip showing a concert taking place", "counterfactual": "a long clip showing a concert taking place", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9806.mp4", "caption": "a man is driving very fast through curvy roads in a forest", "counterfactual": "a man is driving very slow through curvy roads in a forest", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8137.mp4", "caption": "a person acting funny here", "counterfactual": "a person acting normal here", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8519.mp4", "caption": "three cars travel slowly on a road while demonstrating their features", "counterfactual": "three cars travel quickly on a road while demonstrating their features", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8288.mp4", "caption": "a blue car is moving on a road very fast", "counterfactual": "a blue car is moving on a road very slow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8469.mp4", "caption": "three birds are shown in a cage while a man whispers something to them", "counterfactual": "three birds are shown in a cage while a man screams something to them", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7888.mp4", "caption": "a woman talking to the camera about plants and getting excited", "counterfactual": "a woman talking to the camera about plants and getting calm", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7332.mp4", "caption": "youngsters enjoying by dancing together", "counterfactual": "youngsters enjoying by dancing separately", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7491.mp4", "caption": "a senior professor at a school of material sciences explains about this science in brief", "counterfactual": "a senior professor at a school of material sciences explains about this science in detail", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9381.mp4", "caption": "an alpaca talks in a high pitched voice  his name is nutter butter and describes himself as an appalooza", "counterfactual": "an alpaca talks in a low pitched voice his name is nutter butter and describes himself as an alpaca", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8255.mp4", "caption": "a person playing a key board interestingly", "counterfactual": "a person playing a key board normally", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8492.mp4", "caption": "a man making weird noises at a webcam", "counterfactual": "a man makes normal noises at a webcam", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8469.mp4", "caption": "kitchen is showed slowly", "counterfactual": "kitchen is showed quickly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8261.mp4", "caption": "a young woman with a flower headband is speaking very softly while moving her finger in a caressing motion", "counterfactual": "a young woman with a flower headband is speaking very loudly while moving her finger in a caressing motion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9800.mp4", "caption": "a race car crashes along a racetrack", "counterfactual": "a race car avoids crashing along a racetrack", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7778.mp4", "caption": "f1 car racer driving his vehicle very fast", "counterfactual": "f1 car racer driving his vehicle very slow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7422.mp4", "caption": "chef explains quickly how to make a meal", "counterfactual": "a chef explains slowly how to make a meal", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8104.mp4", "caption": "a professional tennis match the players are hitting the ball very high in the air the ball does not touch the ground", "counterfactual": "a professional tennis match the players are hitting the ball very low in the air the ball touches the ground", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7309.mp4", "caption": "a man is wearing wings and acting very silly as he pretends to do cpr", "counterfactual": "a man is wearing wings and acting very serious as he pretends to do cpr", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9371.mp4", "caption": "people are loading two vehicles in fast motion while a guy talks while driving down the road", "counterfactual": "people are unloading two vehicles in slow motion while a guy talks while driving down the road", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7057.mp4", "caption": "people are running around in a panic", "counterfactual": "people are running around in a calm, orderly fashion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9240.mp4", "caption": "two boys are frantically trying to swat leaches off of their skin", "counterfactual": "two boys are casually swatting leaches off of their skin", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9574.mp4", "caption": "a man in a black wetsuit energetically rides a small pipe", "counterfactual": "a man in a black wetsuit casually rides a small pipe", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7435.mp4", "caption": "a male giving a spirited talk about personal events", "counterfactual": "a male giving a somewhat sedate talk about personal events", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8891.mp4", "caption": "a female is running hard on a trail and their are also guys running", "counterfactual": "a female is running very slowly on a trail and there are also guys running", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8953.mp4", "caption": "a game show host is laughing hysterically", "counterfactual": "a game show host is laughing softly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9512.mp4", "caption": "the players are  wearing uniforms madly running here and there to get the ball", "counterfactual": "the players are  wearing uniforms and running around the field in an orderly fashion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7126.mp4", "caption": "person is driving his new car fast on the street", "counterfactual": "person is driving his new car slowly on the street", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7600.mp4", "caption": "a man is using a paddle to hit a small white ball across a table in slow motion", "counterfactual": "a man is using a paddle to hit a small white ball across a table in normal motion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7966.mp4", "caption": "a man shows how to thinly slice potatoes", "counterfactual": "a man shows how to roughly slice potatoes", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9545.mp4", "caption": "two men in wwii era clothing and uniform speak frankly in the woods", "counterfactual": "two men in wwii era clothing and uniform whisper gently in the woods", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7381.mp4", "caption": "three teens singing together", "counterfactual": "three teens singing individually", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8266.mp4", "caption": "super heroes are action packed", "counterfactual": "super heroes are slow-moving", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9800.mp4", "caption": "someone is drive a car very fast and make an accident", "counterfactual": "someone is driving a car at the speed limit", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7340.mp4", "caption": "a guy sits in the driver s seat of a car and explains some of the car s features", "counterfactual": "a guy sits in the driver s seat of a car and explains all of the car s features", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8272.mp4", "caption": "two men are seated on the couch and talking with weird voice", "counterfactual": "two men are seated on the couch and talking normally", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7624.mp4", "caption": "a terrific hiphop dance performance", "counterfactual": "a decent hiphop dance performance", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8483.mp4", "caption": "slowly stirring the water into flour", "counterfactual": "stirring the water into flour very quickly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8586.mp4", "caption": "a boat is slowly in the water", "counterfactual": "a boat is quickly in the water", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9720.mp4", "caption": "a person singing very energeticaly and interestingly", "counterfactual": "a person singing very sedentarilly and gently", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9165.mp4", "caption": "a man is playing voilin intrestingly", "counterfactual": "a man is playing voilin badly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7160.mp4", "caption": "a cartoon boy almost falls asleep", "counterfactual": "a cartoon boy suddenly falls asleep", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9206.mp4", "caption": "in a kitchen a man is yelling at a faucet", "counterfactual": "in a kitchen a man is gently turning a faucet", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8397.mp4", "caption": "the brown animal is looking straight in the camera", "counterfactual": "the brown animal is looking sideways in the camera", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9070.mp4", "caption": "man connects hose to a drain", "counterfactual": "man is trying to connect hose to a drain unsuccessfully", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7600.mp4", "caption": "a man hits a ping pong ball at just the right angle in slow motion", "counterfactual": "a man hits a ping pong ball at just the right angle in real time", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8022.mp4", "caption": "on a street a woman is talking while a lot of vans are passing", "counterfactual": "on a street a woman is talking while a few vans are passing", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9193.mp4", "caption": "a short clip showcasing a woman talking about upcoming movies", "counterfactual": "a long clip showcasing a woman talking about upcoming movies", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8017.mp4", "caption": "slow motion of a man running into another woman during a race", "counterfactual": "fast motion of a man running into another woman during a race", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9147.mp4", "caption": "two guys take their sports car for a fast ride", "counterfactual": "two guys take their sports car for a leisurely ride", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7032.mp4", "caption": "a man is demonstrating a skill in detail", "counterfactual": "a man is demonstrating a skill very quickly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9650.mp4", "caption": "a basketball player in a video game jumps high", "counterfactual": "a basketball player in a video game jumps low", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7693.mp4", "caption": "a man explains how to use a rubik s cube step-by-step", "counterfactual": "a man explains how to use a rubik s cube very quickly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9174.mp4", "caption": "a man is singing loudly in a car", "counterfactual": "a man is singing softly in a car", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9337.mp4", "caption": "women walking around a small marketing speaking with a slight accent looking for chives", "counterfactual": "women walk around a small market speaking with a strong accent looking for chives", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7078.mp4", "caption": "two girls and a boy are dancing in a silly manner", "counterfactual": "two girls and a boy are dancing in a wonderful manner", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7662.mp4", "caption": "cars driving out of control", "counterfactual": "cars driving safely on a crowded highway", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9255.mp4", "caption": "an army man is in critical situation", "counterfactual": "an army man is in a normal situation", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9624.mp4", "caption": "a football running back evades the defense for a long carry", "counterfactual": "a football running back being chased by the defense for a short carry", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7958.mp4", "caption": "man on skis quickly plummets down slope", "counterfactual": "a person on skis slowly glides down slope", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9735.mp4", "caption": "an unseen female describes the commercial washing of potatoes in a comical way", "counterfactual": "an unseen female describes the commercial washing of potatoes in a normal way", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7886.mp4", "caption": "in a kitchen someone is slicing a potato carefully with knife on the desk", "counterfactual": "in a kitchen someone is slicing a potato carelessly with a knife on the desk", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9062.mp4", "caption": "dog sneezes a lot", "counterfactual": "dog sneezes only once", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8104.mp4", "caption": "tennis players playing in slow motion and voice over talks about the match", "counterfactual": "tennis players playing in normal speed and voice over talks about the match", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7841.mp4", "caption": "some men flying through the air at high speed", "counterfactual": "some men flying through the air at low speed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7309.mp4", "caption": "a man dressed humorously screams and laughs on the floor", "counterfactual": "a man dressed seriously screams and laughs on the floor", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8133.mp4", "caption": "a commentary about sports sounds like football but not too clear from the showing", "counterfactual": "a commentary about sports sounds like football very clearly from the showing", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8586.mp4", "caption": "a person is speaking about egyptian history in a program", "counterfactual": "a person is speaking about egyptian history in a whisper", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9214.mp4", "caption": "reckless caars driving down the road", "counterfactual": "caars driving safely down the road", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7635.mp4", "caption": "a man and a woman play a short sketch", "counterfactual": "a man and a woman perform a long sketch", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8185.mp4", "caption": "a person explains with great interest about a recipe he is going to show using potatoes", "counterfactual": "a person explains with little interest about a recipe he is going to show using potatoes", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9850.mp4", "caption": "a piece of copper pipe sticking out of a machine being turned and cut off at an angle", "counterfactual": "a piece of copper pipe sticking out of a machine being turned and cut off straight", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9024.mp4", "caption": "the anchor is talking all the time and the other participants are listening carefully", "counterfactual": "the anchor is talking occasionally and the other participants are talking to each other", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8359.mp4", "caption": "a man on a surfboard is flying through the big waves", "counterfactual": "a man on a surfboard is moving slowly through the big waves", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7522.mp4", "caption": "a couple of runway models take turns strutting down a catwalk", "counterfactual": "a couple of runway models strut down the catwalk in unison", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9463.mp4", "caption": "phil cutting off his own foot while shaq freaks out", "counterfactual": "phil cutting off his own foot while shaq is calm", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9309.mp4", "caption": "this person tried to eat shrimp salad with chopsticks and failed", "counterfactual": "this person quickly ate shrimp salad with chopsticks and succeeded", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7868.mp4", "caption": "a red sedan moving fast on the road and takes sharp turns", "counterfactual": "a red sedan moving slowly on the road and takes smooth turns", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9219.mp4", "caption": "some one performing dance beautifully", "counterfactual": "some one performing dance clumsily", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7856.mp4", "caption": "a woman with rollers in her hair is shouting", "counterfactual": "a woman with rollers in her hair is talking normally", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8070.mp4", "caption": "the cement truck drives down the  street wildly", "counterfactual": "the cement truck drives down the street slowly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9175.mp4", "caption": "a man walks over to a bed and starts passionately kissing a woman", "counterfactual": "a man walks over to a bed and starts calmly kissing a woman", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9593.mp4", "caption": "a man talks to the camera before a series of images rapidly play", "counterfactual": "a man talks to the camera and then a series of images slowly play", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7773.mp4", "caption": "a group of jockets on horses are racing around a track at full speed", "counterfactual": "a group of jockets on horses are slowly racing around a track at half speed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8694.mp4", "caption": "a white van zips around and drives over rough terrain", "counterfactual": "a white van slowly drives around and drives over rough terrain", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9025.mp4", "caption": "a woman is painting her toenails with vibrant colors", "counterfactual": "a woman is painting her toenails with subtle colors", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7357.mp4", "caption": "two players battle furiously on tennis court for points", "counterfactual": "two players play a gentle game of tennis for points", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9786.mp4", "caption": "two  men together  and one woman are having a conversation all dressed up formally", "counterfactual": "two men are together and one woman are having a conversation all dressed up casually", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7236.mp4", "caption": "a man is singing intensely", "counterfactual": "a man is singing quietly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9028.mp4", "caption": "the marijuan business is slow to grow", "counterfactual": "the marijuan business is fast to grow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8600.mp4", "caption": "a in a sweater in front of a blue screen talks about a janitor who made a fortune", "counterfactual": "a in a sweater in front of a blue screen talks about a janitor who made a little money", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9158.mp4", "caption": "few alpascas are standing close a woman is petting them", "counterfactual": "few alpascas are standing far a woman is petting them", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9107.mp4", "caption": "lady is busy preparing food", "counterfactual": "lady is lazy preparing food", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9704.mp4", "caption": "an animated bus rolls over in slow motion", "counterfactual": "an animated bus rolls over in fast motion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9542.mp4", "caption": "this video is a bunch of football clips about players making good plays", "counterfactual": "this video is a bunch of football clips about players making average plays", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9272.mp4", "caption": "cg cartoon characters dancing together", "counterfactual": "cg cartoon characters dancing separately", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8190.mp4", "caption": "a boy in sunglasses is talking on a grass hill with a lot of dead spots", "counterfactual": "a boy in sunglasses is talking on a grass hill with a few dead spots", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8166.mp4", "caption": "they are talking together", "counterfactual": "they are yelling at each other", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9806.mp4", "caption": "a person is riding a car very fast in a place", "counterfactual": "a person is riding a car very slowly in a place", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7773.mp4", "caption": "the horses are running very very fast and want the first place", "counterfactual": "the horses are running moderately fast and want the first place", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7340.mp4", "caption": "a man shows some of the features in his car interior", "counterfactual": "a man shows all of the features in his car interior", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7685.mp4", "caption": "series of people trying to comically review movies", "counterfactual": "series of people trying to seriously review movies", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7713.mp4", "caption": "some people gather around in a circle in a solemn fashion", "counterfactual": "some people gather around in a circle in a cheerful fashion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8739.mp4", "caption": "the transmission of a car should be maintained regularly", "counterfactual": "the transmission of a car should be maintained irregularly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8595.mp4", "caption": "a man is getting out of a running vehicle", "counterfactual": "a man is getting out of a slow-moving vehicle", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7662.mp4", "caption": "a car drives recklessly through traffic", "counterfactual": "a car drives calmly through traffic", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9823.mp4", "caption": "highlights are shown of some violent collisions during a rugby match", "counterfactual": "highlights are shown of some peaceful collisions during a rugby match", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8570.mp4", "caption": "many people and their dogs have spotted a polar bear in the ice the dogs are alert", "counterfactual": "many people and their dogs have spotted a polar bear in the ice the dogs are calm", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9938.mp4", "caption": "a women is giving cooing instruction on a gas stove sturing in different spices", "counterfactual": "a women is giving stern instruction on a gas stove sturing in different spices", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7182.mp4", "caption": "two men playing ping pong professionally and aggressive", "counterfactual": "two men playing ping pong with a light and gentle touch", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9328.mp4", "caption": "a car is racing down a race track", "counterfactual": "a car is slowly driving down a race track", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9545.mp4", "caption": "two mans wearing black and green dress and talking seriously about one thing", "counterfactual": "two men wearing black and green dress and talking casually about one thing", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7167.mp4", "caption": "a group of men are having a heated discussion", "counterfactual": "a group of men are having a civil discussion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8351.mp4", "caption": "a nature area is showing some mountains far away", "counterfactual": "a nature area is showing some mountains very close", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8139.mp4", "caption": "cute little parrot on branch he feeds food to parrot it nicely get food and eat", "counterfactual": "cute little parrot on branch he feeds food to parrot it forcefully gets food and eats", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8878.mp4", "caption": "mountaineers are happily getting ready to go up the mountains full of snow", "counterfactual": "mountaineers are angrily getting ready to go up the mountains full of snow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9772.mp4", "caption": "a male talking in a comical fashion while animated shows play", "counterfactual": "a male talks in a serious fashion while animated shows play", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9592.mp4", "caption": "the woman runner is falling many times and again running in the women s athletics race", "counterfactual": "the woman runner is falling few times and again running in the women s athletics race", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9003.mp4", "caption": "a professional ping pong match takes place where an amazing play is shown in slow mo", "counterfactual": "a professional ping pong match takes place where an amazing play is shown in regular speed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9544.mp4", "caption": "the monkey dances in celebration", "counterfactual": "the monkey dances solemnly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7018.mp4", "caption": "some guy nonchalantly shows slides of different rap scenes while a rap voiceover is comically played", "counterfactual": "some guy excitedly shows slides of different rap scenes while a rap voiceover is comically played", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7283.mp4", "caption": "ambulance is passing on the road with the heavy speed", "counterfactual": "ambulance is passing on the road with the normal speed", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7718.mp4", "caption": "slow motion of a goat attacking camera man", "counterfactual": "fast motion of a goat attacking camera man", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7649.mp4", "caption": "one tractor is coming in the forest so hardly", "counterfactual": "one tractor is coming in the forest so fast", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8252.mp4", "caption": "a zoom in of a picture of an older gentleman in a black suit with glasses standing next to a younger woman in a white wedding dress while a narrator tearfully talks", "counterfactual": "a zoom in of a picture of an older gentleman in a black suit with glasses standing next to a younger woman in a white wedding dress while a narrator angrily talks", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7120.mp4", "caption": "an animated man is driving a car in race and talk to a boy", "counterfactual": "an animated man is driving a car in a quiet way and talk to a boy", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7923.mp4", "caption": "a area with rocks and a stream of fast rushing water", "counterfactual": "a area with plants and a slow flowing stream of water", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7078.mp4", "caption": "kids dancing silly for camera", "counterfactual": "kids dancing normal for camera", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9855.mp4", "caption": "a girl show her anger to mum", "counterfactual": "a girl shows her sadness to mum", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7458.mp4", "caption": "a young basketball player navigates himself expertly on the court dodging all players to reach the net", "counterfactual": "a young basketball player navigates himself very badly on the court, dodging all players to reach the net", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7807.mp4", "caption": "the girl yells at the monkey making him mad", "counterfactual": "the girl yells at the monkey making him sad", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9293.mp4", "caption": "family stands around an ambulance looking concerned", "counterfactual": "family stands around an ambulance looking indifferent", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9425.mp4", "caption": "a very hyper man is talking about buying stocks", "counterfactual": "a man talks about stocks very softly and slowly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7153.mp4", "caption": "a man slams another man into the ground during wrestling", "counterfactual": "a man lightly pushes another man into the ground during wrestling", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9019.mp4", "caption": "a man is shooting basketballs at the goal while being very loud", "counterfactual": "a man is shooting basketballs at the goal while being very quiet", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7484.mp4", "caption": "a man is gently slicing a slab of meat with a large knife the meat is on a yellow cutting board", "counterfactual": "a man is violently slicing a slab of meat with a large knife the meat is on a yellow cutting board", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7184.mp4", "caption": "a commentator is speaking about a horse race the horses are moving slowly", "counterfactual": "a commentator is speaking about a horse race the horses are moving fast", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9923.mp4", "caption": "in the hotwel room the long hair men is telling some important matter in very loudly", "counterfactual": "in the hotwel room the long hair men is telling some important matter in very quietly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8973.mp4", "caption": "an animated clip of a guy in a sports car acting confident", "counterfactual": "an animated clip of a guy in a sports car acting anxious", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9062.mp4", "caption": "a dog on a pillow shakes his head fiercely", "counterfactual": "a dog on a pillow is shaking his head gently", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7846.mp4", "caption": "man punching a bag in slow motion", "counterfactual": "man punching a bag in fast motion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8288.mp4", "caption": "temporary auto pilot car is going very fast", "counterfactual": "temporary auto pilot car is going very slow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9872.mp4", "caption": "a person is playing guitar beautifully", "counterfactual": "a person is playing guitar poorly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8559.mp4", "caption": "a horse wins the race", "counterfactual": "a horse finishes second in the race", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8428.mp4", "caption": "makeup is being applied in fast motion on a womans eyelid", "counterfactual": "makeup is being applied in slow motion on a womans eyelid", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7886.mp4", "caption": "a man is slicing a potato very thinly", "counterfactual": "a man is slicing a potato very thickly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7311.mp4", "caption": "girl showing how to use every day things productively", "counterfactual": "girl showing how to use every day things destructively", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7205.mp4", "caption": "a man in black suit jacket plays electric guitar slowly with band playing in back", "counterfactual": "a man in black suit jacket plays electric guitar quickly with band playing in back", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9599.mp4", "caption": "a man is bowling professionally", "counterfactual": "a man is bowling casually", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7057.mp4", "caption": "some people are moving fast", "counterfactual": "some people are moving slow", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9485.mp4", "caption": "in the sea shore coffee shop the flowers in the tree are swing in very well", "counterfactual": "in the sea shore coffee shop the flowers in the tree are swinging in very low", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8134.mp4", "caption": "the beautiful greenish blue ocean water ripples slowly toward the shore", "counterfactual": "the beautiful greenish blue ocean water ripples quickly toward the shore", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7527.mp4", "caption": "a woman is shouting angrily", "counterfactual": "a woman is shouting excitedly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8540.mp4", "caption": "the grim reaper is slowly approaching a car", "counterfactual": "the grim reaper is quickly approaching a car", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9188.mp4", "caption": "a man surrounded by other men speaks aggressively to another man", "counterfactual": "a man surrounded by other men speaks gently to another man", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8792.mp4", "caption": "a singer being judged", "counterfactual": "a singer being praised", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8645.mp4", "caption": "there is a man is shouting with a person", "counterfactual": "there is a man is whispering with a person", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9099.mp4", "caption": "a pretty woman had done her eye make-up very beautifully", "counterfactual": "a pretty woman had done her eye make-up very poorly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9168.mp4", "caption": "a man narrates part of the churro creation process", "counterfactual": "a man narrates the whole churro creation process", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9724.mp4", "caption": "two men sing very enthusiastically", "counterfactual": "two men sing very poorly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9857.mp4", "caption": "will smith threatening another male in prison while other inmates wince in disgust", "counterfactual": "will smith threatening another male in prison while other inmates cower in fear", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8017.mp4", "caption": "the players are walking slowly after the race finished", "counterfactual": "the players are walking quickly after the race finished", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9189.mp4", "caption": "the beautiful girl in black dress is singing well and her friends are supporting her nicely", "counterfactual": "the beautiful girl in black dress is singing well and her friends are supporting her badly", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7182.mp4", "caption": "players play a fast paced game of table tennis against one another", "counterfactual": "players play a slow paced game of table tennis against one another", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8359.mp4", "caption": "a boy is playing in a sea waves very nicely without fear", "counterfactual": "a boy is playing in a sea waves with fear", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8655.mp4", "caption": "animated gopher makes a narrow escape", "counterfactual": "a gopher gets caught by the tail by a dog", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8074.mp4", "caption": "a woman is cheering to herself silently after seeing a man", "counterfactual": "a woman is cheering to herself loudly after seeing a man", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9431.mp4", "caption": "a man is drawing a cartoon in fast motion while another man explains the concept behind what the man is drawing", "counterfactual": "a man explains the concept behind what the man is drawing in fast motion while another man draws the cartoon in slow motion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7649.mp4", "caption": "there is a vehicle riding dangerously through forest", "counterfactual": "a vehicle drives safely through a forest", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video8839.mp4", "caption": "cartoon characters dancing together", "counterfactual": "cartoon characters dancing separately", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video7530.mp4", "caption": "an octopus moving through the water in fast motion", "counterfactual": "an octopus moving through the water in slow motion", "aspect": "Intensity"}
{"src_dataset": "MSRVTT", "video_name": "video9099.mp4", "caption": "a woman is being shown using some of her makeup talents", "counterfactual": "a woman is being shown using all of her makeup talents", "aspect": "Intensity"}
